[
  {
    "text": "The Impact of the Heart's Action on Quran Recitation and Reflection (Athar 'Amal al-Qalb 'ala Tilawat al-Qur'an wa Tadabburihi)\nAuthor: إبراهيم بن حسن الحضريتي\nYear: Null",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "The Impact of the Heart's Action on Quran Recitation and Reflection (Athar 'Amal al-Qalb 'ala Tilawat al-Qur'an wa Tadabburihi)",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "new_page_number": 1
  },
  {
    "text": "sn: 5583\nbook_title: أثر عمل القلب على تلاوة القرآن وتدبره\nbook_link: https://shamela.ws/book/864\nbook_id: 864\nauthor_name: إبراهيم بن حسن الحضريتي\nauthor_year: Null\nnickname: Null\nauthor_link: https://shamela.ws/author/491\nauthor_ID: 491\neditor: Null\npublisher: Null\nedition: Null\npages: 82\nvolumes: Null\npagination: [كتاب إلكتروني بترقيم الشاملة]\ncategory: الرقائق والآداب والأذكار\ncategory_id: 23",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "The Impact of the Heart's Action on Quran Recitation and Reflection (Athar 'Amal al-Qalb 'ala Tilawat al-Qur'an wa Tadabburihi)",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "new_page_number": 2
  },
  {
    "serial_number": "4929197",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Impact of the Heart's Action on Quran Recitation and Reflection (Athar 'Amal al-Qalb 'ala Tilawat al-Qur'an wa Tadabburihi)",
    "edition": "None",
    "publisher": "None",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: Softening of Hearts, Etiquette, and Adhkar\nBook: The Impact of the Heart's Action on Quran Recitation and Reflection\nAuthor: Ibrahim bin Hassan Al-Hadriti",
    "foot_note": "None",
    "book_id": "864",
    "new_page_number": 3
  },
  {
    "serial_number": "4929198",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Impact of the Heart's Action on Quran Recitation and Reflection",
    "edition": "None",
    "publisher": "None",
    "page_number": 1,
    "volume_number": 1,
    "text": "Series: The Impact of the Heart's Action on Acts of Worship (4)\nIn the name of Allah, the Most Gracious, the Most Merciful\nThe Impact of the Heart's Action on Quran Recitation and Reflection\nDr. Ibrahim bin Hassan Al-Hadriti",
    "foot_note": "None",
    "book_id": "864",
    "new_page_number": 4
  },
  {
    "serial_number": "4929199",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Impact of the Heart's Action on Quran Recitation and Reflection",
    "edition": "None",
    "publisher": "None",
    "page_number": 2,
    "volume_number": 1,
    "text": "In the name of Allah, the Most Gracious, the Most Merciful\n\nIntroduction\nIndeed, all praise is due to Allah. We praise Him, seek His help, and ask for His forgiveness. We seek refuge in Allah from the evils of our souls and the bad consequences of our deeds. Whoever Allah guides, no one can mislead, and whoever He leaves astray, no one can guide. I testify that there is no god but Allah alone, without partner, and I testify that Muhammad is His servant and Messenger.\n{O you who have believed, fear Allah as He should be feared and do not die except as Muslims [in submission to Him]} [Al-Imran: 102].\n{O mankind, fear your Lord, who created you from one soul and created from it its mate and dispersed from both of them many men and women. And fear Allah, through whom you ask one another, and the wombs. Indeed Allah is ever, over you, an Observer} [An-Nisa: 1].\n{O you who have believed, fear Allah and speak words of appropriate justice (70) He will [then] amend for you your deeds and forgive you your sins. And whoever obeys Allah and His Messenger has certainly attained a great attainment} [Al-Ahzab: 70, 71].\nNow then:\nGiving attention to mentioning the impact of the heart's action on the worship of reciting the Quran and reflecting upon it is one of the greatest things that should be cared for and strived for; because there is no glory or honor for a Muslim in this world, nor status with Allah, except by turning to this Book through recitation, reflection, and action. The Sunnah is also linked to it. Allah says: {We have certainly sent down to you a Book in which is your mention. Then will you not reason?} [Al-Anbiya: 10]. And He says: {So adhere to that which has been revealed to you. Indeed, you are on a straight path (43) And indeed, it is a remembrance for you and your people, and you are going to be questioned} [Az-Zukhruf: 43 - 44].\nThis book, which Allah helped me with and granted me success to write, is the fourth in this blessed series (The Impact of the Heart's Action on Acts of Worship). I ask Allah Almighty, by His grace and generosity, to grant me sincerity in it, and to benefit me and everyone who reads it with it. Praise be to Allah first and last, outwardly and inwardly, and there is no power nor strength except through Allah.\nDr. Ibrahim bin Hassan Al-Hadriti\nImam and Khateeb of Al-Qana'ah Mosque in Sharai' Al-Mujahidin, Makkah Al-Mukarramah\nebrahim1407@gmail.com",
    "foot_note": "None",
    "book_id": "864",
    "new_page_number": 5
  },
  {
    "serial_number": "4929200",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Impact of the Heart's Action on Quran Recitation and Reflection",
    "edition": "None",
    "publisher": "None",
    "page_number": 3,
    "volume_number": 1,
    "text": "These are the axes around which this research revolves:\n\n**Introduction**, containing two prefaces:\n*   **Preface 1:** The Holy Quran is a medicine, healing, light, and guidance. A servant does not benefit from it unless his locus (heart) is receptive to it.\n*   **Preface 2:** Allah says: {And those who strive for Us - We will surely guide them to Our ways. And indeed, Allah is with the doers of good} [Al-Ankabut: 69].\n\n**Chapter One: A Summary on Proving the Impact of the Heart's Action and Its Importance**, containing several requirements:\n*   **Requirement 1:** From the evidences of the Quran and Sunnah proving the impact of the heart's action.\n*   **Requirement 2:** The importance of the heart's action.\n*   **Requirement 3:** The general effects of the heart's action on acts of worship.\n\n**Chapter Two: The Heart is Not Affected by the Quran, Nor Benefits from It, Nor Does Its Effect Appear on the Limbs Except by Achieving the Following Requirements:**\n*   **Requirement 1:** Sincerity to Allah Almighty and extreme eagerness for the soundness of intention.\n*   **Requirement 2:** Eagerness to follow the Prophetic guidance in this act of worship.\n*   **Requirement 3:** Adhering to sincere repentance and frequent sincere seeking of forgiveness.\n*   **Requirement 4:** Frequent supplication and persistence in asking Allah to grant the servant the sweetness of Quran recitation, finding pleasure in it, the heart's focus on it, and good reflection upon it.\n*   **Requirement 5:** The servant's feeling in his heart of the greatness of the Quran's impact.\n*   **Requirement 6:** The servant's eagerness to reflect upon the Great Quran, containing several elements:\n    *   First: Meaning of reflection (Tadabbur) and its types.\n    *   Second: Importance of reflection and evidences for it.\n    *   Third: The Sunnah's dispraise of people known for frequent recitation without reflecting on its meanings or understanding it according to the way of the Companions.\n    *   Fourth: Means of reflection.",
    "foot_note": "None",
    "book_id": "864",
    "new_page_number": 6
  },
  {
    "serial_number": "4929201",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Impact of the Heart's Action on Quran Recitation and Reflection",
    "edition": "None",
    "publisher": "None",
    "page_number": 4,
    "volume_number": 1,
    "text": "For this reflection, there are several means, including:\n1.  Seeking refuge in Allah from the accursed Satan before recitation.\n2.  Repeating the verse or verses on a single topic.\n3.  Living with one's heart and feelings in the meaning of the verses, swimming with one's thought in their meanings, moving one's heart with them, and imagining their scenes as if seeing them with the eye.\n4.  Holding oneself accountable if one does not find an effect of the verses in one's heart.\n5.  [Duplicate point] Holding oneself accountable if one does not find an effect of the verses in one's heart.\n6.  Reciting the verses slowly (Tartil) and beautifying the voice as much as possible without affectation.\n7.  Being keen on seclusion with one's Lord in the darkness of the night when reflecting on the verses.\n8.  Emptying oneself from what disturbs one's heart and thought - of distractions - when reciting or listening to it.\n9.  Emptying oneself from what disturbs one's heart and thought - of distractions - when reciting or listening to it, and searching for what is more beneficial for one's heart.\n10. Reviewing the states of the Predecessors (Salaf) with the Great Quran.\n\n**Chapter Three: Manifestations and Signs of the Impact of the Heart's Action on the Servant's Benefit from the Great Quran:**\n*   **First:** Increased humility of the limbs following the increase of the heart's humility, and being affected by the verses leading to weeping out of fear of Allah, glorifying Him, and revering Him, and to shivering of the skin out of fear of Him, and then the softening of the heart and skin to the remembrance of Allah.\n*   **Second:** Increase of faith in the heart, the effect of which appears on the limbs through feeling the greatness of Allah and awe of Him in the hearts, and hastening and racing to Allah's pleasure and His Paradise, resulting in expansion of the chest and tranquility of the heart.\n*   **Third:** [Incomplete/Missing Text]\n*   **Fourth:** Adopting the character of the Quran.",
    "foot_note": "None",
    "book_id": "864",
    "new_page_number": 7
  },
  {
    "serial_number": "4929202",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Impact of the Heart's Action on Quran Recitation and Reflection",
    "edition": "None",
    "publisher": "None",
    "page_number": 5,
    "volume_number": 1,
    "text": "**Chapter Four: Obstacles preventing the heart from being affected by the Great Quran**, containing a preface and requirements.\n\n**Preface:**\n*   **Requirement 1:** Defect in intention and purpose.\n*   **Requirement 2:** Defect in following the Prophetic guidance in reciting and reflecting upon the Quran.\n*   **Requirement 3:** Lack of purity of the heart.\n*   **Requirement 4:** Not estimating the Speech of Allah with its true estimation.\n*   **Requirement 5:** Attachment of the heart to other than Allah.\n*   **Requirement 6:** Heedlessness about meeting Allah in the Hereafter.\n*   **Requirement 7:** Shortcomings in performing obligatory duties, and consequently neglecting voluntary ones.\n*   **Requirement 8:** Sitting with people of desires who strike parts of the Quran against others, follow its ambiguous parts, and leave its clear parts.\n*   **Requirement 9:** Sins committed in seclusion.\n*   **Requirement 10:** Attachment to forbidden desires of the self, such as listening to forbidden things, looking at them, and consuming forbidden things.",
    "foot_note": "None",
    "book_id": "864",
    "new_page_number": 8
  },
  {
    "serial_number": "4929203",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Impact of the Heart's Action on Quran Recitation and Reflection",
    "edition": "None",
    "publisher": "None",
    "page_number": 6,
    "volume_number": 1,
    "text": "**Preface:** Two important introductions:\n\n**First Introduction: The Holy Quran is a medicine, healing, light, and guidance. A servant does not benefit from it unless his locus (heart) is receptive to it.**\nIt was said in *Al-Khulasa*: \"It is the living heart; for if the heart is pure and alert, that produces in it every noble description and meaning; because 'if the heart is tender and soft, its acceptance of knowledge is easy and simple, and knowledge becomes firmly established, stable, and effective in it. But if it is hard and thick, its acceptance of knowledge is difficult and hard. Along with that, it must be pure, clear, and sound; so that knowledge thrives in it and produces good fruit. Otherwise, if it accepts knowledge while containing turbidity and malice, that knowledge is corrupted, and it becomes like weeds in crops; if it doesn't prevent the grain from sprouting, it prevents it from thriving and being good. This is evident to people of insight' (1). Hence, the Companions, may Allah be pleased with them, used to learn faith before the Quran. Jundub bin Abdullah, may Allah be pleased with him, said: 'We were with the Prophet, peace be upon him, while we were young boys approaching puberty. We learned faith before we learned the Quran, then we learned the Quran and increased in faith thereby' (3). And Abdullah bin Umar, may Allah be pleased with him, said: 'We lived for a period of time, and one of us would be given faith before the Quran. A Surah would be revealed to Muhammad, peace be upon him, and we would learn its lawful and unlawful, its commands and prohibitions, and where one should stop in it, just as you learn the Quran today. Then I saw men today, one of whom is given the Quran before faith; he reads what is between its opening and its closing, not knowing its commands nor prohibitions, nor where he should stop in it' (4). And from Hudhayfah, may Allah be pleased with him: 'We are a people who were given faith before we were given the Quran, and you are a people who were given the Quran...",
    "foot_note": "1. Majmu' al-Fatawa (9/ 315). \n2. Plural of hazwar, meaning one approaching puberty. Al-Nihaya fi Gharib al-Hadith wa al-Athar (1/ 380). \n3. Narrated by Ibn Majah (1/ 23) No. (61), Al-Bayhaqi in Shu'ab al-Iman (1/ 152) No. (50), and Al-Sunan Al-Kubra (6/ 78) No. (5357). Al-Albani authenticated it in his checking of Sunan Ibn Majah No. (61), and Shu'aib Al-Arna'ut said in his checking of Sunan Ibn Majah (1/ 42): 'Its chain is authentic'. \n4. Narrated by Al-Hakim (1/ 91) No. (101) who authenticated it and Al-Dhahabi agreed, and Al-Bayhaqi in Al-Sunan Al-Kubra (6/ 78) No. (5355).",
    "book_id": "864",
    "new_page_number": 9
  },
  {
    "serial_number": "4929204",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Impact of the Heart's Action on Quran Recitation and Reflection",
    "edition": "None",
    "publisher": "None",
    "page_number": 7,
    "volume_number": 1,
    "text": "...before being given faith' (1). It was reported from Uthman, may Allah be pleased with him: 'If your hearts were pure, you would not be satiated with the Speech of Allah Almighty' (2). According to the life of the heart is its being affected, its reflection, and its remembrance; sometimes it strengthens, sometimes it weakens, and it may vanish and disappear, as indicated by what came in many places in the Book of Allah Almighty about sealing hearts, stamping on them, and deviating them. The owner of this encased or inverted heart does not attain any reflection, lesson, thought, or benefit from what he reads or hears of the verses of Allah Almighty. Ibn Abbas, may Allah be pleased with them both, said regarding His saying: {For whoever has a heart} [Qaf: 37]: 'The hypocrites used to sit with the Messenger of Allah, peace be upon him, then leave and say: What did he say just now?! They have no hearts' (3); referring to His saying about the hypocrites: {And among them are those who listen to you, until when they depart from you, they say to those who were given knowledge, \"What has he said just now?\" Those are the ones of whom Allah has sealed over their hearts and who have followed their [own] desires} [Muhammad: 16]' End of quote from the book *Al-Khulasa fi Tadabbur al-Quran* (4).",
    "foot_note": "1. Narrated by Al-Bayhaqi in Al-Sunan Al-Kubra (6/ 78) No. (5356). \n2. Narrated by Imam Ahmad in Al-Zuhd (p. 106) No. (680), and Abu Nu'aym in Hilyat al-Awliya (7/ 300). \n3. Narrated in Al-Durr al-Manthur (7/ 608) from Ibn Mardawayh from Ibn Abbas, may Allah be pleased with them both. \n4. Al-Khulasa fi Tadabbur al-Quran al-Karim (pp. 41 - 42).",
    "book_id": "864",
    "new_page_number": 10
  },
  {
    "serial_number": "4929205",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Impact of the Heart's Action on Quran Recitation and Reflection",
    "edition": "None",
    "publisher": "None",
    "page_number": 8,
    "volume_number": 1,
    "text": "**Second Introduction:**\nAllah says: {And those who strive for Us - We will surely guide them to Our ways. And indeed, Allah is with the doers of good} [Al-Ankabut: 69]. There are several interpretations of this verse, including:\n1. It is said: We will increase them in guidance, as He said: {And Allah increases those who were guided, in guidance} [Maryam: 76].\n2. And it is said: We will grant them success to hit the straight path, and the straight path is what leads to the pleasure of Allah Almighty.\n3. And it is said: Striving (Mujahada) is patience in acts of obedience.\n4. Al-Hasan said: The best Jihad is opposing desire.\n5. Al-Fudayl bin Iyad said: Those who strive in seeking knowledge, We will guide them to the ways of acting upon it.\n6. Sahl bin Abdullah said: Those who strive in establishing the Sunnah, We will guide them to the ways of Paradise.\n7. It was narrated from Ibn Abbas: Those who strive in Our obedience, We will guide them to the ways of Our reward (1).\nAllah says: {And whoever strives only strives for [the benefit of] himself. Indeed, Allah is free from need of the worlds} [Al-Ankabut: 6]. Whoever strives against his disbelieving enemy, and against his self by patience in acts of obedience, and strives against his desire and his devil, the fruit of that striving returns only to him (2).\nBased on this, whoever strives against himself to reflect upon the Quran, benefit from its admonitions, and act upon it, Allah grants him success to obtain that and reach it, and guides him to what He loves and is pleased with. If Allah knows from the servant sincerity of intention and sincere desire to reflect upon the Quran and benefit from it, and expending the means for that, foremost of which is supplication in which the servant persists with his Lord, then Allah opens for him and guides him to the causes of success in that.",
    "foot_note": "1. See: Tafsir Al-Baghawi (6/ 256). \n2. See: Tafsir Al-Baghawi (6/ 233), Tafsir Ibn Kathir (6/ 264), Tafsir Al-Sa'di (626).",
    "book_id": "864",
    "new_page_number": 11
  },
  {
    "serial_number": "4929206",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Impact of the Heart's Action on Quran Recitation and Reflection",
    "edition": "None",
    "publisher": "None",
    "page_number": 9,
    "volume_number": 1,
    "text": "**Chapter One: A Summary on Proving the Impact of the Heart's Action and Its Importance**, containing several requirements.\n\n**Requirement 1: From the evidences of the Quran and Sunnah proving the impact of the heart's action.**\nThe Great Quran and the Noble Sunnah have paid great attention to the issue of the heart's action and its impact. Many verses have come proving the impact of the heart's action and its being affected by what its owner does. Allah Almighty mentioned that the hearts of believers become fearful, find tranquility in His remembrance, and become humble and submissive to His command, and much more. Once this is established regarding believers, the Holy Quran mentioned in contrast the state of disbelievers and hypocrites and the affection of their hearts by what they do. He Almighty also mentioned the impact of their hearts' diseases on them; such as sealing, stamping, hypocrisy, deviation from truth, hardness, etc. Many verses came clarifying that. Also, many Hadiths came proving the impact of the heart's action. Here is a summary proving that:\n\n**First: Examples proving the impact of the heart's action on the believer with their evidences from the Great Quran.**\n1. **Fear of the heart from Allah:** Allah says: {The believers are only those who, when Allah is mentioned, their hearts become fearful} [Al-Anfal: 2]. In it is proof of the impact of remembering Allah on the heart by the occurrence of fear (Wajal), meaning: Fear of Allah (1). Undoubtedly, remembrance does not produce its effect in achieving fear of the heart from Allah Almighty unless the heart agrees with the senses.\n2. **Tranquility of the heart:** Allah says: {Those who have believed and whose hearts are assured by the remembrance of Allah. Unquestionably, by the remembrance of Allah hearts are assured} [Ar-Ra'd: 28]. The verse indicated the impact of remembering Allah on the believer's heart, for it finds comfort, goodness, and calmness in the remembrance of Allah Almighty (2).",
    "foot_note": "1. See: Tafsir Ibn Kathir (5/ 425). \n2. See: Tafsir Al-Tabari (16/ 432).",
    "book_id": "864",
    "new_page_number": 12
  },
  {
    "serial_number": "4929207",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Impact of the Heart's Action on Quran Recitation and Reflection",
    "edition": "None",
    "publisher": "None",
    "page_number": 10,
    "volume_number": 1,
    "text": "**Second: Examples proving the impact of heart disease on its owner mentioned in the verses of the Mighty Book.**\n1. **Allah's punishment for owners of hearts that disbelieved in Allah by sealing them, and the deviation of hearts from the truth.** He Almighty said about them: {Indeed, those who disbelieve - it is all the same for them whether you warn them or do not warn them - they will not believe (6) Allah has set a seal upon their hearts and upon their hearing, and over their vision is a veil. And for them is a great punishment} [Al-Baqarah: 6, 7]. Al-Baghawi said in his interpretation of the meaning of sealing hearts: \"He said: {Allah has set a seal}: Allah stamped {upon their hearts} so they do not comprehend good nor understand it\" (1). This sealing of hearts is a punishment for them due to a cause from themselves. Allah says: {So when they deviated, Allah caused their hearts to deviate. And Allah does not guide the defiantly disobedient people} [As-Saff: 5].\n2. **Among the effects of the disease of hypocrisy on hearts is restricting them from good by what occurs to them of hesitation, fluctuation, doubt, confusion, and laziness towards acts of obedience and hating them.** Allah says: {Only those would ask permission of you who do not believe in Allah and the Last Day and whose hearts have doubted, so they in their doubt are hesitating} [At-Tawbah: 45]. Doubt (Rayb) is skepticism, and it is an effect of the diseases of hypocrisy on hearts. From it is generated its effect on the heart through hesitation, fluctuation, and laziness towards obedience and hating it. Allah says clarifying the effect of hypocrisy on the heart: {Indeed, the hypocrites [think to] deceive Allah, but He is deceiving them. And when they stand for prayer, they stand lazily, showing [themselves to] the people and not remembering Allah except a little (142) Wavering between them, [belonging] neither...",
    "foot_note": "1. Tafsir Al-Baghawi (1/ 64 - 65).",
    "book_id": "864",
    "new_page_number": 13
  },
  {
    "serial_number": "4929208",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Impact of the Heart's Action on Quran Recitation and Reflection",
    "edition": "None",
    "publisher": "None",
    "page_number": 11,
    "volume_number": 1,
    "text": "3. ...to the believers nor to the disbelievers. And whoever Allah leaves astray - never will you find for him a way} [An-Nisa: 142, 143]. And He said about the hypocrites: {And they do not come to prayer except while they are lazy and they do not spend except while they are unwilling} [At-Tawbah: 54].\n4. **Allah Almighty stated regarding the effect of the disease of hypocrisy on the heart that He does not enable its owner to work; rather, He holds him back from it as a punishment for the disease in his heart:** {And if they had intended to go forth, they would have prepared for it [some] preparation. But Allah disliked their being sent, so He kept them back, and they were told, \"Remain [behind] with those who remain.\"} [At-Tawbah: 46]. If a servant finds himself held back from acts of obedience and prevented from them, let him inspect for a disease in his heart.\n5. **The impact of sins on the heart in covering it and veiling it from seeing the truth**, as in Allah's saying: {No! Rather, the stain has covered their hearts of that which they were earning} [Al-Mutaffifin: 14]. Allah affirmed that sins cover the hearts, veiling them from seeing the truth so they do not accept it, as in the hadith of Abu Huraira, may Allah be pleased with him, from the Messenger of Allah, peace be upon him, who said: \"When a servant commits a sin, a black dot is marked (1) in his heart. If he gives up, seeks forgiveness, and repents, his heart is polished (2). But if he returns [to the sin], it is increased until it covers his heart. That is...",
    "foot_note": "1. Meaning a dot is placed in his heart. See: Al-Sihah (1/ 269), Al-Nihaya (5/ 114) by Ibn Al-Athir, entry (Nakat). \n2. In most narrations: \"Suqila\" with Sad. Saqal and Saqal mean the same: polished, cleaned, cleared, and the trace of sin removed. See: Al-Sihah (5/ 1744) entry (Saqal), Mirqat al-Mafatih (4/ 1622), Tuhfat al-Ahwadhi (9/ 178) by Al-Mubarakpuri, Dar Al-Kutub Al-Ilmiyah Beirut.",
    "book_id": "864",
    "new_page_number": 14
  },
  {
    "serial_number": "4929209",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Impact of the Heart's Action on Quran Recitation and Reflection",
    "edition": "None",
    "publisher": "None",
    "page_number": 12,
    "volume_number": 1,
    "text": "...the Ran (stain) which Allah mentioned: {No! Rather, the stain has covered their hearts of that which they were earning} [Al-Mutaffifin: 14]\" (1). When sins cover the heart, it becomes blind to seeing the truth and its insight is obliterated, as Allah says: {For indeed, it is not eyes that are blinded, but blinded are the hearts which are within the breasts} [Al-Hajj: 46].\n\n**Third: The Sunnah clarifies the status of the heart's action and its impact on its owner. Here is an indication of that:**\n1. **The impact of the heart's action on the righteousness or corruption of the body.** This is indicated by what Al-Nu'man bin Bashir, may Allah be pleased with him, narrated, saying: The Prophet, peace be upon him, said: \"Beware! There is a piece of flesh in the body if it becomes good (reformed) the whole body becomes good but if it gets spoilt the whole body gets spoilt and that is the heart.\" The hadith indicates - as Ibn Rajab says - \"that the righteousness of the servant's movements with his limbs, his avoidance of prohibitions, and his guarding against ambiguities depend on the righteousness of his heart's movement. If his heart is sound, containing nothing but love for Allah, love for what Allah loves, fear of Allah, and fear of falling into what He hates, all the movements of the limbs become righteous. This results in avoiding all prohibitions and guarding against ambiguities for fear of falling into prohibitions. But if the heart is corrupt, dominated by following its desire and seeking what it loves even if Allah hates it, all the movements of the limbs become corrupt, and they are driven to all sins and ambiguities according to the following of the heart's desire\" (2).\n2. **The link between Taqwa (piety) and the heart's action.** The Prophet, peace be upon him, says: \"Taqwa is here,\" pointing to his chest three times... Hadith (3). Al-Nawawi mentioned in his explanation of the hadith that Taqwa is achieved through the actions of the heart. He says: \"Outward actions do not achieve Taqwa; rather, it is achieved by what occurs in the heart of glorifying...",
    "foot_note": "1. Narrated by Ahmad (13/ 333) No. (7952), Al-Tirmidhi (5/ 434) No. (3334) who said: \"Hasan Sahih\", Ibn Majah (2/ 1418) No. (4244), Ibn Hibban (3/ 210) No. (930), Al-Hakim (2/ 562) No. (3908) who authenticated it and Al-Dhahabi agreed, Al-Albani classified it as Hasan in Sahih Al-Targhib (2/ 271) No. (1620), and Shu'aib Al-Arna'ut said in checking Al-Musnad (13/ 334) No. (7952): \"Its chain is strong\". \n2. Jami' al-Ulum wa al-Hikam by Ibn Rajab (1/ 210). \n3. Narrated by Muslim (4/ 1986) No. (2564).",
    "book_id": "864",
    "new_page_number": 15
  },
  {
    "serial_number": "4929210",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Impact of the Heart's Action on Quran Recitation and Reflection",
    "edition": "None",
    "publisher": "None",
    "page_number": 13,
    "volume_number": 1,
    "text": "...Allah Almighty, fearing Him, and being conscious of Him\" (1).\n3. **Clarifying the impact of the disease of pride on the heart.** Abdullah bin Mas'ud, may Allah be pleased with him, reported that the Prophet, peace be upon him, said: \"He who has in his heart the weight of a mustard seed of pride shall not enter Paradise.\" A man said: \"Verily a man likes that his dress should be fine, and that his shoes should be fine!\" He said: \"Verily Allah is Beautiful and He loves beauty. Pride is disdaining the truth and despising people\" (2). In the hadith is evidence of the impact of the affliction of pride on the one who has it; it is one of the most dangerous diseases of the heart and one of the greatest things that turn hearts away from guidance.",
    "foot_note": "1. Sharh Al-Nawawi on Muslim (16/ 121). \n2. Narrated by Muslim (1/ 93) No. (91).",
    "book_id": "864",
    "new_page_number": 16
  },
  {
    "serial_number": "4929211",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Impact of the Heart's Action on Quran Recitation and Reflection",
    "edition": "None",
    "publisher": "None",
    "page_number": 14,
    "volume_number": 1,
    "text": "**Requirement 2: Importance of the heart's action.**\nThe indication of the importance of the heart's action is clear through the following matters:\n\n**First: Its frequent mention in the Great Quran**, and reference to that has preceded.\n\n**Second: Sufficient indication of the high status of the heart's action in the Sunnah is what is stated in the following two hadiths:**\n1. From Abu Huraira who said: The Messenger of Allah, peace be upon him, said: \"Verily Allah does not look to your bodies nor to your wealth, but He looks to your hearts and to your deeds\" (1). So hearts and their deeds are the place of the Lord's gaze.\n2. And he, peace be upon him, said: \"Beware! There is a piece of flesh in the body if it becomes good (reformed) the whole body becomes good but if it gets spoilt the whole body gets spoilt and that is the heart\" (2). So the righteousness of the limbs is linked to the righteousness of the heart, and this has a great impact on the believer's humility in his prayer.\n\n**Third: Ibn al-Qayyim spoke about the importance of the heart's action**, saying: \"The action of the heart is the spirit and core of servitude. If the action of the limbs is devoid of it, it is like a dead body without a spirit... Whoever contemplates the Sharia in its sources and resources knows the connection between the actions of the limbs and the actions of the hearts, that they are of no benefit without them, and that the actions of the hearts are more obligatory upon the servant than the actions of the limbs. Is the believer distinguished from the hypocrite except by what is in the heart of each of them of actions that distinguished between them?! Can anyone enter Islam except by the action of his heart before his limbs?! Servitude of the heart is greater than servitude of the limbs, more frequent, and more lasting; it is obligatory at all times. For this reason, faith is obligatory on the heart constantly, and Islam is obligatory on the limbs at certain times\" (3). Actions of the hearts are the origin, and they are individual obligations by agreement of the people of faith; whoever leaves them entirely is either a disbeliever or a hypocrite. Actions of the limbs are subordinate and complementary to the actions of the hearts and are not complete without them (4).",
    "foot_note": "1. Narrated by Muslim (4/ 1987) No. (2564). \n2. Narrated by Al-Bukhari (1/ 20) No. (52), and Muslim (3/ 1219) No. (1599). \n3. Bada'i' al-Fawa'id (3/ 192 - 193). \n4. See: Majmu' al-Fatawa (18/ 184 - 185), Bada'i' al-Fawa'id (3/ 187 - 188).",
    "book_id": "864",
    "new_page_number": 17
  },
  {
    "serial_number": "4929212",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Impact of the Heart's Action on Quran Recitation and Reflection",
    "edition": "None",
    "publisher": "None",
    "page_number": 15,
    "volume_number": 1,
    "text": "**Requirement 3: The general effects of the heart's action on acts of worship, summarized as follows:**\n1. **Allah's acceptance of the deed**, which depends on two conditions:\n    a.  Striving against the self for sincerity to Allah Almighty, which produces eagerness for the soundness of intentions in acts of worship, free from vanity, showing off, and seeking reputation.\n    b.  Striving against the self to follow the Prophetic guidance in performing worship and ensuring it is free from innovation.\n2. **Purity of the heart from attachment to other than Allah produces presence of heart in worship** and prevents its dispersion in the valleys of the world. It does not lead to distress with worship or finding it heavy; because if the heart is attached to Allah alone without partner, it becomes pure and clear, and its concern becomes the Hereafter. It is saved from dispersion and trial that strike hearts attached to other than Allah, holding them back from obeying Allah, as He said about the hypocrites: {And if they had intended to go forth, they would have prepared for it [some] preparation. But Allah disliked their being sent, so He kept them back, and they were told, \"Remain [behind] with those who remain.\"} [At-Tawbah: 46]. And he, peace be upon him, said: \"Whoever makes the Hereafter his goal, Allah places his richness in his heart, gathers his affairs for him, and the world comes to him despite itself. And whoever makes the world his goal, Allah places his poverty before his eyes, scatters his affairs, and nothing of the world comes to him except what has been decreed for him\" (1).",
    "foot_note": "1. Narrated by Al-Tirmidhi (4/ 642) No. (2465), Al-Tabarani in Al-Mu'jam Al-Kabir (11/ 266) No. (11690), mentioned by Al-Albani in Al-Silsila Al-Sahicha (2/ 633) No. (949), and authenticated in Sahih Al-Jami' (2/ 1109) No. (6505). Narrated by Ibn Majah (2/ 1375) No. (4105) with wording variation from Zayd bin Thabit, authenticated by Al-Albani in Al-Silsila Al-Sahicha (2/ 634) No. (950), and Shu'aib Al-Arna'ut in Sunan Ibn Majah (5/ 227) No. (4105).",
    "book_id": "864",
    "new_page_number": 18
  },
  {
    "serial_number": "4929213",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Impact of the Heart's Action on Quran Recitation and Reflection",
    "edition": "None",
    "publisher": "None",
    "page_number": 16,
    "volume_number": 1,
    "text": "3. **Eagerness to perfect and complete worship**, and striving to reach the station of Ihsan (Excellence) in acts of worship, as he, peace be upon him, said about the station of Ihsan: \"That you worship Allah as if you see Him, for though you do not see Him, He sees you\" (1). This great rank is not achieved unless the heart surrenders to Allah Almighty, and the servant recalls Allah's greatness, His observation of him, His knowledge, and His awareness of him, and strives to reform his heart and purify it from the impurities of vanity, showing off, pride, envy, and other afflictions.",
    "foot_note": "1. Narrated by Al-Bukhari (1/ 19) No. (50), and Muslim (1/ 36) No. (8).",
    "book_id": "864",
    "new_page_number": 19
  },
  {
    "serial_number": "4929214",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Impact of the Heart's Action on Quran Recitation and Reflection",
    "edition": "None",
    "publisher": "None",
    "page_number": 17,
    "volume_number": 1,
    "text": "**Chapter Two: The Heart is Not Affected by the Quran, Nor Benefits from It, Nor Does Its Effect Appear on the Limbs Except by Achieving the Following Requirements:**\n\n**Requirement 1: Sincerity to Allah Almighty and extreme eagerness for the soundness of intention.**\nBecause recitation of the Quran is a great act of worship to Allah that is not accepted except with sincerity of intention to Allah Almighty, and striving against the self to get rid of bad intentions that are for other than Allah Almighty. Therefore, a warning came against defects in intention and the consequent great loss for the servant in this world and the Hereafter. Among that is what was reported from Abu Umamah al-Bahili, may Allah be pleased with him, who said: A man came to the Prophet, peace be upon him, and said: \"What do you think of a man who fights seeking reward and fame, what is for him?\" The Messenger of Allah, peace be upon him, said: \"Nothing is for him.\" He repeated it three times, and the Messenger of Allah, peace be upon him, said to him: \"Nothing is for him.\" Then he said: \"Indeed, Allah does not accept any deed except what is purely for Him and by which His Face is sought\" (1). One of the greatest things that frighten a believer is the grave danger occurring to one who falls into showing off and vanity in his deed, and loving to hear people's praise for him when reciting the Quran in this world. This leads to a terrifying situation from which hearts are torn out due to its horror. Reflect with me on this great hadith which conveys this scene from the Day of Resurrection, a scene that made the righteous weep greatly, even those who reached a great level of righteousness among the Companions of the Prophet, peace be upon him. Abu Huraira, may Allah be pleased with him, wept from it and fainted, and Muawiyah, may Allah be pleased with him, wept severely from it. So how about others?\nShufayy al-Asbahi entered Medina and found a man around whom people had gathered. He said: \"Who is this?\" They said: \"Abu Huraira.\" I approached him until I sat in front of him while he was speaking to the people. When he was silent and alone, I said to him: \"I ask you by truth and by truth to narrate to me a hadith you heard from the Messenger of Allah, peace be upon him, understood it and knew it.\" Abu Huraira said: \"I will do. I will surely narrate to you a hadith...",
    "foot_note": "1. Narrated by Al-Nasa'i (6/ 25) No. (3140), Ibn Hajar verified its chain in Al-Fath (6/ 28), Al-Albani classified it as Hasan in Al-Silsila Al-Sahicha (1/ 118) No. (52), and said in Sahih Sunan Al-Nasa'i (2/ 383 - 384) No. (3140): \"Hasan Sahih\".",
    "book_id": "864",
    "new_page_number": 20
  },
  {
    "serial_number": "4929215",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Impact of the Heart's Action on Quran Recitation and Reflection",
    "edition": "None",
    "publisher": "None",
    "page_number": 18,
    "volume_number": 1,
    "text": "...the Messenger of Allah, peace be upon him, narrated to me, which I understood and knew.\" Then Abu Huraira gasped a gasp, so we waited a little, then he recovered. He said: \"I will surely narrate to you a hadith the Messenger of Allah, peace be upon him, narrated to me in this house, while there was no one with us but me and him.\" Then Abu Huraira gasped a severe gasp, then recovered and wiped his face and said: \"I will do. I will surely narrate to you a hadith the Messenger of Allah, peace be upon him, narrated to me while I and he were in this house, and there was no one with us but me and him.\" Then Abu Huraira gasped a severe gasp, then leaned forward falling on his face. I supported him against me for a long time, then he recovered and said: The Messenger of Allah, peace be upon him, told me: \"Indeed, when it is the Day of Resurrection, Allah Blessed and Exalted descends to the servants to judge between them, and every nation is kneeling. The first whom He calls is a man who collected (memorized) the Quran, a man who was killed in the cause of Allah, and a man of much wealth. Allah says to the reciter: 'Did I not teach you what I revealed to My Messenger?' He says: 'Yes, O Lord.' He says: 'Then what did you do with what you were taught?' He says: 'I used to stand with it during the hours of the night and the hours of the day.' Allah says to him: 'You have lied,' and the angels say to him: 'You have lied.' And Allah says: 'Rather, you wanted it to be said: So-and-so is a reciter, and that has been said.' The owner of wealth is brought, and Allah says to him: 'Did I not expand upon you until I did not leave you needing anyone?' He says: 'Yes, O Lord.' He says: 'Then what did you do with what I gave you?' He says: 'I used to join ties of kinship and give charity.' Allah says to him: 'You have lied,' and the angels say to him: 'You have lied.' And Allah Almighty says: 'Rather, you wanted it to be said: So-and-so is generous, and that has been said.' The one killed in the cause of Allah is brought, and Allah says to him: 'For what were you killed?' He says: 'I was commanded to struggle in Your cause, so I fought until I was killed.' Allah Almighty says to him: 'You have lied,' and the angels say to him: 'You have lied.' And Allah says: 'Rather, you wanted it to be said: So-and-so is brave, and that has been said.'\" Then the Messenger of Allah, peace be upon him, struck my knee and said: \"O Abu Huraira, those three are the first of Allah's creation with whom the Fire will be kindled on the Day of Resurrection.\" Al-Walid Abu Uthman said: Uqba bin Muslim informed me \"that Shufayy is the one who entered upon Muawiyah and told him this.\" Abu Uthman said: Al-Ala' bin Abi Hakim told me that he was an executioner for Muawiyah, and a man entered upon him and told him this from Abu Huraira. Muawiyah said: \"This was done to these, so how about the rest of the people?\" Then Muawiyah wept severely until we thought he would die, and we said: 'This man has brought evil to us.' Then Muawiyah recovered and wiped his...",
    "foot_note": "None",
    "book_id": "864",
    "new_page_number": 21
  },
  {
    "serial_number": "4929216",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Impact of the Heart's Action on Quran Recitation and Reflection",
    "edition": "None",
    "publisher": "None",
    "page_number": 19,
    "volume_number": 1,
    "text": "...face and said: 'Allah and His Messenger spoke the truth: {Whoever desires the life of this world and its adornments - We fully repay them for their deeds therein, and they therein will not be deprived. Those are the ones for whom there is not in the Hereafter but the Fire. And lost is what they did therein, and worthless is what they used to do} [Hud: 15-16]'.\" (1).\nAnd from Abu Huraira, may Allah be pleased with him: I heard the Messenger of Allah, peace be upon him, say: \"Indeed, the first of people against whom judgment will be pronounced on the Day of Resurrection is a man who was martyred. He will be brought and Allah will make known to him His favors and he will recognize them. [The Almighty] will say: And what did you do about them? He will say: I fought for You until I died a martyr. He will say: You have lied - you did but fight that it might be said [of you]: He is courageous. And so it was said. Then he will be ordered to be dragged along on his face until he is cast into Hell-fire. [Another] will be a man who has studied [religious] knowledge and has taught it and who used to recite the Quran. He will be brought and Allah will make known to him His favors and he will recognize them. [The Almighty] will say: And what did you do about them? He will say: I studied [religious] knowledge and I taught it and I recited the Quran for Your sake. He will say: You have lied - you did but study [religious] knowledge that it might be said [of you]: He is learned. And you recited the Quran that it might be said [of you]: He is a reciter. And so it was said. Then he will be ordered to be dragged along on his face until he is cast into Hell-fire. [Another] will be a man whom Allah had made rich and to whom He had given all kinds of wealth. He will be brought and Allah will make known to him His favors and he will recognize them. [The Almighty] will say: And what did you do about them? He will say: I left no path [doing good] which You like money to be spent on without spending in it for Your sake. He will say: You have lied - you did but do so that it might be said [of you]: He is open-handed. And so it was said. Then he will be ordered to be dragged along on his face until he is cast into Hell-fire.\" (2).\nIf these frightening punishments resulting from defects in intention and purpose are firmly established in the heart, this generates fear of Allah Almighty in the heart and dread that these great frightening punishments might befall him. His heart will be in great fear of these afflictions that lead him to destruction in his worldly life and Hereafter. Thus, he strives against himself to be safe from defects in his intention and purpose when reciting the Great Quran and other righteous deeds,",
    "foot_note": "1. Narrated by Al-Tirmidhi (4/ 591) No. (2382), who said: \"This hadith is Hasan Gharib\", Ibn Hibban (2/ 136) No. (408), Al-Hakim in Al-Mustadrak (1/ 579) No. (1527) who authenticated it and Al-Dhahabi agreed, Ibn Khuzaimah (2/ 1188) No. (2482), Al-Albani authenticated it in Sahih Al-Targhib (1/ 114) No. (22), and Shu'aib Al-Arna'ut authenticated its chain in his checking of Sahih Ibn Hibban (2/ 137) No. (408). \n2. Narrated by Muslim (3/ 1513) No. (1905).",
    "book_id": "864",
    "new_page_number": 22
  },
  {
    "serial_number": "4929217",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Impact of the Heart's Action on Quran Recitation and Reflection",
    "edition": "None",
    "publisher": "None",
    "page_number": 20,
    "volume_number": 1,
    "text": "and he constantly checks his intention and severely holds himself accountable for sincerity to Allah, Lord of the Worlds. Here, I would like to summarize some wonderful and beneficial words by Ibn al-Qayyim, may Allah have mercy on him, for those who know their value, as he talks about the benefits of holding oneself accountable. He says:\n\"In holding oneself accountable, there are several benefits:\nAmong them: Becoming aware of its (the self's) faults. Whoever does not become aware of his own fault cannot remove it. If he becomes aware of its fault, he loathes it for the sake of Allah.\nMutarrif said in his supplication at Arafat: 'O Allah, do not reject the people because of me' (1).\nAyyub al-Sakhtiyani said: 'When the righteous are mentioned, I am far from them' (2).\nYunus bin Ubayd said: 'I find a hundred characteristics of goodness; I do not know if I have even one of them in myself' (3).\nMuhammad bin Wasi' said: 'If sins had a smell, no one would be able to sit with me' (4).\nThe self calls to destruction, helps enemies, aspires to every ugliness, and follows every evil; it runs by nature in the field of opposition. The blessing that has no equal is exiting from it and getting rid of its bondage, for it is the greatest veil between the servant and Allah. The people who know it best are the most disparaging of it and loathing of it. Loathing the self for the sake of Allah is one of the attributes of the Siddiqin (truthful ones), and through it, the servant draws closer to Allah Almighty in a single moment many times more than he draws closer through deeds.\nIbn Abi al-Dunya mentioned from Malik bin Dinar, who said: 'A group of the Children of Israel were in a mosque of theirs on a feast day. A young man came and stood at the door of the mosque and said: One like me does not enter with you; I am the owner of such and such (sins), I am the owner of such and such; disparaging himself. Allah revealed to their prophet that So-and-so is a Siddiq' (5).\"",
    "foot_note": "1. Muhasabat al-Nafs by Ibn Abi al-Dunya (p. 72). \n2. Muhasabat al-Nafs by Ibn Abi al-Dunya (p. 76). \n3. Muhasabat al-Nafs by Ibn Abi al-Dunya (p. 80). \n4. Muhasabat al-Nafs by Ibn Abi al-Dunya (p. 82). \n5. Muhasabat al-Nafs by Ibn Abi al-Dunya (p. 77).",
    "book_id": "864",
    "new_page_number": 23
  },
  {
    "serial_number": "4929218",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Impact of the Heart's Action on Quran Recitation and Reflection",
    "edition": "None",
    "publisher": "None",
    "page_number": 21,
    "volume_number": 1,
    "text": "Imam Ahmad said: Muhammad bin al-Hasan bin Atash told us, Mundhir told us, from Wahb: 'A wandering worshiper worshipped Allah Almighty for seventy years. One day he went out, belittled his deeds, complained to Allah about himself, and confessed his sin. A comer from Allah came to him and said: This session of yours is more beloved to Me than your deeds in the past of your life' (1).\nIn the book 'Al-Zuhd' by Imam Ahmad: 'A man from the Children of Israel worshipped for sixty years seeking a need, but he did not attain it. He said to himself: By Allah, if there were good in you, you would have attained your need. He was visited in his sleep and told: Did you see your disparaging of yourself at that hour? It is better than your worship for those years' (2).\nAmong the benefits of holding oneself accountable: He knows thereby Allah's right upon him. Whoever does not know Allah's right upon him, his worship hardly benefits him, and it is of very little benefit. One of the most beneficial things for the heart is looking into Allah's right upon the servant; for that bequeaths loathing of his self and disparaging it, saves him from vanity and seeing (admiring) his deeds, and opens for him the door of humility, submissiveness, and brokenness before his Lord, and despair of himself, and that salvation is only obtained by Allah's pardon, forgiveness, and mercy. For it is His right to be obeyed and not disobeyed, remembered and not forgotten, and thanked and not denied. Whoever looks into this right which his Lord has upon him knows with certainty that he is not fulfilling it as he should, and that nothing encompasses him except pardon and forgiveness, and that if he were referred to his deeds, he would perish. This is the perspective of those who know Allah and themselves, and this is what made them despair of themselves and hang all their hope on Allah's pardon and mercy. If you contemplate the state of most people, you find them contrary to that; they look at their right upon Allah, and do not...",
    "foot_note": "1. Al-Zuhd by Ahmad bin Hanbal (p. 47). \n2. Al-Zuhd by Ahmad bin Hanbal (p. 303). The wording in Al-Zuhd varies, and this is its text: From Ibn Munabbih, who said: \"Before you, a man worshipped for a time, then asked Allah Almighty for a need. He fasted for seventy weeks (Saturdays/weeks?), eating every Saturday eleven dates. He said: So he asked Allah for a need but He did not give it to him. He said: So he turned to himself and said: O self, it is from your side I was approached; if you had good, you would have been given your need, but you have no good. An angel descended to him at that hour and said: O son of Adam, this hour of yours in which you disparaged yourself is better than all your past worship, and Allah has granted you your need which you asked.\"",
    "book_id": "864",
    "new_page_number": 24
  },
  {
    "serial_number": "4929219",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Impact of the Heart's Action on Quran Recitation and Reflection",
    "edition": "None",
    "publisher": "None",
    "page_number": 22,
    "volume_number": 1,
    "text": "...look at Allah's right upon them. From here, they are cut off from Allah, and their hearts are veiled from knowing Him, loving Him, longing to meet Him, and finding delight in remembering Him. This is the utmost ignorance of a human about his Lord and himself. So holding oneself accountable is the servant's looking into Allah's right upon him first, then looking whether he fulfilled it as he should second. The best thinking is thinking about that; for it drives the heart to Allah and casts it before Him humble, submissive, broken with a break that contains its mending, poor with a poverty that contains its richness, and lowly with a lowliness that contains its honor. Even if he did whatever deeds he could do, if he missed this, what he missed of righteousness is better than what he brought. Among the benefits of a servant looking into Allah's right upon him: it does not let him boast of a deed at all, whatever it may be. Whoever boasts of his deed does not ascend to Allah. As Imam Ahmad mentioned from some of those knowledgeable about Allah, that a man said to him: 'I stand in my prayer and weep until herbs almost grow from my tears.' He said to him: 'Your laughing while acknowledging your sin to Allah is better than your weeping while boasting of your deed; for the prayer of the boaster does not ascend above him.' He said to him: 'Advise me.' He said: 'Stick to asceticism in the world, and do not dispute its people over it. Be like the bee; if it eats, it eats good; if it drops, it drops good; and if it lands on a stick, it does not harm it or break it. I advise you to advise for Allah Almighty as the dog advises its people; they starve it and drive it away, yet it refuses but to guard them and advise them' (1).\nImam Ahmad said: Sayyar told us, Ja'far told us, Al-Jariri told us, said: 'It reached me that a man from the Children of Israel had a need with Allah Almighty. He worshipped and strove, then asked Allah for his need, but saw no success. He spent the night disparaging himself, saying: O self! Why is your need not fulfilled? He spent the night sad, disparaging himself and blaming himself. He said: By Allah, I was not approached from my Lord's side, but from my own self I was approached. He spent the night disparaging himself and blaming himself, and his need was fulfilled'\" (2).\nEnd of what I summarized from the book *Ighathat al-Lahfan* (3).",
    "foot_note": "1. Al-Zuhd by Ahmad bin Hanbal (p. 81). \n2. The editor of Ighathat al-Lahfan said: I did not find it. \n3. Ighathat al-Lahfan fi Masayid al-Shaytan (1/ 143 - 154, Ata'at al-Ilm edition).",
    "book_id": "864",
    "new_page_number": 25
  },
  {
    "serial_number": "4929220",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Impact of the Heart's Action on Quran Recitation and Reflection",
    "edition": "None",
    "publisher": "None",
    "page_number": 23,
    "volume_number": 1,
    "text": "**Requirement 2: Eagerness to follow the Prophetic guidance in this act of worship.**\nIbn al-Qayyim, may Allah have mercy on him, in his great book *Zad al-Ma'ad*, traced his (the Prophet's) guidance, peace be upon him, in this act of worship. He collected the texts reported about his guidance in dealing with the Holy Quran. He, may Allah have mercy on him, gathered abundant knowledge as usual, so may Allah reward him with the best reward. He expanded on that leaving no room for more. I liked to summarize the following from him (1):\n*   \"He, peace be upon him, had a Hizb (portion) he read and would not skip.\n*   His reading was Tarteel (slow, measured recitation), not quick rambling (Hadh) nor hasty, but a clear reading, letter by letter.\n*   He used to cut his reading verse by verse.\n*   He used to prolong at letters of prolongation (Madd); so he would prolong (Ar-Rahman) and prolong (Ar-Rahim).\n*   He used to seek refuge in Allah from the accursed Satan at the beginning of reading, saying: 'I seek refuge in Allah from the accursed Satan,' and sometimes he would say: 'O Allah, I seek refuge in You from the accursed Satan, from his spurring (madness), his blowing (pride), and his spitting (poetry).' His seeking refuge was before reading.\n*   He loved to hear the Quran from others. He ordered Abdullah bin Mas'ud, so he read to him while he listened, and he, peace be upon him, was humbled by hearing the Quran from him until his eyes shed tears.\n*   He used to read the Quran standing, sitting, lying down, with ablution, and without ablution (minor impurity). Nothing prevented him from reading it except Janabah (major impurity).\n*   He used to recite it melodiously (Taghanni) and sometimes reverberate his voice with it, as he reverberated on the Day of Conquest in his reading of {Indeed, We have given you a clear conquest} [Al-Fath: 1]. Abdullah bin Mughaffal described his reverberation as 'Aaa Aaa Aaa' three times. Mentioned by Al-Bukhari. When you combine this hadith with his saying: 'Adorn the Quran with your voices,' and his saying: 'He is not of us who does not recite the Quran melodiously,' and his saying: 'Allah has not listened to anything as He listens to a Prophet with a beautiful voice reciting the Quran melodiously' = you know that this reverberation from him, peace be upon him, was by choice, not compelled by the camel shaking him. If this were due to the camel shaking, it would not fall under choice, and Abdullah bin Mughaffal would not narrate it and do it...",
    "foot_note": "1. Zad al-Ma'ad fi Hady Khayr al-Ibad - Ata'at al-Ilm edition (1/ 613 - 632) preserving his words literally.",
    "book_id": "864",
    "new_page_number": 26
  },
  {
    "serial_number": "4929221",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Impact of the Heart's Action on Quran Recitation and Reflection",
    "edition": "None",
    "publisher": "None",
    "page_number": 24,
    "volume_number": 1,
    "text": "...optionally to be imitated, seeing the mount shaking him until his voice breaks, then saying: 'He used to reverberate in his reading,' attributing the reverberation to his action. If it were from the shaking of the mount, there would be no action of his called reverberation. He once listened one night to the reading of Abu Musa al-Ash'ari. When he informed him of that, he said: 'If I had known you were listening, I would have refined it for you greatly (Habbartuhu Tahbira),' meaning: I would have beautified and adorned it with my voice greatly. Abu Dawood narrated in his 'Sunan' from Abd al-Jabbar bin al-Ward who said: I heard Ibn Abi Mulayka say: Ubaydullah bin Abi Yazid said: Abu Lubaba passed by us, so we followed him until he entered his house. We found a man of shabby appearance. I heard him say: I heard the Messenger of Allah, peace be upon him, say: 'He is not of us who does not recite the Quran melodiously.' He said: I said to Ibn Abi Mulayka: O Abu Muhammad, what if he does not have a beautiful voice? He said: He beautifies it as much as he can.\"\nHe (Ibn al-Qayyim) expanded on quoting the sayings of scholars on the issue of melodious recitation (Taghanni) and quavering (Tatrib) in reading the Quran. Then he said, may Allah have mercy on him, concluding this issue by preferring and detailing the correct view:\n\"The resolution of the dispute is to say: Quavering and melodious recitation are of two types:\nOne: What nature requires and allows, without affectation, training, or teaching. Rather, if left to his nature and his nature flows, it produces that quavering and melody. This is permissible, even if he aids his nature with the virtue of adornment and improvement, as Abu Musa said to the Prophet, peace be upon him: 'If I had known you were listening, I would have refined it for you greatly.' The sad person and the one stirred by joy, love, and longing cannot help but produce sadness and quavering in reading. Souls accept it, find it sweet and pleasant because it agrees with nature and lacks affectation and artificiality. It is natural, not artificial; spontaneous, not forced. This is what the Predecessors used to do and listen to. It is the praised and commendable melodious recitation, by which the reciter and listener are affected. All the evidences of the proponents of this view are carried on this type.\nTwo: What is done as an art of arts, not allowed by nature, but achieved only by affectation, artificiality, and training, just as singing voices are learned with various simple and compound melodies on specific rhythms and invented meters that are not achieved except by learning and affectation. This is what the Predecessors disliked, faulted, condemned, forbade reading with, and denounced those who read with it. The evidences of the proponents of that view (prohibition) address this type.",
    "foot_note": "None",
    "book_id": "864",
    "new_page_number": 27
  },
  {
    "serial_number": "4929222",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Impact of the Heart's Action on Quran Recitation and Reflection",
    "edition": "None",
    "publisher": "None",
    "page_number": 25,
    "volume_number": 1,
    "text": "With this detail, confusion is removed, and the truth becomes clear from other than it. Everyone with knowledge of the states of the Predecessors knows definitively that they are innocent of reading with artificial musical melodies that are on specific, counted, limited rhythms and movements. They are too God-fearing to read with them or permit them. It is known definitively that they used to read with sadness and quavering, beautifying their voices with the Quran, reading it sometimes with sorrow, sometimes with joy, and sometimes with longing. This is a matter demanded by natures, and the Lawgiver did not forbid it despite the strong demand of nature for it. Rather, he guided to it, encouraged it, informed of Allah's listening to whoever read with it, and said: 'He is not of us who does not recite the Quran melodiously.' This has two interpretations: One: It is informing about reality, meaning we all do it. The Second: It is a negation of the guidance of one who does not do it from his (the Prophet's) guidance and way. And Allah knows best.\"\nEnd of the intended quote from Ibn al-Qayyim, may Allah have mercy on him.\nAmong his guidance, peace be upon him: Not rushing to complete it (Khatm) in less than three days; for the sake—and Allah knows best—of eagerness to reflect upon it, understand the intent of it, and act upon it. He, peace be upon him, said: \"He who reads it in less than three days does not understand it\" (1).",
    "foot_note": "1. Narrated by Ahmad (11/ 104) No. (6546), wording is his, and the investigator of Al-Musnad said: \"Its chain is authentic according to the conditions of the two Sheikhs\", Musnad Al-Darimi (2/ 936) No. (1534) and its investigator said: \"Its chain is authentic\", Abu Dawood (2/ 54) No. (1390), Ibn Majah (1/ 428) No. (1347), and Al-Albani authenticated it in Sahih Al-Jami' (1/ 256) No. (1157).",
    "book_id": "864",
    "new_page_number": 28
  },
  {
    "serial_number": "4929223",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Impact of the Heart's Action on Quran Recitation and Reflection",
    "edition": "None",
    "publisher": "None",
    "page_number": 26,
    "volume_number": 1,
    "text": "**Requirement 3: Adhering to sincere repentance and frequent sincere seeking of forgiveness.**\nSins blind the heart so it does not see facts, becomes constricted by the Quran, flees from it, and becomes blind to its guidance, seeing not the light in it. Allah says: {For indeed, it is not eyes that are blinded, but blinded are the hearts which are within the breasts} [Al-Hajj: 46].\nAnd as in the hadith of Abu Huraira, may Allah be pleased with him, from the Messenger of Allah, peace be upon him, who said: \"When a servant commits a sin, a black dot is marked (1) in his heart. If he gives up, seeks forgiveness, and repents, his heart is polished (2). But if he returns, it is increased until it covers his heart. That is the Ran (stain) which Allah mentioned: {No! Rather, the stain has covered their hearts of that which they were earning} [Al-Mutaffifin: 14]\" (3).\nSimilarly, the trials of ambiguities (shubuhat) and desires (shahawat), if presented to the heart and it absorbs them, blind it from the truth and from the light of the Quran. It does not accept the guidance in it; rather, the heart overturns, accepting only desire and fleeing from truth and guidance. As in the hadith of Hudhayfah, may Allah be pleased with him, the Prophet, peace be upon him, says: \"Trials are presented to hearts as a reed mat [is woven] stick by stick. Any heart that absorbs them causes a black dot to be marked in it. And any heart that rejects them causes a white dot to be marked in it. Until they become two [types of] hearts: one white like a smooth stone, harmed by no trial as long as the heavens and earth endure; and the other black...",
    "foot_note": "1. Meaning a dot is placed in his heart. See: Al-Sihah (1/ 269), Al-Nihaya (5/ 114) entry (Nakat). \n2. In some narrations: \"Suqila\" with Sin. Saqal and Saqal mean the same: polished, cleaned, cleared, and the trace of sin removed. See: Al-Sihah (5/ 1744) entry (Saqal), Mirqat al-Mafatih (4/ 1622). \n3. Narrated by Ahmad (13/ 333) No. (7952), Al-Tirmidhi (5/ 434) No. (3334) who said: \"Hasan Sahih\", Ibn Majah in his Sunan (2/ 1418) No. (4244), Ibn Hibban in his Sahih (3/ 210) No. (930), Al-Hakim in his Mustadrak (2/ 562) No. (3908) who authenticated it and Al-Dhahabi agreed, Al-Albani classified it as Hasan in Sahih Al-Targhib (2/ 271) No. (1620), and Shu'aib Al-Arna'ut said in checking Al-Musnad (13/ 334) No. (7952): \"Its chain is strong\".",
    "book_id": "864",
    "new_page_number": 29
  },
  {
    "serial_number": "4929224",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Impact of the Heart's Action on Quran Recitation and Reflection",
    "edition": "None",
    "publisher": "None",
    "page_number": 27,
    "volume_number": 1,
    "text": "...dust-colored (1) like an overturned vessel, recognizing no good and denying no evil, except what it absorbed of its desire\" (2).\nThere is no doubt that sins and acts of disobedience have a great effect in corrupting the heart, and their harm is great upon it. \"Their harm to hearts is like the harm of poisons to bodies, varying in degrees of harm. Is there any evil or disease in this world and the Hereafter except that its cause is sins and acts of disobedience?!\" (3).\nThis dangerous disease on hearts, which corrupts them and distances them from the Book of their Lord, Allah has made a cure for it, which is seeking forgiveness and repentance. Allah says regarding the effect of seeking forgiveness: {And said, 'Ask forgiveness of your Lord. Indeed, He is ever a Perpetual Forgiver. (10) He will send [rain from] the sky upon you in showers (11) And give you increase in wealth and children and provide for you gardens and provide for you rivers} [Nuh: 10 - 12].\nAnd He Almighty said regarding the fruits of seeking forgiveness and repentance: {And that you ask forgiveness of your Lord and then repent to Him. He will let you enjoy a good provision for a specified term and give every doer of favor his favor. But if you turn away, then indeed, I fear for you the punishment of a great Day} [Hud: 3].\nAnd He said: {And O my people, ask forgiveness of your Lord and then repent to Him. He will send [rain from] the sky upon you in showers and increase you in strength [added] to your strength. And do not turn away, [being] criminals} [Hud: 52]. What appears from the sayings of interpreters regarding the increase of strength is that it is physical and moral strength, the effect of which they find in their lives (4).",
    "foot_note": "1. Murbaddan from Rubdah: A color inclining towards dustiness, a color mixed with blackness and unpleasant turbidity. See: Al-Sihah (2/ 472), Maqayis al-Lugha (2/ 475) entry (Rabad). \n2. Narrated by Muslim (1/ 128) No. (144). \n3. Al-Jawab al-Kafi (1/ 98). \n4. See: Tafsir Al-Tabari (12/ 445), Tafsir Al-Baghawi (4/ 183), Tafsir Ibn Kathir (4/ 329), Fath al-Qadir by Al-Shawkani (2/ 573), Tafsir Al-Sa'di (383).",
    "book_id": "864",
    "new_page_number": 30
  },
  {
    "serial_number": "4929225",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Impact of the Heart's Action on Quran Recitation and Reflection",
    "edition": "None",
    "publisher": "None",
    "page_number": 28,
    "volume_number": 1,
    "text": "There is no doubt that the Muslim is in dire need of this strength by which Allah helps him to turn to the Quran and recite it frequently. The command to repent came in His saying: {And turn to Allah in repentance, all of you, O believers, that you might succeed} [An-Nur: 31].\nThe Muslim looks at the state of the role model, peace be upon him, who had his past and future sins forgiven, yet exerted great effort in frequent seeking of forgiveness and repentance. This makes him race and compete in this field to attain its fruit in his life, opening up for him the turning to the recitation of the Mighty Book, reflecting upon it, and all his obedience.\nAbu Huraira, may Allah be pleased with him, says: I heard the Messenger of Allah, peace be upon him, say: \"By Allah, I seek forgiveness from Allah and repent to Him in a day more than seventy times\" (1).\nThe Prophet, peace be upon him, says: \"O people, repent to Allah and seek His forgiveness, for I repent to Allah and seek His forgiveness in every day a hundred times or more than a hundred times\" (2).\nFrom Allah's mercy to His servants is that He opened the door of repentance for them. From Abu Musa, from the Prophet, peace be upon him, who said: \"Indeed Allah Almighty stretches out His Hand at night so that the sinner of the day may repent, and stretches out His Hand during the day so that the sinner of the night may repent, until the sun rises from its west\" (3).\nNay, the matter is greater than that; Allah rejoices at the repentance of His servant with a great joy which the Prophet, peace be upon him, approximated with an example to show the greatness of the Lord's joy at His servant's repentance. He, peace be upon him, says: \"Allah is more joyful at the repentance of His believing servant than a man in a waterless, lethal land, having his riding beast with him carrying his food and drink. He slept and woke up and it was gone. He sought it until thirst overtook him, then said: I will return to...",
    "foot_note": "1. Narrated by Al-Bukhari (8/ 67) No. (6307). \n2. Narrated by Ahmad in Al-Musnad (30/ 226) No. (18294), and Al-Sunan Al-Kubra by Al-Nasa'i (9/ 168) No. (10205), authenticated by Al-Albani in Al-Silsila Al-Sahicha (3/ 435) No. (1452), and the investigator of Al-Musnad Shu'aib Al-Arna'ut said (30/ 226) No. (18294): \"Sahih Hadith\". \n3. Narrated by Muslim (4/ 2113) No. (2759).",
    "book_id": "864",
    "new_page_number": 31
  },
  {
    "serial_number": "4929226",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Impact of the Heart's Action on Quran Recitation and Reflection",
    "edition": "None",
    "publisher": "None",
    "page_number": 29,
    "volume_number": 1,
    "text": "...my place where I was and sleep until I die. He placed his head on his forearm to die, then woke up and his riding beast was with him carrying his provisions, food, and drink. Allah is more joyful at the repentance of the believing servant than this man with his riding beast and provisions\" (1).\nFor repentance and seeking forgiveness to produce their effect on the righteousness of the heart and the Muslim's turning to reciting the Book of his Lord, understanding it, and finding pleasure in it, certain matters must be observed (2), which are:\n1. **Sincerity to Allah Almighty in this repentance**, and that the intent behind it is the Face of Allah Almighty. Because Allah does not accept any deed unless it is purely for Allah and His Face is sought by it, and it is in accordance with the Sunnah. Repentance is rejected from its owner if he intends by it closeness to anyone or obtaining a worldly gain. The Prophet, peace be upon him, clarified that. From Abu Umamah al-Bahili, may Allah be pleased with him, who said: A man came to the Prophet, peace be upon him, and said: \"What do you think of a man who fights seeking reward and fame, what is for him?\" The Messenger of Allah, peace be upon him, said: \"Nothing is for him.\" He repeated it three times, and the Messenger of Allah, peace be upon him, said to him: \"Nothing is for him.\" Then he said: \"Indeed, Allah does not accept any deed except what was purely for Him and by which His Face was sought\" (3). And he, peace be upon him, said: \"Whoever does a deed that is not in accordance with our matter, it is rejected\" (4). In another narration in Sahih Muslim from Aisha, may Allah be pleased with her, she said: The Messenger of Allah, peace be upon him, said: \"Whoever introduces into this matter of ours what is not part of it, it is rejected\" (5).\n2. **Regret for the sin committed.** From Ibn Ma'qil, he said: I entered with my father upon Abdullah, and I heard him say: The Messenger of Allah, peace be upon him, said: \"Regret is repentance.\" My father said to him: \"You heard the Prophet, peace be upon him, say: 'Regret is repentance'?\" He said: \"Yes\" (6).",
    "foot_note": "1. Narrated by Muslim (4/ 2103) No. (2744). \n2. See regarding conditions of repentance: Riyadh al-Salihin (33 - 34), Al-Tawbah ila Allah (pp. 21 - 25). \n3. Narrated by (Al-Nasa'i) (6/ 25) No. (3140), Ibn Hajar verified its chain in Al-Fath (6/ 28), Al-Albani classified it as Hasan in Al-Silsila Al-Sahicha (1/ 118) No. (52), and said in Sahih Sunan Al-Nasa'i (2/ 383 - 384) No. (3140): \"Hasan Sahih\". \n4. Narrated by Muslim (3/ 1343) No. (1718). \n5. Narrated by Muslim (3/ 1343) No. (1718). \n6. Narrated by Ahmad (6/ 37) No. (3568), Ibn Majah (2/ 1420) No. (4252), Al-Hakim (4/ 271) No. (7612) who authenticated it and Al-Dhahabi agreed, Al-Albani authenticated it in Sahih Al-Jami' (2/ 1150) No. (6802), and the investigator of Al-Musnad authenticated it.",
    "book_id": "864",
    "new_page_number": 32
  },
  {
    "serial_number": "4929227",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Impact of the Heart's Action on Quran Recitation and Reflection",
    "edition": "None",
    "publisher": "None",
    "page_number": 30,
    "volume_number": 1,
    "text": "The opposite of regret is what happens of exposing the sins one has committed, as if it is something to boast about in gatherings. This public exposure is a great danger to its doer. He, peace be upon him, said: \"All of my Ummah will be excused except the Mujahirin (those who expose their sins). It is a form of exposure that a man commits a sin at night, then morning comes and Allah has covered him, yet he says: 'O So-and-so, I did such-and-such last night.' His Lord spent the night covering him, and he wakes up uncovering Allah's covering from himself\" (1).\n3. **Stopping the sin with determination not to return to it.** Allah mentioned in His Book among the attributes of His pious servants that they do not persist in sin. If they fall into it, they remember Allah and remember what He threatened sinners with and promised the pious, so they hasten to repentance and seeking forgiveness with regret and determination not to return to the sin, and they hasten to stop it and do not continue and persist in it while they know it is a sin. He said about them: {And those who, when they commit an immorality or wrong themselves [by transgression], remember Allah and seek forgiveness for their sins - and who can forgive sins except Allah? - and [who] do not persist in what they have done while they know} [Al-Imran: 135]. It was reported from Ibn Abbas, may Allah be pleased with them both, raised (to the Prophet): \"...and the one seeking forgiveness from a sin while he insists on it is like the one mocking his Lord\" (2).\n4. **If the sin involves the rights of humans, they must be returned to them or forgiveness sought.** Because rights of servants such as wealth and the like, the repentance of their taker is not accepted until he returns them or asks for forgiveness. On the Day of Resurrection, Allah will order the servant to return rights to their owners by giving his good deeds to the rights holders until they fulfill their right. Or if he has no good deeds, some of their bad deeds will be taken and thrown upon him, then he will be thrown into the Fire, as in the hadith of the bankrupt. He, peace be upon him, said: \"Do you know who is the bankrupt?\" They said: \"The bankrupt among us, O Messenger of Allah, is the one who has no dirham nor belongings.\" The Messenger of Allah, peace be upon him, said: \"The bankrupt of my Ummah is the one who comes on the Day of Resurrection with prayer, fasting, and zakat, but comes having insulted this one, slandered...",
    "foot_note": "1. Narrated by Al-Bukhari (8/ 20) No. (6069). \n2. Its raising to the Prophet, peace be upon him, is not authentic. The correct view is that it is suspended (Mawquf) on Ibn Abbas, may Allah be pleased with them both, as preferred by Ibn Hajar in Al-Fath (13/ 471), and others also preferred its suspension.",
    "book_id": "864",
    "new_page_number": 33
  },
  {
    "serial_number": "4929228",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Impact of the Heart's Action on Quran Recitation and Reflection",
    "edition": "None",
    "publisher": "None",
    "page_number": 31,
    "volume_number": 1,
    "text": "...this one, consumed the wealth of this one, shed the blood of this one, and beaten this one. So he sits, and this one takes from his good deeds, and this one from his good deeds. If his good deeds are exhausted before what he owes is paid, their sins are taken and cast upon him, then he is cast into the Fire\" (1).\n5. **Presence of the heart when repenting and seeking forgiveness.** So repentance and seeking forgiveness should be with the tongue and the heart, thus the effect of repentance occurs in the heart. This effect happens - and Allah knows best - with frequent seeking of forgiveness and repentance; because with repetition the heart becomes present and the effect occurs in it. That is why the texts came encouraging frequent repentance and seeking forgiveness, as previously mentioned in the hadiths about the action of the Prophet, peace be upon him, and his urging of his Ummah.\n6. **Searching for righteous companions who help him in doing good and continuing on repentance**, as in the hadith of the killer of a hundred, where the scholar urged him to go to the village of righteous people to find those who would help him in his repentance (2).",
    "foot_note": "1. Narrated by Muslim (4/ 1997) No. (2581), and this is the wording of Al-Tirmidhi (4/ 613). \n2. This is indicated by the hadith of Abu Sa'id al-Khudri, that the Prophet of Allah, peace be upon him, said: \"There was among those before you a man who killed ninety-nine souls. He asked about the most knowledgeable person on earth and was guided to a monk. He came to him and said: 'He killed ninety-nine souls, does he have any repentance?' He said: 'No.' So he killed him and completed a hundred with him. Then he asked about the most knowledgeable person on earth and was guided to a scholar. He said: 'He killed a hundred souls, does he have any repentance?' He said: 'Yes, and who stands between him and repentance? Go to such and such land, for in it are people who worship Allah, so worship Allah with them and do not return to your land, for it is a land of evil.' He set out until he was halfway there, death came to him. The angels of mercy and the angels of punishment disputed over him. The angels of mercy said: 'He came repenting, turning with his heart to Allah.' The angels of punishment said: 'He never did any good.' An angel in the form of a human came to them, and they made him an arbitrator between them. He said: 'Measure the distance between the two lands; whichever one he is closer to, he belongs to it.' They measured and found him closer to the land he intended, so the angels of mercy took him.\" Narrated by Muslim (4/ 2118) No. (2766).",
    "book_id": "864",
    "new_page_number": 34
  },
  {
    "serial_number": "4929229",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Impact of the Heart's Action on Quran Recitation and Reflection",
    "edition": "None",
    "publisher": "None",
    "page_number": 32,
    "volume_number": 1,
    "text": "**Requirement 4: Frequent supplication and persistence in asking Allah to grant the servant the sweetness of Quran recitation, finding pleasure in it, the heart's focus on it, and good reflection upon it.**\nWhat indicates the great status of supplication is the saying of the Prophet, peace be upon him: \"Supplication is worship\" (1). Al-Mulla Ali al-Qari, may Allah have mercy on him, explained this hadith saying that supplication: \"is the true worship that deserves to be called worship because it indicates turning to Allah and turning away from what is other than Him, such that one does not hope or fear anyone but Him, upholding the obligation of servitude, acknowledging the right of Lordship, knowing the blessing of existence, seeking the aid of provision according to desire and the success of happiness\" (2).\nAllah says: {And your Lord says, \"Call upon Me; I will respond to you.\" Indeed, those who disdain My worship will enter Hell [rendered] contemptible} [Ghafir: 60].\nAnd He says: {And when My servants ask you concerning Me - indeed I am near. I respond to the invocation of the supplicant when he calls upon Me. So let them respond to Me [by obedience] and believe in Me that they may be [rightly] guided} [Al-Baqarah: 186].\nFrom Abu Huraira, from the Prophet, peace be upon him, who said: \"There is nothing more honorable to Allah Almighty than supplication\" (3).\nThis is a great supplication that the heart should turn to. It is linked to finding pleasure in the Quran and asking Allah to remove worry and sadness from the servant, and that happens through the effect of the Quran on his heart. The Messenger of Allah, peace be upon him, said: \"No one is ever afflicted by worry or sadness and says: 'O Allah, I am Your slave, son of...",
    "foot_note": "1. Narrated by Ahmad in his Musnad (30/ 340) No. (18391), Abu Dawood (2/ 76) No. (1479), Al-Tirmidhi (5/ 375) No. (3247) who said: \"This hadith is Hasan Sahih\", Ibn Majah (2/ 1258) No. (3828), Al-Hakim (1/ 667) No. (1802) who authenticated it and Al-Dhahabi agreed, Al-Albani authenticated it in Sahih Al-Jami' (1/ 641) No. (3407), and the investigator of Al-Musnad said (30/ 340) No. (18391): \"Its chain is authentic\". \n2. Mirqat al-Mafatih Sharh Mishkat al-Masabih (4/ 1527). \n3. Narrated by Ahmad in Al-Musnad (14/ 360) No. (8748), Al-Tirmidhi (5/ 455) No. (3370) who said: \"This hadith is Gharib, we do not know it raised except from the hadith of Imran al-Qattan...\", Ibn Majah (2/ 1258) No. (3829), Al-Albani classified its chain as Hasan in Sahih Al-Jami' (2/ 951) No. (5392), as well as Shu'aib Al-Arna'ut in his checking of Sunan Ibn Majah (5/ 6) No. (3829).",
    "book_id": "864",
    "new_page_number": 35
  },
  {
    "serial_number": "4929230",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Impact of the Heart's Action on Quran Recitation and Reflection",
    "edition": "None",
    "publisher": "None",
    "page_number": 33,
    "volume_number": 1,
    "text": "...Your slave, son of Your bondswoman, my forelock is in Your Hand, Your command over me is forever executed and Your decree over me is just. I ask You by every name belonging to You which You named Yourself with, or revealed in Your Book, or You taught to any of Your creation, or You have preserved in the knowledge of the unseen with You, that You make the Quran the spring of my heart and the light of my chest, and a departure for my sorrow and a release for my anxiety,' but Allah will remove his worry and grief, and replace them with joy.\" It was said: \"O Messenger of Allah, should we not learn it?\" He said: \"Yes, whoever hears it should learn it\" (1).\nThe effect of supplication on the righteousness of the heart is great, and what follows from that of great meanings, including:\n1. Feeling Allah's company with him and His nearness to him.\n2. Strength of heart, steadfastness, and courage.\n3. Righteousness of the heart and its firmness on the truth.\nIf the servant is sincere in asking and persisting with his Lord to grant him reflection upon the Quran and understanding it as He loves and is pleased with, and to grant him pleasure in it, the fruit of that is the servant's feeling of tenderness in his heart, the effect of which appears on his limbs as humility and weeping out of fear of Allah, when reciting or hearing the Quran.",
    "foot_note": "1. Narrated by Ahmad (6/ 246 - 247) No. (3712), Al-Bazzar (5/ 363) No. (1994), Abu Ya'la (9/ 198) No. (5297), Ibn Hibban (3/ 253) No. (972). It was said in Majma' al-Zawa'id wa Manba' al-Fawa'id (10/ 136) No. (17129): \"The men of Ahmad and Abu Ya'la are the men of the Sahih except Abu Salamah al-Juhani, and Ibn Hibban declared him trustworthy.\" Al-Albani authenticated it in Sahih Al-Targhib wa Al-Tarhib (2/ 361) No. (1822), and Ahmad Shakir authenticated its chain in his checking of Al-Musnad No. (4318) (4/ 215).",
    "book_id": "864",
    "new_page_number": 36
  },
  {
    "serial_number": "4929231",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Impact of the Heart's Action on Quran Recitation and Reflection",
    "edition": "None",
    "publisher": "None",
    "page_number": 34,
    "volume_number": 1,
    "text": "**Requirement 5: The servant's feeling in his heart of the greatness of the Quran's impact (1).**\nAllah described the Quran as Great in more than one verse. Among them: He said: {And We have certainly given you seven of the often repeated [verses] and the great Quran} [Al-Hijr: 87]. And He said: {Say, \"It is great news (67) From which you turn away} [Sad: 67 - 68].\nThe greatness of the Quran is manifested in the following matters:\n1. **The greatness of the One who revealed it**, Glorified and Exalted be He. The greatness of Allah is realized through His speech about Himself, Blessed and Exalted be He: {They have not appraised Allah with true appraisal, while the earth entirely will be [within] His grip on the Day of Resurrection, and the heavens will be folded in His right hand. Exalted is He and high above what they associate with Him} [Az-Zumar: 67].\nAnd He said: {They have not appraised Allah with true appraisal. Indeed, Allah is Powerful and Exalted in Might} [Al-Hajj: 74].\nAnd He said: {The Day when We will fold the heaven like the folding of a [written] sheet for the records. As We began the first creation, We will repeat it. [That is] a promise binding upon Us. Indeed, We will do it} [Al-Anbiya: 104].\nAnd He said: {Indeed, your Lord is the Powerful, the Exalted in Might (66)} [Hud: 66].\nAnd He said: {And He is the subjugator over His servants. And He is the Wise, the Acquainted} [Al-An'am: 18].\nAnd He said: {Indeed, Allah holds the heavens and the earth, lest they cease. And if they should cease, no one could hold them [in place] after Him. Indeed, He is Forbearing and Forgiving} [Fatir: 41].",
    "foot_note": "1. See regarding this: *Azamat al-Quran al-Karim* by Dr. Mahmoud Al-Dosari, originally a master's thesis available online; *Kitab Azamat al-Quran wa Ta'zimuhu wa Atharuhu fi al-Nufus fi Daw' al-Kitab wa al-Sunnah* by Dr. Saeed bin Ali bin Wahf Al-Qahtani.",
    "book_id": "864",
    "new_page_number": 37
  },
  {
    "serial_number": "4929232",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Impact of the Heart's Action on Quran Recitation and Reflection",
    "edition": "None",
    "publisher": "None",
    "page_number": 35,
    "volume_number": 1,
    "text": "And He said: {[He is] the Exalted above [all] degrees, Owner of the Throne; He places the inspiration of His command upon whom He wills of His servants to warn of the Day of Meeting (15) The Day they come forth nothing concerning them will be concealed from Allah. To whom belongs [all] sovereignty this Day? To Allah, the One, the Prevailing} [Ghafir: 15 – 16].\nFrom Abdullah bin Mas'ud, may Allah be pleased with him, who said: A Jewish rabbi came to the Prophet, peace be upon him, and said: \"O Muhammad - or O Abu al-Qasim - indeed Allah Almighty holds the heavens on the Day of Resurrection on a finger, the earths on a finger, the mountains and trees on a finger, the water and soil on a finger, and all other creation on a finger. Then He shakes them and says: 'I am the King, I am the King.'\" The Messenger of Allah, peace be upon him, laughed in wonder at what the rabbi said, confirming him. Then he recited: {They have not appraised Allah with true appraisal, while the earth entirely will be [within] His grip on the Day of Resurrection, and the heavens will be folded in His right hand. Exalted is He and high above what they associate with Him} [Az-Zumar: 67] (1).\nThe Messenger of Allah, peace be upon him, said: \"Allah, Blessed and Exalted, grips the earth on the Day of Resurrection and folds the heaven with His right hand, then says: I am the King, where are the kings of the earth?\" (2).\nThe Messenger of Allah, peace be upon him, said: \"Allah Almighty folds the heavens on the Day of Resurrection, then takes them with His right hand, then says: I am the King, where are the tyrants? Where are the arrogant? Then He folds the earths with His left hand, then says: I am the King, where are the tyrants? Where are the arrogant?\" (3).\nFrom Ubaydullah bin Miqsam, that he looked at Abdullah bin Umar demonstrating how the Messenger of Allah, peace be upon him, narrated. He said: \"Allah Almighty takes His heavens and His earths with His hands and says: I am Allah - and he closes his fingers and opens them - I am the King.\" Until I looked at the pulpit moving from below it, so that I said: Is it going to fall with the Messenger of Allah, peace be upon him? (4).",
    "foot_note": "1. Narrated by Al-Bukhari (6/ 126) No. (4811), and Muslim (4/ 2147) No. (2786) with his wording. \n2. Narrated by Muslim (4/ 2148) No. (2787). \n3. Narrated by Muslim (4/ 2148) No. (2788). \n4. Narrated by Muslim (4/ 2148) No. (2788).",
    "book_id": "864",
    "new_page_number": 38
  },
  {
    "serial_number": "4929233",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Impact of the Heart's Action on Quran Recitation and Reflection",
    "edition": "None",
    "publisher": "None",
    "page_number": 36,
    "volume_number": 1,
    "text": "Among the proofs of Allah's greatness is the greatness of His creations. Of that, He says: {The creation of the heavens and earth is greater than the creation of mankind, but most of the people do not know} [Ghafir: 57]. And He says: {Then I swear by the setting of the stars (75) And indeed, it is an oath - if you could know - great} [Al-Waqi'a: 75 – 76].\nThe Prophet, peace be upon him, said: \"I have been permitted to speak about an angel from the angels of Allah, from the bearers of the Throne. The distance between his earlobe and his shoulder is a journey of seven hundred years\" (1).\nThe Messenger of Allah, peace be upon him, said: \"The seven heavens in comparison to the Kursi (Footstool) are nothing but like a ring thrown in a desert land, and the superiority of the Throne over the Kursi is like the superiority of the desert over the ring\" (2).\nFrom Ibn Abbas, may Allah be pleased with them both, who said: \"The seven heavens and the seven earths in the Hand of Allah are nothing but like a mustard seed in the hand of one of you\" (3).\nSheikh Ibn Uthaymeen, may Allah have mercy on him, said: \"So the seven heavens and the seven earths in His Palm, Exalted is He, are like a mustard seed in the palm of one of you, meaning: the seven heavens despite their vastness and the seven earths are like if a human placed a mustard seed in his hand - which is the seed of mustard that is the size of a sesame seed - and this is also an example for approximation, otherwise Allah Almighty is Greater and more Majestic, so all creations relative to Him, Exalted is He, are nothing\" (4).",
    "foot_note": "1. Narrated by Abu Dawood (4/ 232) No. (4727). Ibn Kathir said in his Tafsir (8/ 212): \"This is a good chain, its men are trustworthy.\" Al-Dhahabi said in Al-Uluw lil-'Ali al-Ghaffar (97) No. (234): \"Its chain is authentic.\" And in Fath al-Bari by Ibn Hajar (8/ 665): \"Its chain is upon the condition of the Sahih.\" Al-Albani mentioned it in Al-Silsila Al-Sahicha (1/ 282) No. (151). \n2. Narrated by Muhammad Ibn Abi Shaybah in Al-Arsh (432) No. (58), Ibn Hibban in his Sahih (2/ 76) No. (361), Ibn Batta in Al-Ibanah Al-Kubra (7/ 181) No. (136). In Fath al-Bari by Ibn Hajar (13/ 411): \"And in the long hadith of Abu Dharr which Ibn Hibban authenticated... and it has a witness from Mujahid narrated by Sa'id bin Mansur in Al-Tafsir with an authentic chain from him.\" Al-Albani authenticated it with the sum of its paths in Al-Silsila Al-Sahicha (1/ 226) No. (109). \n3. Tafsir Al-Tabari, Hajar edition (20/ 246). \n4. Tafsir Al-Uthaymeen for Surah Saba (171).",
    "book_id": "864",
    "new_page_number": 39
  },
  {
    "serial_number": "4929234",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Impact of the Heart's Action on Quran Recitation and Reflection",
    "edition": "None",
    "publisher": "None",
    "page_number": 37,
    "volume_number": 1,
    "text": "2. **The greatness of the one who descended with the Holy Quran, Gabriel, peace be upon him, Allah's trustee of His revelation.** Allah says about him: {And indeed, it is the revelation of the Lord of the worlds 192 The Trustworthy Spirit has brought it down 193 Upon your heart, [O Muhammad] - that you may be of the warners} [Ash-Shu'ara: 192 - 194].\nAnd He says: {[That] indeed, the Qur'an is a word [conveyed by] a noble messenger 19 [Who is] possessed of power and with the Owner of the Throne, secure [in position] 20 Obeyed there [in the heavens] and trustworthy} [At-Takwir: 19 - 21].\nAnd He says: {Say, \"The Pure Spirit has brought it down from your Lord in truth to make firm those who believe and as guidance and good tidings to the Muslims\"} [An-Nahl: 102].\nAnd He says in describing Gabriel, peace be upon him: {Taught to him by one intense in strength} [An-Najm: 5].\n\n3. **Among what indicates the greatness of the Quran is its intense impact on inanimate objects.** He says about it: {If We had sent down this Qur'an upon a mountain, you would have seen it humbled and coming apart from fear of Allah. And these examples We present to the people that perhaps they will give thought} [Al-Hashr: 21].\nAnd He says: {And if there was any qur'an by which the mountains would be removed or the earth would be broken apart or the dead would be made to speak, [it would be this Qur'an], but to Allah belongs the affair entirely} [Ar-Ra'd: 31].\nIbn Kathir, may Allah have mercy on him, said in his interpretation of this verse: \"Allah Almighty says, praising the Quran He revealed to Muhammad, peace be upon him, and preferring it over all books revealed before it: {And if there was any qur'an by which the mountains would be removed} meaning: If there was a book among the past books by which mountains were moved from their places, or the earth cut and split, or the dead spoken to in their graves, this Quran would be the one characterized by that to the exclusion of others, or by greater reason it would be so; because of the miraculous nature it contains that neither humans nor jinn to the last of them could produce its like if they gathered, nor a Surah like it\" (1).\n\n4. **Among what indicates the greatness of the Quran is Allah's swearing by it and on it in many verses**, such as:",
    "foot_note": "1. Tafsir Ibn Kathir (4/ 460).",
    "book_id": "864",
    "new_page_number": 40
  },
  {
    "serial_number": "4929235",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Impact of the Heart's Action on Quran Recitation and Reflection",
    "edition": "None",
    "publisher": "None",
    "page_number": 38,
    "volume_number": 1,
    "text": "He says: {Ya, Seen 1 By the wise Qur'an} [Ya-Sin: 1 - 2].\nAnd He says: {Sad. By the Qur'an containing reminder} [Sad: 1].\nAnd He says: {Qaf. By the honored Qur'an} [Qaf: 1].\nAnd He says: {Ha, Meem 1 By the clear Book 2 Indeed, We have made it an Arabic Qur'an that you might understand} [Az-Zukhruf: 1 - 3].\nAnd He says: {Then I swear by the setting of the stars 75 And indeed, it is an oath - if you could know - great 76 Indeed, it is a noble Qur'an 77 In a Register well-protected 78 None touch it except the purified 79 [It is] a revelation from the Lord of the worlds} [Al-Waqi'a: 75 - 80].\nAnd He says: {So I swear by what you see 38 And what you do not see 39 [That] indeed, the Qur'an is the word of a noble Messenger 40 And it is not the word of a poet; little do you believe 41 Nor the word of a soothsayer; little do you remember 42 [It is] a revelation from the Lord of the worlds} [Al-Haqqah: 38 - 43].\n\n5. **Among what indicates the greatness of the Great Quran are the great attributes Allah Almighty mentioned for it, including:**\n\n*   **First:** He says about it while clarifying the inability of humans and jinn to produce its like: {Say, \"If mankind and the jinn gathered in order to produce the like of this Qur'an, they could not produce the like of it, even if they were to each other assistants\"} [Al-Isra: 88].\nAnd He says: {Or do they say, \"He has made it up\"? Rather, they do not believe 33 Then let them produce a statement like it, if they should be truthful} [At-Tur: 33 - 34]. Then He descended with them in the challenge to ten Surahs, saying: {Or do they say, \"He invented it\"? Say, \"Then bring ten surahs like it that have been invented and call upon [for assistance] whomever you can besides Allah, if you should be truthful\"} [Hud: 13]. When they were unable, He descended with them to one Surah, saying: {Or do they say [about it], \"He invented it?\"...",
    "foot_note": "None",
    "book_id": "864",
    "new_page_number": 41
  },
  {
    "serial_number": "4929236",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Impact of the Heart's Action on Quran Recitation and Reflection",
    "edition": "None",
    "publisher": "None",
    "page_number": 39,
    "volume_number": 1,
    "text": "...Say, \"Then bring forth a surah like it and call upon [for assistance] whomever you can besides Allah, if you should be truthful\"} [Yunus: 38]. They were unable. \"Those who heard the Quran and knew it, special and common people, heard this challenge, and no one has stepped forward to produce a Surah like it from the time the Prophet, peace be upon him, was sent until this day, and until the Hour. The Quran contains thousands of miracles; because it has one hundred and fourteen Surahs, and the challenge occurred with one Surah. The shortest Surah in the Quran is Surah Al-Kawthar, which is three short verses. The Quran exceeds six thousand two hundred verses by agreement. An amount equal to Surah Al-Kawthar in verses or a long verse ordered in its words has the ruling of one Surah, and the challenge and miracle occur by it. Therefore, the Quran suffices over all sensory and moral miracles; for whoever has a heart or gives ear while he is heedful. Its miraculous nature is in many aspects: rhetorical and expressive miracle, informing about unseen things of various kinds, legislative miracle, and modern scientific miracle. Therefore, the Prophet, peace be upon him, said: 'There was no prophet among the prophets but was given miracles because of which people believed, but what I have been given is inspiration which Allah has revealed to me. So I hope that my followers will outnumber the followers of other prophets on the Day of Resurrection' (1)\" (2).\n\n*   **Second:** And He says clarifying that it is a book of guidance:\n    *   Guidance to what contains the servant's happiness in all affairs of this world and the Hereafter: {Indeed, this Qur'an guides to that which is most suitable and gives good tidings to the believers who do righteous deeds that they will have a great reward} [Al-Isra: 9].\n    *   The Quran is an explanation for everything: {And We have sent down to you the Book as clarification for all things and as guidance and mercy and good tidings for the Muslims} [An-Nahl: 89].\n    *   And He says clarifying that it is guidance for the pious: {This is the Book about which there is no doubt...",
    "foot_note": "1. Narrated by Al-Bukhari (6/ 182 Sultaniyya ed.) No. (4981), and Muslim (1/ 134 Abdul Baqi ed.) No. (152). \n2. Azamat al-Quran wa Ta'zimuhu wa Atharuhu fi al-Nufus fi Daw' al-Kitab wa al-Sunnah (p. 9).",
    "book_id": "864",
    "new_page_number": 42
  },
  {
    "serial_number": "4929237",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Impact of the Heart's Action on Quran Recitation and Reflection",
    "edition": "None",
    "publisher": "None",
    "page_number": 40,
    "volume_number": 1,
    "text": "...a guidance for those conscious of Allah} [Al-Baqarah: 2]. \"And that it is guidance for all interests of both abodes. It guides servants in fundamental and branch issues, clarifying truth from falsehood, authentic from weak, and showing them how to follow beneficial paths for them in their world and Hereafter\" (1).\n*   Allah described it as light that guides whoever holds fast to it and adheres to it to the happiness of this world and the Hereafter, and brings them out through it from the darkness of doubt, ambiguity, ignorance, and confusion to the light of guidance and to the straight path leading to the Garden of Bliss. He says: {There has come to you from Allah a light and a clear Book 15 By which Allah guides those who pursue His pleasure to the ways of peace and brings them out from darknesses into the light, by His permission, and guides them to a straight path} [Al-Ma'idah: 15 - 16].\nAnd He says: {Say, \"It has been revealed to me that a group of the jinn listened and said, 'Indeed, we have heard an amazing Qur'an 1 It guides to the right course, and we have believed in it. And we will never associate with our Lord anyone} [Al-Jinn: 1 - 2].\nAnd He says: {O mankind, there has come to you a conclusive proof from your Lord, and We have sent down to you a clear light 174 So those who believe in Allah and hold fast to Him - He will admit them to mercy from Himself and bounty and guide them to Himself on a straight path} [An-Nisa: 174 - 175].\n\n*   **Third:** Healing for what is in the breasts and guidance and mercy for believers. He says: {O mankind, there has to come to you instruction from your Lord and healing for what is in the breasts and guidance and mercy for the believers} [Yunus: 57].",
    "foot_note": "1. Tafsir Al-Sa'di = Taysir al-Karim al-Rahman (p. 40).",
    "book_id": "864",
    "new_page_number": 43
  },
  {
    "serial_number": "4929238",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Impact of the Heart's Action on Quran Recitation and Reflection",
    "edition": "None",
    "publisher": "None",
    "page_number": 41,
    "volume_number": 1,
    "text": "And He says: {And We send down of the Qur'an that which is healing and mercy for the believers, but it does not increase the wrongdoers except in loss} [Al-Isra: 82].\n\n*   **Fourth:** Whoever follows it will not go astray in this world nor suffer in the Hereafter. He says: {So whoever follows My guidance will neither go astray [in the world] nor suffer [in the Hereafter]} [Ta-Ha: 123]. From Ibn Abbas, may Allah be pleased with them both, who said: \"Allah guaranteed for whoever reads the Quran and follows what is in it that he will not go astray in this world nor suffer in the Hereafter,\" then he recited this verse: {So whoever follows My guidance will neither go astray nor suffer} (1).\nAnd He says: {Ta, Ha 1 We have not sent down to you the Qur'an that you be distressed 2 But only as a reminder for those who fear [Allah] 3 A revelation from He who created the earth and highest heavens} [Ta-Ha: 1 - 4].\nConversely, whoever turns away from it, Allah has threatened him with misery and hardship in this world and the Hereafter, and Allah will blind his sight literally in the Hereafter as a penalty for turning away from His verses. He says: {And whoever turns away from My remembrance - indeed, he will have a depressed life, and We will gather him on the Day of Resurrection blind 124 He will say, \"My Lord, why have you raised me blind while I was [once] seeing?\" 125 [Allah] will say, \"Thus did Our signs come to you, and you forgot them; and thus will you this Day be forgotten\" 126 And thus do We recompense he who transgressed and did not believe in the signs of his Lord. And the punishment of the Hereafter is more severe and more enduring} [Ta-Ha: 124 - 127].\n\n*   **Fifth:** Falsehood cannot approach it from before it or from behind it: {And indeed, it is a mighty Book 41 Falsehood cannot approach it from before it or from behind it; [it is] a revelation from a [Lord who is] Wise and Praiseworthy} [Fussilat: 41 - 42].",
    "foot_note": "1. Tafsir Al-Tabari = Jami' al-Bayan Hajar edition (16/ 191).",
    "book_id": "864",
    "new_page_number": 44
  },
  {
    "serial_number": "4929239",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Impact of the Heart's Action on Quran Recitation and Reflection",
    "edition": "None",
    "publisher": "None",
    "page_number": 42,
    "volume_number": 1,
    "text": "*   **Sixth:** Allah guaranteed its preservation: {Indeed, it is We who sent down the Qur'an and indeed, We will be its guardian} [Al-Hijr: 9].\n\n6. **Among what indicates the greatness of the Quran is the Prophet's recommendation, peace be upon him, to his nation to hold fast to it in more than one hadith to be saved from tribulations and misguidance.** Among that:\nHe, peace be upon him, says: \"I have left among you that which if you hold fast to, you will never go astray after it: the Book of Allah. And you will be asked about me, so what will you say?\" They said: \"We bear witness that you have conveyed, fulfilled, and advised.\" He pointed with his index finger raising it to the sky and pointing it at the people: \"O Allah, bear witness! O Allah, bear witness!\" three times (1).\nAnd from Abu Huraira, may Allah be pleased with him, who said: The Messenger of Allah, peace be upon him, said: \"I have left among you two things after which you will never go astray: the Book of Allah and my Sunnah. They will not separate until they return to me at the Basin\" (2).\nAnd he, peace be upon him, said in the Farewell Pilgrimage: \"Satan has despaired of being worshipped in your land, but he is pleased to be obeyed in other than that of what you belittle of your deeds. So beware, O people! I have left among you that which if you hold fast to, you will never go astray: the Book of Allah and the Sunnah of His Prophet, peace be upon him...\" (3).",
    "foot_note": "1. Narrated by Muslim in the Book of Hajj, Chapter: The Prophet's Hajj (2/ 890) No. (1218). \n2. Narrated by Al-Bazzar (15/ 385) No. (8993), Al-Hakim (1/ 172) No. (319), and authenticated by Al-Albani in Sahih Al-Jami' (1/ 566) No. (2937). \n3. Narrated by Al-Hakim in Al-Mustadrak (1/ 171) No. (318) who authenticated it and Al-Dhahabi agreed, and authenticated by Al-Albani in Sahih Al-Targhib wa Al-Tarhib (1/ 125) No. (42).",
    "book_id": "864",
    "new_page_number": 45
  },
  {
    "serial_number": "4929240",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Impact of the Heart's Action on Quran Recitation and Reflection",
    "edition": "None",
    "publisher": "None",
    "page_number": 43,
    "volume_number": 1,
    "text": "**Requirement 6: The servant's eagerness to reflect upon the Great Quran (1).**\n\n**First: Meaning of reflection (Tadabbur) and its types.**\nThe expressions of exegetes regarding the meaning of reflection revolve around employing thought and looking again and again, by contemplating and understanding the verses of the Holy Quran to reach its meanings and purposes and to be admonished by them (2).\n\n**Reflection is of two types:**\n*   **First: Reflection of Recitation:** This is when the reciter reflects on what he recites, bringing his heart present during recitation, working his mind to understand what he recites again and again until the meaning of the verse is established in his heart. Thus, faith increases, and the eye tears up from the heart's reverence and being affected by the speech of its Lord, Glory be to Him, as further details on this matter will follow.\n*   **Second: Reflection of Listening:** This is listening to the Great Quran with silence (attention), as Allah says: {So when the Qur'an is recited, then listen to it and pay attention that you may receive mercy} [Al-A'raf: 204]. Ibn Taymiyyah, may Allah have mercy on him, says: \"Whoever listens to the speech of Allah and the speech of His Messenger, peace be upon him, with his mind, and reflects upon it with his heart, will find in it understanding, sweetness, blessing, and benefit that he does not find in any other speech, neither poetry nor prose\" (3). Al-Sa'di, may Allah have mercy on him, said in his interpretation of {So when the Qur'an is recited, then listen to it and pay attention that you may receive mercy}: \"This command is general for everyone who hears the Book of Allah being recited; he is commanded to listen to it and pay attention. The difference between listening (Istima') and paying attention (Insat) is that paying attention is external...",
    "foot_note": "1. See regarding this: *Al-Khulasa fi Tadabbur al-Quran*, *Al-Qawa'id wa al-Usul wa Tatbiqat al-Tadabbur*, both by Dr. Khalid Al-Sabt (I benefited greatly from them in this topic), and *Mafhum al-Tafsir wa al-Ta'wil wa al-Istinbat wa al-Tadabbur wa al-Mufassir* by Dr. Musa'id Al-Tayyar. \n2. See: *Al-Khulasa fi Tadabbur al-Quran al-Karim* (p. 14), *Adwa' al-Bayan* (3/ 334). \n3. *Iqtida' al-Sirat al-Mustaqim* (2/ 270).",
    "book_id": "864",
    "new_page_number": 46
  },
  {
    "serial_number": "4929241",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Impact of the Heart's Action on Quran Recitation and Reflection",
    "edition": "None",
    "publisher": "None",
    "page_number": 44,
    "volume_number": 1,
    "text": "...by refraining from talking or engaging in what distracts from listening to it. As for listening to it, it is to lend one's ear, bring one's heart present, and reflect upon what one hears. For whoever persists in these two matters when the Book of Allah is recited will attain much good, abundant knowledge, continuous renewed faith, increasing guidance, and insight into his religion. That is why Allah arranged the attainment of mercy upon them. This indicates that whoever the Book is recited to and does not listen to it and pay attention is deprived of the share of mercy and has missed much good. Among the most emphasized commands for the listener of the Quran is to listen and pay attention in audible prayers when his Imam recites, for he is commanded to pay attention...\" (1).\nAl-Qurtubi, may Allah have mercy on him, said: \"It was narrated from Wahb bin Munabbih that he said: Part of the etiquette of listening is stillness of the limbs, lowering the gaze, listening attentively with the ear, presence of mind, and determination to act. That is listening as Allah Almighty loves, which is that the servant restrains his limbs and does not occupy them, so his heart is occupied with what he hears; he lowers his gaze so his heart is not distracted by what he sees; he confines his mind so he does not speak to himself about anything other than what he is listening to; and he resolves to understand so he acts upon what he understands. Sufyan bin Uyayna said: The first step of knowledge is listening, then understanding, then memorization, then action, then spreading (2). If a servant listens to the Book of Allah Almighty and the Sunnah of His Prophet, peace be upon him, with a sincere intention according to what Allah loves, He makes him understand as he loves and places light in his heart\" (3).",
    "foot_note": "1. Tafsir Al-Sa'di (p. 314). \n2. Transmitted from him by Al-Bayhaqi in Shu'ab al-Iman (3/ 284). \n3. Tafsir Al-Qurtubi (11/ 176).",
    "book_id": "864",
    "new_page_number": 47
  },
  {
    "serial_number": "4929242",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Impact of the Heart's Action on Quran Recitation and Reflection",
    "edition": "None",
    "publisher": "None",
    "page_number": 45,
    "volume_number": 1,
    "text": "**Second: Importance of reflection and evidences for it.**\nReflecting upon the Book of Allah has great importance and a significant impact on the life of the believer's heart. Among that (1):\n1. It gained its importance and honor due to its connection to understanding the Book of Allah, so it became one of the most honorable, majestic, and best matters.\n2. Because Allah commanded it and made it obligatory upon His believing servants. He says: {Then do they not reflect upon the Qur'an? If it had been from [any] other than Allah, they would have found within it much contradiction} [An-Nisa: 82]. And He says: {Then do they not reflect upon the Qur'an, or are there locks upon [their] hearts?} [Muhammad: 24]. Although this address was originally directed to non-Muslims, the necessity and obligation of reflection upon the Muslim is a priority. Therefore, scholars deduced the obligation of reflection upon the Muslim from His saying: {Then do they not reflect upon the Qur'an}. Al-Qurtubi, may Allah have mercy on him, said: \"This verse (2) and His saying: {Then do they not reflect upon the Qur'an, or are there locks upon [their] hearts?} indicate the obligation of reflecting upon the Quran to know its meaning\" (3). Al-Shanqiti, may Allah have mercy on him, said after citing verses on reflection, concluding his discussion on them: \"These mentioned verses indicate that reflecting upon the Quran, understanding it, learning it, and acting upon it is a matter indispensable for Muslims\" (4).\n3. Allah made reflection a purpose of its revelation. He, Glory be to Him, said: {[This is] a blessed Book which We have revealed to you, [O Muhammad], that they might reflect upon its verses and that those of understanding would be reminded} [Sad: 29].",
    "foot_note": "1. See regarding this: *Al-Khulasa fi Tadabbur al-Quran al-Karim* (p. 21), and a sermon on the obligation of reflecting upon the Quran by Dr. Mahmoud Al-Dosari on Alukah network. \n2. Referring to the verse in Surah An-Nisa: {Then do they not reflect upon the Qur'an? If it had been from [any] other than Allah, they would have found within it much contradiction}. \n3. Tafsir Al-Qurtubi (5/ 290). \n4. Adwa' al-Bayan (7/ 458).",
    "book_id": "864",
    "new_page_number": 48
  },
  {
    "serial_number": "4929243",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Impact of the Heart's Action on Quran Recitation and Reflection",
    "edition": "None",
    "publisher": "None",
    "page_number": 46,
    "volume_number": 1,
    "text": "Al-Shanqiti, may Allah have mercy on him, commenting on the previous verse, said: \"As for reflecting upon its verses being one of the wisdoms of its revelation, He pointed to it in some verses by urging reflection upon it and rebuking those who do not reflect upon it, such as His saying: {Then do they not reflect upon the Qur'an? If it had been from [any] other than Allah, they would have found within it much contradiction} [An-Nisa: 82], ... and His saying: {Then have they not reflected over the word (i.e. the Quran), or has there come to them that which had not come to their forefathers?} [Al-Mu'minun: 68]\" (1).\nHe (2), may Allah have mercy on him, also said in another place commenting on His saying {Then do they not reflect upon the Qur'an, or are there locks upon [their] hearts?} [Muhammad: 24]: \"The rebuke and denial contained in this noble verse against those who turn away from reflecting upon the Book of Allah came clarified in many verses, such as His saying: {Then do they not reflect upon the Qur'an? If it had been from [any] other than Allah, they would have found within it much contradiction} [An-Nisa: 82], ... and His saying: {Then have they not reflected over the word, or has there come to them that which had not come to their forefathers?} [Al-Mu'minun: 68], and His saying: {[This is] a blessed Book which We have revealed to you, [O Muhammad], that they might reflect upon its verses and that those of understanding would be reminded} [Sad: 29]. Allah, Exalted and Majestic, dispraised the one who turns away from this Great Quran in many verses, such as His saying: {And who is more unjust than one who is reminded of the verses of his Lord but turns away from them} [Al-Kahf: 57], and His saying: {And who is more unjust than one who is reminded of the verses of his Lord; then he turns away from them} [As-Sajdah: 22]. It is known that anyone who does not busy himself with reflecting upon the verses of the Great Quran—meaning examining them, understanding them, grasping their meanings, and acting upon them—is turning away from it, not reflecting upon it. He deserves the denial and rebuke mentioned in the verses, if Allah has given him understanding with which he is capable of reflection. Indeed...",
    "foot_note": "1. Adwa' al-Bayan (7/ 34). \n2. i.e., Imam Al-Shanqiti.",
    "book_id": "864",
    "new_page_number": 49
  },
  {
    "serial_number": "4929244",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Impact of the Heart's Action on Quran Recitation and Reflection",
    "edition": "None",
    "publisher": "None",
    "page_number": 47,
    "volume_number": 1,
    "text": "...the Prophet, peace be upon him, complained to his Lord about his people abandoning this Quran, as He says: {And the Messenger has said, \"O my Lord, indeed my people have taken this Qur'an as [a thing] abandoned\"} [Al-Furqan: 30]. These mentioned verses indicate that reflecting upon the Quran, understanding it, learning it, and acting upon it is a matter indispensable for Muslims. The Prophet, peace be upon him, clarified that those occupied with that are the best of people, as confirmed from him, peace be upon him, in the Sahih (1) from Uthman bin Affan, may Allah be pleased with him, that he said: 'The best of you is he who learns the Quran and teaches it.' And He says: {But [instead, he would say], \"Be pious scholars of the Lord because of what you have taught of the Scripture and because of what you have studied\"} [Al-Imran: 79]. So the turning away of many regions (people) from looking into the Book of Allah, understanding it, and acting upon it and upon the established Sunnah explaining it, is one of the greatest and most hideous evils, even if those doing it think they are guided...\" End of the intended quote from him, may Allah have mercy on him (2).\n4. It is the path to the servant's knowledge of his Creator, Majestic is His Majesty, a correct knowledge of His names, attributes, and actions, and it is the path to knowing His Straight Path which He commanded servants to follow. Al-Ajurri, may Allah have mercy on him, said: \"Whoever reflects upon His speech knows the Lord, Exalted and Majestic, knows the greatness of His authority and power, knows the greatness of His favor upon the believers, and knows what is obligatory upon him of worshipping Him. So he obliges himself with the duty, beware of what his Generous Master warned him against, and desires what He encouraged him towards. Whoever has this description when reciting the Quran and when listening to it from others, the Quran is a healing for him. He becomes rich without wealth, powerful without clan, and finds comfort in what others feel lonely with. His concern upon starting a Surah is: When will I be admonished by what I recite?! His intent is not: When will I finish...",
    "foot_note": "1. Narrated by Al-Bukhari (6/ 192) No. (5027). \n2. Adwa' al-Bayan (7/ 457 - 458).",
    "book_id": "864",
    "new_page_number": 50
  },
  {
    "serial_number": "4929245",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Impact of the Heart's Action on Quran Recitation and Reflection",
    "edition": "None",
    "publisher": "None",
    "page_number": 48,
    "volume_number": 1,
    "text": "...the Surah?! Rather, his intent is: When will I understand the address from Allah?! When will I be deterred?! When will I take a lesson?! Because reciting the Quran is worship, and worship is not done with heedlessness.\" (1) (2).\n5. Ibn al-Qayyim, may Allah have mercy on him, said: \"In sum, there is nothing more beneficial for the heart than reading the Quran with reflection and contemplation; for it gathers all the stations of the wayfarers, the states of the workers, and the stations of the knowers. It is what generates love, longing, fear, hope, turning (to Allah), reliance, satisfaction, delegation, gratitude, patience, and all other states by which the heart lives and is perfected. Likewise, it deters from all blameworthy attributes and actions which cause the corruption and destruction of the heart. If people knew what is in reading the Quran with reflection, they would busy themselves with it over everything else. If one reads it with thought until he passes by a verse his heart needs for healing, he repeats it even a hundred times, or for a night; for reading a verse with thought and understanding is better than reading a complete recitation (Khatmah) without reflection and understanding, more beneficial for the heart, and more conducive to attaining faith and tasting the sweetness of the Quran\" (3).",
    "foot_note": "1. Akhlaq Ahl al-Quran (pp. 36 - 37). \n2. Al-Khulasa fi Tadabbur al-Quran al-Karim (pp. 23 - 24). \n3. Miftah Dar al-Sa'ada (1/ 535).",
    "book_id": "864",
    "new_page_number": 51
  },
  {
    "serial_number": "4929246",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Impact of the Heart's Action on Quran Recitation and Reflection",
    "edition": "None",
    "publisher": "None",
    "page_number": 49,
    "volume_number": 1,
    "text": "**Third: The Sunnah's dispraise of people known for frequent recitation without reflecting on its meanings or understanding it according to the way of the Companions.**\nThe Prophet, peace be upon him, dispraised in many hadiths the people who read the Quran but it does not go beyond their throats, despite their frequent recitation of the Quran to the extent that the Companions, may Allah be pleased with them, would belittle their own reading compared to the reading of these people who strayed from the truth, followed desires, understood the speech of Allah and interpreted it according to their whims, abandoned the Companions' understanding of the Quran, and despised it because Satan made their bad deeds appear good to them.\nHe, peace be upon him, said about the Kharijites: From Abu Sa'id al-Khudri, may Allah be pleased with him, that he said: I heard the Messenger of Allah, peace be upon him, say: \"There will appear among you a people; you will belittle your prayer compared to their prayer, your fasting compared to their fasting, and your deeds compared to their deeds. They read the Quran but it does not go beyond their throats. They will pass through the religion as an arrow passes through a hunted game. One looks at the arrowhead and sees nothing, looks at the shaft and sees nothing, looks at the feathers and sees nothing, and doubts about the notch\" (1).\nAnd from Anas bin Malik, may Allah be pleased with him, from the Messenger of Allah, peace be upon him, that he said: \"There will be division and sectarianism in my Ummah. A people who speak well but act badly. They read the Quran but it does not go beyond their collarbones. They will pass through the religion as an arrow passes through a hunted game. They will not return until the arrow returns to its notch (which is impossible). They are the worst of creation and creatures. Blessed is he who kills them and whom they kill. They call to the Book of Allah but have nothing to do with it. Whoever fights them is closer to Allah than they are\" (2).\nIn the hadiths is a great and important indication related to the matter of the heart, which is his saying, peace be upon him: \"Their faith does not go beyond their throats,\" \"They read the Quran but it does not go beyond their throats,\" meaning: it did not reach their hearts. So the lesson is not in frequent recitation of the Quran and frequent prayer and fasting without understanding the Quran as the Companions and the predecessors of the Ummah understood it. Rather, the state of these Kharijites is superficial religiosity that did not reach the heart to benefit it. The lesson and requirement is action and understanding the Quran according to the way of the Predecessors, the understanding that makes the verses descend into the heart so one benefits from them. As Ibn Mas'ud, may Allah be pleased with him, said to that man who read the Mufassal (short surahs) in one rak'ah - clarifying the error...",
    "foot_note": "1. Narrated by Al-Bukhari (6/ 197) No. (5058). \n2. Narrated by Ahmad in Al-Musnad (21/ 51) No. (13338), Abu Dawood (4/ 243) No. (4765), and Al-Hakim (2/ 160) No. (2648) who authenticated it and Al-Dhahabi agreed, and Al-Albani authenticated it in Sahih Al-Jami' (1/ 684) No. (3668).",
    "book_id": "864",
    "new_page_number": 52
  },
  {
    "serial_number": "4929247",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Impact of the Heart's Action on Quran Recitation and Reflection",
    "edition": "None",
    "publisher": "None",
    "page_number": 50,
    "volume_number": 1,
    "text": "...he fell into -: \"Rambling like the rambling of poetry (1)! Indeed, there are people who read the Quran but it does not go beyond their collarbones. However, if it falls into the heart and becomes firmly established in it, it benefits\" (2).\n\n**Fourth: Means of reflection.**\nFor this reflection, there are several means, including:\n\n**1. Seeking refuge in Allah from the accursed Satan before recitation.**\nAllah says: {So when you recite the Qur'an, [first] seek refuge in Allah from Satan, the expelled [from His mercy]} [An-Nahl: 98].\nIbn al-Qayyim, may Allah have mercy on him, mentioned several benefits and fruits of seeking refuge in Allah from the accursed Satan before recitation. I have summarized the following from them:\n*   \"Among them, the Quran is a healing for what is in the breasts, removing what Satan casts into them of whispers, desires, and corrupt wills. It is a medicine for what Satan has affected in them. So He commanded to expel the substance of the disease and empty the heart of it, so the medicine encounters an empty place, takes hold of it, and affects it... Thus, this healing medicine comes to the heart empty of a rival and opponent, so it works effectively.\n*   Among them: The Quran is the substance of guidance, knowledge, and good in the heart, just as water is the substance of plants. Satan is a fire that burns plants as they grow. Whenever he senses the growth of good in the heart, he strives to spoil and burn it. So one is commanded to seek refuge in Allah from him, lest he spoil what he gains from the Quran. The difference between this aspect and the previous one: Seeking refuge in the first aspect is for obtaining the benefit of the Quran, and in the second aspect for its remaining, preservation, and stability.\n*   ... Among them: Allah Glory be to Him informed that He never sent a messenger or a prophet but when he desired (recited), Satan threw...",
    "foot_note": "1. Al-Hadh: Speed. The meaning here is: reading the Quran quickly as one speeds in reading poetry. See: Al-Nihaya fi Gharib al-Hadith wa al-Athar (5/ 255) entry (Hadhdha). \n2. Narrated by Muslim (1/ 563) and the narration will come with more detail.",
    "book_id": "864",
    "new_page_number": 53
  },
  {
    "serial_number": "4929248",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Impact of the Heart's Action on Quran Recitation and Reflection",
    "edition": "None",
    "publisher": "None",
    "page_number": 51,
    "volume_number": 1,
    "text": "...into his desire (recitation). All the Predecessors agree that the meaning is: when he recited, Satan threw into his recitation... If this was his action with the messengers, how about others? Therefore, he sometimes makes the reciter err, confuses the reading for him, and disturbs it, confusing his tongue, or disturbing his understanding and heart. If he is present during reading, the reciter will not miss one or the other from him, and he might combine both for him. Thus, one of the most important matters was: seeking refuge in Allah from him upon reading.\n*   Among them: Satan is most eager against man when he intends good or enters into it. He intensifies against him then to cut him off from it... Satan lies in wait for man on the path of every good... He is in waiting, especially upon reading the Quran. So He Glory be to Him commanded the servant to fight his enemy who cuts the road upon him, and to seek refuge in Allah from him first, then start the journey\" (1).\n\n**2. Feeling that the Quran is a speech addressed to him from Allah Almighty (2).**\nA man came to Abdullah bin Mas'ud, may Allah be pleased with him, and said: Advise me. He said: \"When you hear Allah Almighty saying in His Book: {O you who have believed}, then lend it your ear, for it is a good you are commanded with, or an evil you are turned away from\" (3).\nAl-Hasan Al-Basri, may Allah have mercy on him, said about the Quran: \"...Indeed, those before you saw it as letters to them from their Lord, so they would reflect upon them at night and implement them during the day\" (4).\nMuhammad bin Ka'b al-Qurazi, may Allah have mercy on him, said: \"Whoever the Quran reaches, it is as if he saw the Prophet, peace be upon him\" (5).",
    "foot_note": "1. Ighathat al-Lahfan fi Masayid al-Shaytan (1/ 158 - 161). \n2. See: Al-Khulasa fi Tadabbur al-Quran al-Karim (pp. 66 - 67). \n3. Narrated by Sa'id bin Mansur in his Sunan (1/ 211) No. (50). \n4. Tafsir Ibn Atiyyah (1/ 39). \n5. Tafsir Al-Tabari (9/ 182).",
    "book_id": "864",
    "new_page_number": 54
  },
  {
    "serial_number": "4929249",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Impact of the Heart's Action on Quran Recitation and Reflection",
    "edition": "None",
    "publisher": "None",
    "page_number": 52,
    "volume_number": 1,
    "text": "Salm al-Khawwas, may Allah have mercy on him, said: \"I said to myself: O self, read the Quran as if you heard it from Allah when He spoke it. Then the sweetness came\" (1).\nIbn al-Qayyim, may Allah have mercy on him, said: \"If you want to benefit from the Quran, gather your heart when reciting and listening to it, lend your ear, and be present like one who is addressed by the One who spoke it, Glory be to Him; for it is a speech from Him to you on the tongue of His Messenger\" (2).\nHe also said: \"In sum, whoever the Quran is recited to should consider himself as if he hears it from Allah addressing him with it. If along with that he achieves listening by Him, for Him, and in Him, the meanings, subtleties, and wonders of what is heard crowd upon his heart and rush to him [asking] which of them should start. Then [you find] whatever you wish of knowledge, wisdom, acquaintance, insight, guidance, and lesson\" (3).\nThe father of Muhammad Iqbal said to his son when he saw him reciting the Quran frequently: \"O my son, if you want to understand the Quran, read it as if it was revealed to you\" (4). It was said: After that, whenever he read the Quran, he would wet the pages of the Mushaf with his tears (5).\n\n**3. Repeating the verse or verses on a single topic.**\nThis repetition has a great effect on the presence of the heart, understanding what one recites, and reflecting well upon it. It is a Prophetic methodology. The Prophet, peace be upon him, repeated a verse in the night prayer until morning. Abu Dharr, may Allah be pleased with him, says: \"The Prophet, peace be upon him, stood with a verse repeating it until morning.\" The verse is: {If You should punish them - indeed they are Your servants; but if You forgive them - indeed it is You who is the Exalted in Might, the Wise} [Al-Ma'idah: 118] (6).",
    "foot_note": "1. Siyar A'lam al-Nubala (8/ 180). \n2. Al-Fawa'id (1/ 3). \n3. Madarij al-Salikin (2/ 166). \n4. See: Muhammad Iqbal: His Life, Philosophy and Poetry (24). \n5. I heard it long ago and do not recall who said it. \n6. Narrated by Ahmad (35/ 310) No. (21388), Al-Nasa'i (2/ 177) No. (1010), Ibn Majah (1/ 429) No. (1350), Al-Hakim (1/ 367) No. (879) who authenticated it and Al-Dhahabi agreed, the investigator of Al-Musnad classified its chain as Hasan, and Al-Albani also classified it as Hasan in his checking of Sunan Ibn Majah (1/ 429) No. (1350).",
    "book_id": "864",
    "new_page_number": 55
  },
  {
    "serial_number": "4929250",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Impact of the Heart's Action on Quran Recitation and Reflection",
    "edition": "None",
    "publisher": "None",
    "page_number": 53,
    "volume_number": 1,
    "text": "Ibn al-Qayyim, may Allah have mercy on him, said: \"If one reads it with thought until he passes by a verse his heart needs for healing, he repeats it even a hundred times, or for a night; for reading a verse with thought and understanding is better than reading a complete recitation (Khatmah) without reflection and understanding, more beneficial for the heart, and more conducive to attaining faith and tasting the sweetness of the Quran. This was the habit of the Predecessors; one of them would repeat the verse until morning... Reading the Quran with contemplation is the origin of the heart's righteousness. For this reason, Ibn Mas'ud said: 'Do not ramble the Quran like the rambling of poetry, and do not scatter it like the scattering of bad dates. Stop at its wonders and move the hearts with it. Let not the concern of one of you be the end of the Surah.' Ayyub narrated from Abu Jamra, who said: I said to Ibn Abbas: I am a fast reader, I read the Quran in three [days]. He said: 'That I read a Surah from the Quran in a night, reflect upon it and recite it slowly is more beloved to me than reading the Quran as you read'\" (1).\nFrom Abbad bin Hamza who said: \"I entered upon Asma' while she was reading: {So Allah conferred favor upon us and protected us from the punishment of the Scorching Fire} [At-Tur: 27]. He said: She stopped at it and began seeking refuge and supplicating. Abbad said: I went to the market, finished my need, then returned, and she was still at it seeking refuge and supplicating\" (2).\nFrom Masruq, that Tamim al-Dari repeated this verse until morning: {Or do those who commit evils think We will make them like those who have believed and done righteous deeds - [make them] equal in their life and their death? Evil is that which they judge} [Al-Jathiyah: 21] (3).\nFrom Hisham al-Dastuwa'i, who said: \"When Amr bin Utbah bin Farqad died, some of his companions entered upon his sister and said: Tell us about him. She said: He stood one night and started Surah Ha-Mim (Ghafir). When he reached...",
    "foot_note": "1. Miftah Dar al-Sa'ada (1/ 535 - 536). \n2. Musannaf Ibn Abi Shaybah (4/ 309 Al-Shathri ed.) No. (6176). \n3. Al-Zuhd by Waki' (p. 388).",
    "book_id": "864",
    "new_page_number": 56
  },
  {
    "serial_number": "4929251",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Impact of the Heart's Action on Quran Recitation and Reflection",
    "edition": "None",
    "publisher": "None",
    "page_number": 54,
    "volume_number": 1,
    "text": "...this verse: {And warn them of the Approaching Day, when hearts are at the throats, filled [with distress]} [Ghafir: 18], he did not go beyond it until morning\" (1).\nAl-Qasim bin Abi Ayyub said: I heard Sa'id bin Jubayr repeating this verse in prayer twenty-odd times: {And fear a Day when you will be returned to Allah. Then every soul will be compensated for what it earned, and they will not be treated unjustly} [Al-Baqarah: 281] (2).\nIbn Mas'ud, may Allah be pleased with him, repeated: {My Lord, increase me in knowledge} [Ta-Ha: 114] (3).\nHe also repeated: {What has deceived you concerning your Lord, the Generous?} [Al-Infitar: 6] (4).\nAl-Dahhak, when he recited His saying: {They will have canopies of fire above them and canopies below them} [Az-Zumar: 16], would repeat it until dawn (5).\n\n**4. Living with one's heart and feelings in the meaning of the verses, swimming with one's thought in their meanings, moving one's heart with them, and imagining their scenes as if seeing them with the eye.**\nThis happens with repeating the verse or verses on a single topic. There must be clarity and purity of intention and sincerity to Allah, along with supplication persisting with one's Lord to grant him reflection on the verses as He loves and is pleased with, which leads to the humility of his heart, being affected by the verses, increase of his faith, humility of his limbs, and his weeping out of fear of Allah...\n\n**5. Holding oneself accountable if one does not find an effect of the verses in one's heart.**\nSelf-accountability will not happen unless he feels in his heart the importance of reflecting on the Quran, and feels also that his heart only hardened because of his sins and heedlessness of his Lord. So he hastens to regret, seeking forgiveness...",
    "foot_note": "1. Hilyat al-Awliya (4/ 158). \n2. Fada'il al-Quran - Abu Ubayd (p. 148). \n3. Al-Tibyan fi Adab Hamalat al-Quran (p. 86). \n4. Al-Tibyan fi Adab Hamalat al-Quran (p. 86). \n5. Al-Tibyan fi Adab Hamalat al-Quran (p. 86).",
    "book_id": "864",
    "new_page_number": 57
  },
  {
    "serial_number": "4929252",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Impact of the Heart's Action on Quran Recitation and Reflection",
    "edition": "None",
    "publisher": "None",
    "page_number": 55,
    "volume_number": 1,
    "text": "...and sincere repentance from his heart. Then he blames himself: Why, O self, does the Quran not affect you, which if sent down on a mountain you would see it [humbled], as Allah says: {If We had sent down this Qur'an upon a mountain, you would have seen it humbled and coming apart from fear of Allah. And these examples We present to the people that perhaps they will give thought} [Al-Hashr: 21].\n\n**6. Returning to a concise interpretation (Tafsir) to understand some verses whose meaning is unclear to the reader.**\nThese are few because most Quranic verses are clear verses whose meaning an Arab understands. Nevertheless, if he needs to understand the meaning of a verse, he returns to a concise Tafsir so he can reflect upon it and benefit from it. It is recommended to have with him a Mushaf with a concise Tafsir in its margin, so if the understanding of a verse confuses him, he refers to it easily.\n\n**7. Reciting the verses slowly (Tartil) and beautifying the voice as much as possible without affectation.**\nA beautiful voice has an impact on increasing reflection on the verse or verses one wants to reflect upon. With his repetition of it, he tries to beautify his voice with it until humility and affection reach his heart. The effect of the verses descends to the heart and then to the limbs, so the body shivers and the eye tears up from the affection resulting from repeating the verse or verses with beautifying the voice. Reading with a tone of sadness has more impact than otherwise.\n\n**8. Being keen on seclusion with one's Lord in the darkness of the night when reflecting on the verses.**\nAs much as he can, he should be keen on being alone with his Lord when reflecting on the verses, because it is more conducive to cutting off distractions and distancing from vanity, showing off, and seeking reputation - the diseases that sicken the heart and cut it off from the blessing of reflection. They are more dangerous to the heart than poisons to the body. Reciting the Quran, reflecting upon it, reciting it slowly, and beautifying the voice with it are things through which Satan penetrates if he finds an entrance in the heart of loving those destructive matters which one might not feel the danger of due to the weakness of faith in the heart. So they throw him into the valleys of loss in this world and the Hereafter, deprivation, and lack of success. Therefore, whoever must come forward to appear, either to lead people...",
    "foot_note": "None",
    "book_id": "864",
    "new_page_number": 58
  },
  {
    "serial_number": "4929253",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Impact of the Heart's Action on Quran Recitation and Reflection",
    "edition": "None",
    "publisher": "None",
    "page_number": 56,
    "volume_number": 1,
    "text": "...and teach them or appear on websites and channels and the like for recitation, must be extremely vigilant against the infiltration of impurities of vanity, love of fame, and showing off into his heart. He must be constantly accountable to himself, extremely eager for the soundness of his intentions, striving against himself, looking at it with a clear lens, not flattering himself nor compromising with it. Along with that, he should be persistent in supplicating to his Lord to grant him sincerity for His Noble Face and to protect him from showing off, seeking reputation, and vanity in his work.\nThe time of night is clearer (purer) than the time of day. Ibn Hajar, may Allah have mercy on him, says commenting on Gabriel's study of the Quran with the Prophet, peace be upon him, every night of Ramadan: \"The purpose of recitation is presence and understanding, and the night is the likely time for that; because of the distractions and worldly and religious impediments during the day\" (1).\nAl-Nawawi, may Allah have mercy on him, said: \"A person should care more about reading the Quran at night, and more so in night prayer... The hadiths and narrations on this are many... Night prayer and reading were preferred only because they are more gathering for the heart, further from distractors and diversions and attending to needs, and safer from showing off and other invalidators, along with what the Sharia brought of finding goodness in the night (2)...\" (3).\nSeclusion with Allah in the darkness of the night, standing before Him, standing, bowing, prostrating to recite His Book and reflect upon His verses has a taste, sweetness, and pleasure that has no equal. One who tasted that says: \"The people of the night in their night are more delighted than the people of amusement in their amusement, and were it not for the night, I would not have loved to remain\" (4).\nFrom Al-Hasan who said: \"Seek sweetness in prayer, in the Quran, and in Dhikr. If you find it...",
    "foot_note": "1. Fath al-Bari (9/ 45). \n2. He, may Allah have mercy on him, mentioned examples for this such as Isra and Mi'raj, and Allah's descent in the last third of the night. \n3. Al-Tibyan fi Adab Hamalat al-Quran (82 - 84) Al-Minhaj edition. \n4. Narrated in Tarikh Dimashq by Ibn Asakir (34/ 146) from Abu Sulayman al-Darani.",
    "book_id": "864",
    "new_page_number": 59
  },
  {
    "serial_number": "4929254",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Impact of the Heart's Action on Quran Recitation and Reflection",
    "edition": "None",
    "publisher": "None",
    "page_number": 57,
    "volume_number": 1,
    "text": "...then proceed and rejoice. And if you do not find it, know that the door is closed\" (1).\n\n**9. Emptying oneself from what disturbs one's heart and thought - of distractions - when reciting or listening to it, and searching for what is more beneficial for one's heart.**\nSomething of this has been indicated previously, but here I draw attention to some matters:\n**First:** The reciter or listener should choose what is most beneficial for his heart, which he finds through what he tested with himself. Some are humbled when reciting secretly, and some are humbled when reciting aloud. Some find humility and reflection when reading the Quran in prayer, and this has been indicated. Some are the opposite, finding humility and reflection when reciting outside prayer. Some find it when listening to verses from a reciter reading in prayer because reading in prayer differs from others. You may find upon listening to some reciters humility and reflection that you do not find with others. Some recitations by some reciters may be linked to a beautiful time passed for the person, so if he hears them, they produce an effect in his heart. So he chooses what is best for his heart. The most beneficial is what occurs during night prayer. Al-Shanqiti, may Allah have mercy on him, says: \"The Quran is not established in the chest, nor is its memorization facilitated, nor its understanding made easy, except by standing with it in the dead of night\" (2).\nSimilarly, if reading is in prayer, it is better. Regarding that, Sheikh al-Islam, may Allah have mercy on him, says: \"Prayer is better than reading outside prayer... But whoever finds energy and understanding for reading outside prayer, then what is more beneficial for him is better in his right\" (3). \"Also, some people's hearts gather in reading the Quran, understanding it, and reflecting upon it in a way that does not happen in prayer; rather, it is the opposite in prayer. Not everything that is better [in general] is prescribed for everyone...",
    "foot_note": "1. Hilyat al-Awliya (10/ 146). \n2. Mentioned about him by Sheikh Atiyyah Salim, may Allah have mercy on him. See: Mafatih Tadabbur al-Quran (p. 50). Al-Khulasa fi Tadabbur al-Quran al-Karim (p. 51). \n3. Majmu' al-Fatawa (23/ 62).",
    "book_id": "864",
    "new_page_number": 60
  },
  {
    "serial_number": "4929255",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Impact of the Heart's Action on Quran Recitation and Reflection",
    "edition": "None",
    "publisher": "None",
    "page_number": 58,
    "volume_number": 1,
    "text": "...rather, it is prescribed for each one to do what is better for him\" (1) (2).\n\n**10. Reviewing the states of the Predecessors (Salaf) with the Great Quran.**\nIndeed, the one looking at the states of the Salaf - from the Companions and those after them - with the Quran sees what sharpens his determination and strengthens his resolve to turn to reciting the Mighty Book and reflecting upon its verses as He loves and is pleased with. They were as Allah described them in His Book. He says: {Indeed, those who were given knowledge before it - when it is recited to them, they fall upon their faces in prostration 107 And they say, \"Exalted is our Lord! Indeed, the promise of our Lord has been fulfilled\" 108 And they fall upon their faces weeping, and the Qur'an increases them in humble submission} [Al-Isra: 107 - 109].\nAnd He says: {The believers are only those who, when Allah is mentioned, their hearts become fearful, and when His verses are recited to them, it increases them in faith} [Al-Anfal: 2].\nAnd He says: {When the verses of the Most Merciful were recited to them, they fell in prostration and weeping} [Maryam: 58].\nAnd He says: {Allah has sent down the best statement: a consistent Book wherein is reiteration. The skins shiver therefrom of those who fear their Lord; then their skins and their hearts relax at the remembrance of Allah} [Az-Zumar: 23].\nAnd He says: {They arise from [their] beds; they supplicate their Lord in fear and aspiration, and from what We have provided them, they spend 16 And no soul knows what has been hidden for them of comfort for eyes as reward for what they used to do} [As-Sajdah: 16 - 17].\nAnd He says: {And those who, when reminded of the verses of their Lord, do not fall upon them deaf and blind} [Al-Furqan: 73].",
    "foot_note": "1. Majmu' al-Fatawa (23/ 60). \n2. See: Al-Khulasa fi Tadabbur al-Quran al-Karim (p. 51).",
    "book_id": "864",
    "new_page_number": 61
  },
  {
    "serial_number": "4929256",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Impact of the Heart's Action on Quran Recitation and Reflection",
    "edition": "None",
    "publisher": "None",
    "page_number": 59,
    "volume_number": 1,
    "text": "11 - **Chapter Three: Manifestations and Signs of the Impact of the Heart's Action on the Servant's Benefit from the Great Quran**, containing requirements:\n\n**Requirement 1: Increased humility of the limbs following the increase of the heart's humility, and being affected by the verses leading to weeping out of fear of Allah, glorifying Him, and revering Him, and to shivering of the skin out of fear of Him, and then the softening of the heart and skin to the remembrance of Allah.**\nAllah says: {And [it is] a Qur'an which We have separated [by intervals] that you might recite it to the people over a prolonged period. And We have sent it down progressively 106 Say, \"Believe in it or do not believe. Indeed, those who were given knowledge before it - when it is recited to them, they fall upon their faces in prostration 107 And they say, \"Exalted is our Lord! Indeed, the promise of our Lord has been fulfilled\" 108 And they fall upon their faces weeping, and the Qur'an increases them in humble submission} [Al-Isra: 106 - 109].\nAl-Tabari, may Allah have mercy on him, said in his interpretation of His saying: {And they fall upon their faces weeping, and the Qur'an increases them in humble submission}: \"Allah mentions: These who were given knowledge from the believers of the two Scriptures before the revelation of the Furqan (Quran), when the Quran is recited to them, fall on their chins weeping. And what is in the Quran of admonitions and lessons increases them in humility, meaning submission to Allah's command and obedience, and submissiveness to Him... From Abd al-A'la al-Taymi, that whoever is given knowledge that does not make him weep deserves not to have been given knowledge that benefits him, because Allah described the scholars saying: {Indeed, those who were given knowledge before it - when it is recited to them, they fall upon their faces in prostration... and it increases them in humble submission}\" (1).\nAl-Sa'di, may Allah have mercy on him, said in his interpretation of the verses: \"Meaning: We sent down this Quran separated, distinguishing...",
    "foot_note": "1. Tafsir Al-Tabari (15/ 122).",
    "book_id": "864",
    "new_page_number": 62
  },
  {
    "serial_number": "4929257",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Impact of the Heart's Action on Quran Recitation and Reflection",
    "edition": "None",
    "publisher": "None",
    "page_number": 60,
    "volume_number": 1,
    "text": "...between guidance and misguidance, truth and falsehood. {That you might recite it to the people over a prolonged period} meaning: slowly, so they can reflect on it, think about its meanings, and extract its sciences. {And We have sent it down progressively} meaning: bit by bit, separated over twenty-three years. {And they do not come to you with an argument except that We bring you the truth and the best explanation} So if it becomes clear that it is the Truth about which there is no doubt or suspicion in any way, then: {Say} to those who denied it and turned away from it: {Believe in it or do not believe}, for Allah has no need of you, and you do not harm Him at all. The harm of that is only upon you, for Allah has other servants, and they are those whom Allah gave beneficial knowledge: {When it is recited to them, they fall upon their faces in prostration} meaning: they are affected by it to the utmost extent and submit to it. {And they say, \"Exalted is our Lord!\"} from what does not befit His Majesty of what the polytheists attributed to Him. {Indeed, the promise of our Lord} of resurrection and recompense for deeds {has been fulfilled} without fail or doubt. {And they fall upon their faces} meaning: on their faces {weeping, and the Qur'an increases them in humble submission}. These are like those upon whom Allah bestowed favor from the believers of the People of the Book like Abdullah bin Salam and others, who believed during the time of the Prophet, peace be upon him, and after that\" (1).\nAl-Zuhayli said when interpreting His saying {and it increases them in humble submission}: \"Meaning the Quran increases them in humility to Allah Almighty. This is an exaggeration in their description, praise for them, and encouragement for everyone marked by knowledge and who obtained some of it to reach this rank, which is the rank of humility and submission to Allah Almighty. The reality is that worship to Allah Almighty should be with a humble heart and a submissive soul lowly before Allah Almighty, showing the meaning of pure servitude to the Lord of Glory. It manifests the recalling of Allah's greatness and awe which fills the soul with love for Allah and fear of Him, so the human becomes righteous in word and deed, with worship pleasing to his Lord Almighty\" (2).\nAnd He says: {When the verses of the Most Merciful were recited to them, they fell in prostration and weeping} [Maryam: 58].\nAl-Qurtubi, may Allah have mercy on him, says: \"In this verse is proof that the verses of the Most Merciful have an effect on...",
    "foot_note": "1. Tafsir Al-Sa'di (p. 468). \n2. Al-Tafsir Al-Wasit (2/ 1397).",
    "book_id": "864",
    "new_page_number": 63
  },
  {
    "serial_number": "4929258",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Impact of the Heart's Action on Quran Recitation and Reflection",
    "edition": "None",
    "publisher": "None",
    "page_number": 61,
    "volume_number": 1,
    "text": "...the hearts\" (1).\nTantawi, may Allah have mercy on him, says in his interpretation of this verse: \"...And His saying: {When the verses of the Most Merciful were recited to them, they fell in prostration and weeping} is a clarification of the tenderness of their feelings and the intensity of their affection upon hearing the verses of Allah Almighty. The noble sentence is a resumption driven to explain the greatness of their fear of Allah Almighty, or it is a predicate for the demonstrative noun {Those}. {Prostration and weeping} are plural of prostrating and weeping. Meaning: Those whom Allah bestowed favor upon, among their attributes is that when the verses of the Most Merciful are recited to them, containing His glorification, magnification, and arguments... they fall on their foreheads prostrating and weeping. They fall submissive and humble out of fear and hope, and glorifying and praising the Lord of the Worlds. He, Glory be to Him, combined prostration and weeping regarding them to indicate that despite their intense magnification of their Lord's station, they are possessors of tender hearts and emotions overflowing with fear of Allah Almighty. Verses with the meaning of this noble sentence have come frequently, such as His saying: {Say, \"Believe in it or do not believe. Indeed, those who were given knowledge before it - when it is recited to them, they fall upon their faces in prostration 107 And they say, \"Exalted is our Lord! Indeed, the promise of our Lord has been fulfilled\" 108 And they fall upon their faces weeping, and the Qur'an increases them in humble submission} [Al-Isra: 107 - 109]. And His saying, Glory be to Him: {And when they hear what has been revealed to the Messenger, you see their eyes overflowing with tears because of what they have recognized of the truth. They say, \"Our Lord, we have believed, so register us among the witnesses\"} [Al-Ma'idah: 83]. These noble verses indicate that among the attributes of truthful believers is that they are affected greatly when hearing the speech of Allah Almighty, an affection that makes them weep, prostrate, shiver...",
    "foot_note": "1. Tafsir Al-Qurtubi (11/ 120).",
    "book_id": "864",
    "new_page_number": 64
  },
  {
    "serial_number": "4929259",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Impact of the Heart's Action on Quran Recitation and Reflection",
    "edition": "None",
    "publisher": "None",
    "page_number": 62,
    "volume_number": 1,
    "text": "...their skins, fear in their hearts, and soften their souls\" (1).\nAnd He says: {Allah has sent down the best statement: a consistent Book wherein is reiteration. The skins shiver therefrom of those who fear their Lord; then their skins and their hearts relax at the remembrance of Allah} [Az-Zumar: 23].\n\"Shivering is a change in the human skin upon fear and dread\" (2).\nAllah described the state of those who fear their Lord with the Great Quran that when verses of punishment are mentioned, their skins shiver, and when verses of mercy are mentioned, their hearts soften and calm. Their true state is that their hearts shiver from their fear of Allah and dread of Him, and soften upon hope.\nFrom Abdullah bin Urwa bin al-Zubayr, he said: I said to my grandmother Asma' bint Abi Bakr: How did the Companions of the Messenger of Allah, peace be upon him, do when the Quran was recited to them? She said: \"They were as Allah Almighty described them: their eyes tear up and their skins shiver.\" I said to her: \"Some people today, when the Quran is recited to them, one of them falls unconscious.\" She said: \"I seek refuge in Allah from the accursed Satan.\" Qatada said: \"This is the description of Allah's allies; Allah described them that their skins shiver and their hearts find rest at the remembrance of Allah. He did not describe them with losing their minds and fainting. That is only in the people of innovation, and it is from Satan\" (3).",
    "foot_note": "1. Al-Tafsir Al-Wasit by Tantawi (9/ 50). \n2. Tafsir Al-Baghawi (7/ 115). \n3. See: Tafsir Al-Baghawi (7/ 116).",
    "book_id": "864",
    "new_page_number": 65
  },
  {
    "serial_number": "4929260",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Impact of the Heart's Action on Quran Recitation and Reflection",
    "edition": "None",
    "publisher": "None",
    "page_number": 63,
    "volume_number": 1,
    "text": "**Requirement 2: Increase of faith in the heart, the effect of which appears on the limbs through feeling the greatness of Allah and awe of Him in the hearts, and hastening and racing to Allah's pleasure and His Paradise, resulting in expansion of the chest and tranquility of the heart.**\n{The believers are only those who, when Allah is mentioned, their hearts become fearful, and when His verses are recited to them, it increases them in faith; and upon their Lord they rely} [Al-Anfal: 2].\nAl-Tabari, may Allah have mercy on him, says regarding the meaning of this verse: \"Allah Almighty says: The believer is not the one who disobeys Allah and His Messenger and leaves following what He revealed in His Book of His limits and obligations, and submitting to His judgment. Rather, the believer is the one who, when Allah is mentioned, his heart fears, he yields to His command, and submits to His remembrance out of fear of Him and dread of His punishment. And when the verses of His Book are recited to him, he believes in them and is certain they are from Allah. So he increases, by his belief in that, to his belief in what reached him before that, in faith. That is the increase in faith from reciting Allah's verses to them\" (1).\nAl-Qurtubi, may Allah have mercy on him, mentioned among the meanings of His saying: {and when His verses are recited to them, it increases them in faith}: \"And it is said: It is the increase of chest expansion by the multitude of verses and evidences\" (2).\nAl-Sa'di, may Allah have mercy on him, said regarding His saying: {and when His verses are recited to them, it increases them in faith}: \"The reason for that is they lend hearing to it and bring their hearts present to reflect upon it. At that point, their faith increases; because reflection is from the actions of the hearts, and because it must clarify for them a meaning they were ignorant of, or remind them of what they forgot, or create in their hearts a desire for good, longing for their Lord's honor, fear of punishments, and deterrence from sins. All this is what faith increases by\" (3).",
    "foot_note": "1. Tafsir Al-Tabari (11/ 27). \n2. Tafsir Al-Qurtubi (7/ 367). \n3. Tafsir Al-Sa'di (p. 315).",
    "book_id": "864",
    "new_page_number": 66
  },
  {
    "serial_number": "4929261",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Impact of the Heart's Action on Quran Recitation and Reflection",
    "edition": "None",
    "publisher": "None",
    "page_number": 64,
    "volume_number": 1,
    "text": "**Requirement 3: Reflection upon the Quran and the descent of its impact to the heart leading to increased adherence to what is in the Book and Sunnah and caution against desires and innovation.**\nThis is one of the greatest fruits of reflection and understanding of the Book of Allah and the Sunnah of His Messenger, peace be upon him, according to the understanding of the righteous Predecessors, may Allah be pleased with them and have mercy on them. The misguidance that happened to the sects that deviated from the method of the Predecessors and fell into innovations, perhaps one of its major reasons is this reason (lack of reflection/understanding like the Salaf). As in the narration of Abdullah bin Mas'ud, may Allah be pleased with him, from Abu Wa'il. He said: A man called Nahik bin Sinan came to Abdullah and said: \"O Abu Abd al-Rahman! How do you read this letter (word)? Do you find it with Alif: {min ma'in ghayri asin} or {min ma'in ghayri yasin}?\" He said: So Abdullah said: \"Have you counted all the Quran except this?\" He said: \"I read the Mufassal (short surahs) in one rak'ah.\" Abdullah said: \"Rambling like the rambling of poetry? Indeed, there are people who read the Quran but it does not go beyond their collarbones. However, if it falls into the heart and becomes firmly established in it, it benefits\" (1).",
    "foot_note": "1. Narrated by Muslim (1/ 563) No. (722).",
    "book_id": "864",
    "new_page_number": 67
  },
  {
    "serial_number": "4929262",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Impact of the Heart's Action on Quran Recitation and Reflection",
    "edition": "None",
    "publisher": "None",
    "page_number": 65,
    "volume_number": 1,
    "text": "**Requirement 4: Adopting the character of the Quran.**\nThis is a clear proof of benefiting from the Quran and its descent into the heart, which bears its blessed fruits on the believer's worship, foremost being the practical embodiment of the Quran in good character. Aisha, may Allah be pleased with her, was asked about the character of the Messenger of Allah, peace be upon him, and she said: \"His character was the Quran\" (1).\nGood morals have a great position in the Muslim's worship. Therefore, the Great Quran paid attention to raising the Muslim on good character. Because it is a blessed Book, whoever draws near to it obtains from this blessing according to his proximity to it. This blessing is linked to reflecting on its verses, understanding them, and acting upon them. Allah says: {[This is] a blessed Book which We have revealed to you, [O Muhammad], that they might reflect upon its verses and that those of understanding would be reminded} [Sad: 29].\nThe more the Muslim increases in closeness to the Book of his Lord, and its impact takes hold of his heart, the more that appears on him in his behavior, morals, and dealings. You can distinguish the companion of the Quran who is linked to it, from his appearance, good dealing, and the splendor of faith whose lights shine on his facial features. Indeed, the people of the Quran are as he, peace be upon him, said: \"Indeed, Allah has people (family) among mankind.\" It was said: \"Who are they, O Messenger of Allah?\" He said: \"The people of the Quran are the people of Allah and His elect\" (2).\nWhoever is this close to Allah, the effect of this closeness must appear on his appearance, morals, and all his states in the purity, cleanliness, and soundness of the heart, so his morals improve and his actions become noble. This is what the companion of the Quran should be upon. Abdullah bin Mas'ud, may Allah be pleased with him, said describing the carrier of the Quran: \"The carrier of the Quran should be known by his night when people are sleeping, by his day when people are breaking fast, by his sadness when people are rejoicing, by his weeping when people are laughing, by his silence when people are chattering, and by his humility when people are strutting. The carrier of the Quran should be weeping, sad, wise, forbearing, knowledgeable, silent. The carrier of the Quran should not be harsh, heedless, loud, shouting, nor sharp\" (3).",
    "foot_note": "1. Its origin is in Sahih Muslim at length (1/ 512) No. (746), and this is the wording of Imam Ahmad (42/ 183) No. (25302). \n2. Narrated by Ahmad (19/ 305) No. (12292), Ibn Majah (1/ 78) No. (215), Al-Bazzar (13/ 520) No. (7369), Al-Hakim (1/ 743) No. (2046). Al-Albani judged it Sahih in his checking of Sunan Ibn Majah, and also authenticated it in Sahih Al-Targhib (2/ 168) No. (1432), and the investigator of Al-Musnad classified its chain as Hasan. \n3. Hilyat al-Awliya (1/ 130).",
    "book_id": "864",
    "new_page_number": 68
  },
  {
    "serial_number": "4929263",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Impact of the Heart's Action on Quran Recitation and Reflection",
    "edition": "None",
    "publisher": "None",
    "page_number": 66,
    "volume_number": 1,
    "text": "Look, may Allah have mercy on me and you, at the high status of people of good character. From Abu Darda, from the Prophet, peace be upon him, who said: \"The heaviest thing in the scale on the Day of Resurrection is good character\" (1).\nAbdullah bin Amr, may Allah be pleased with them both, said: The Prophet, peace be upon him, said: \"Indeed, among the most beloved of you to me are the best of you in character\" (2).\nIn another narration from Abdullah bin Amr, may Allah be pleased with them both: The Prophet, peace be upon him, said: \"Indeed, the best of you are the best of you in character\" (3).\nFrom Aisha, may Allah be pleased with her, she said: I heard the Messenger of Allah, peace be upon him, say: \"Indeed, the believer reaches by his good character the rank of the one who fasts and stands (in prayer)\" (4).\nFrom Abu Huraira, he said: The Messenger of Allah, peace be upon him, was asked about what enters people into Paradise the most. He said: \"Fear of Allah and good character.\" And he was asked about what enters people into the Fire the most. He said: \"The mouth and the private parts\" (5).\nFrom Abdullah bin Amr, may Allah be pleased with them both, that he heard the Prophet, peace be upon him, say: \"Shall I not inform you of the most beloved of you to me and the closest of you to me in seating on the Day of Resurrection?\" The people were silent. He repeated it two or three times. The people said: \"Yes, O Messenger of Allah.\" He said: \"The best of you in character\" (6).\nAmong what indicates the status of good character and its great impact is that it is a cause for entering Paradise despite few voluntary deeds, or punishment in Fire for one whose character is bad despite many voluntary deeds, but they do not benefit him due to his bad character. From Abu Huraira...",
    "foot_note": "1. Narrated by Ahmad in Al-Musnad (45/ 537) No. (27555), Ibn Hibban (2/ 230) No. (481), authenticated by Al-Albani in Sahih Al-Jami' (1/ 89) No. (134), and the investigator of Al-Musnad said (45/ 537) No. (27555): \"Sahih Hadith\". \n2. Narrated by Al-Bukhari (5/ 28) No. (3759). \n3. Narrated by Al-Bukhari, and this is his wording (8/ 14) No. (6035), and Muslim (4/ 1810) No. (2321). \n4. Narrated by Ahmad in Al-Musnad (42/ 346) No. (25537), Abu Dawood (4/ 252) No. (4798), Ibn Hibban (2/ 228) No. (480), authenticated by Al-Albani in Sahih Al-Targhib (3/ 8) No. (2643), and Shu'aib Al-Arna'ut said in his checking of Al-Musnad (42/ 346) No. (25537): \"Sahih Hadith due to supporting evidence\". \n5. Narrated by Ahmad in Al-Musnad (15/ 47) No. (9096), Al-Tirmidhi (4/ 363) No. (2004) who said: \"Sahih Gharib\", Ibn Majah (2/ 1418) No. (4246), Ibn Hibban (2/ 224) No. (476), Al-Hakim (4/ 360) No. (7919) who authenticated it and Al-Dhahabi agreed, and Al-Albani classified it as Hasan in Sahih Al-Targhib (2/ 318) No. (1723). \n6. Narrated by Ahmad in Al-Musnad (11/ 347) No. (6735), Ibn Hibban (2/ 235) No. (485), and said in Majma' al-Zawa'id (8/ 21) No. (12666): \"Narrated by Ahmad with a good chain\", authenticated by Al-Albani in Sahih Al-Targhib (3/ 10) No. (2650).",
    "book_id": "864",
    "new_page_number": 69
  },
  {
    "serial_number": "4929264",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Impact of the Heart's Action on Quran Recitation and Reflection",
    "edition": "None",
    "publisher": "None",
    "page_number": 67,
    "volume_number": 1,
    "text": "...who said: A man said: O Messenger of Allah, indeed So-and-so is mentioned for her excessive prayer, fasting, and charity, except that she harms her neighbors with her tongue. He said: \"She is in the Fire.\" He said: O Messenger of Allah, indeed So-and-so is mentioned for her little fasting, charity, and prayer, and she gives in charity pieces of dried yogurt (aqit), but she does not harm her neighbors with her tongue. He said: \"She is in Paradise\" (1).",
    "foot_note": "1. Narrated by Ahmad in Al-Musnad (29/ 33) No. (9674), Ibn Hibban (13/ 76) No. (5764), Al-Hakim (4/ 183) No. (7304) who authenticated it and Al-Dhahabi agreed. The wording at Al-Hakim is: \"Indeed So-and-so prays at night and fasts during the day but there is something in her tongue that harms her neighbors, she is sharp-tongued.\" He said: \"There is no good in her; she is in the Fire.\" It was said to him: \"Indeed So-and-so prays the obligatory prayers, fasts Ramadan, and gives charity of pieces of dried yogurt and has nothing else, but she does not harm anyone.\" He said: \"She is in Paradise.\" It is said in Majma' al-Zawa'id (8/ 169): \"Narrated by Ahmad and Al-Bazzar, and its men are trustworthy.\" Al-Albani authenticated it in Sahih Al-Targhib (2/ 682) No. (2560).",
    "book_id": "864",
    "new_page_number": 70
  },
  {
    "serial_number": "4929265",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Impact of the Heart's Action on Quran Recitation and Reflection",
    "edition": "None",
    "publisher": "None",
    "page_number": 68,
    "volume_number": 1,
    "text": "**Chapter Four: Obstacles preventing the heart from being affected by the Great Quran**, containing a preface and requirements.\n\n**Preface:**\nAs we have seen in more than one place, the Messenger, peace be upon him, dispraised those who recite the Quran with their tongues without it descending to their hearts and warned his Ummah against their path. Likewise, his followers, peace be upon him, after him warned against these paths. At the head of these are the Kharijites and those who followed their way from the people of desires. What is striking is the report of their frequent recitation to the extent that the Companions belittled their own reading compared to theirs, and his informing, peace be upon him, of the ease of their memorizing the Quran like drinking milk and water. He, peace be upon him, says: \"There will emerge people from my Ummah who drink the Quran as they drink milk\" (1).\nAl-Fayd Al-Manawi said in his explanation of the hadith: \"Meaning they glide it on their tongues without reflecting on its meanings or contemplating its rulings; rather, it passes over their tongues as the drunk milk passes over them quickly\" (2).\nIn another narration: \"There will emerge groups from my Ummah who drink the Quran as they drink water\" (3).\nFrom Umar bin al-Khattab, may Allah be pleased with him, who said: \"A time and era came upon us when we did not think anyone learned the Quran desiring by it other than Allah Almighty. Then when I was here recently, I thought that men learn desiring people and what they possess. So desire Allah by your readings and your deeds. For we used to know you when the Messenger of Allah, peace be upon him, was among us, and when revelation descended upon us, and Allah informed us of your news. As for today, the...",
    "foot_note": "1. Narrated by Al-Tabarani in Al-Mu'jam Al-Kabir (17/ 297) No. (821). Al-Haythami said in Majma' al-Zawa'id wa Manba' al-Fawa'id (6/ 229) No. (10412): \"Narrated by Al-Tabarani, and its men are trustworthy,\" and Al-Albani classified it as Hasan in Sahih Al-Jami' (1/ 681) No. (3653). \n2. Fayd al-Qadir (4/ 118). \n3. Narrated by Al-Faryabi in Fada'il al-Quran (p. 204) No. (109), and Al-Albani classified its chain as Hasan in Al-Silsila Al-Sahicha (4/ 507) No. (1886).",
    "book_id": "864",
    "new_page_number": 71
  },
  {
    "serial_number": "4929266",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Impact of the Heart's Action on Quran Recitation and Reflection",
    "edition": "None",
    "publisher": "None",
    "page_number": 69,
    "volume_number": 1,
    "text": "...Messenger of Allah, peace be upon him, has passed, and revelation has ceased. I only know you by what I say: Whoever shows us good, we love him for it and think good of him; and whoever shows us evil, we hate him for it and think evil of him. Your secrets are between you and your Lord\" (1).\nFrom Abu Abd al-Rahman al-Sulami, may Allah have mercy on him, who said: \"We only took the Quran from a people who told us that when they learned ten verses, they would not move beyond them to the next ten until they knew what was in them of action. He said: So we learned knowledge and action together. Indeed, a people will inherit the Quran after us who drink it like drinking water, it does not go beyond this—and he pointed with his hand to his jaw\" (2).\nFrom Al-Hasan, may Allah have mercy on him, who said: \"This Quran has been read by slaves and children who have no knowledge of its interpretation and did not approach the matter from its beginning. Allah Almighty said: {[This is] a blessed Book which We have revealed to you, [O Muhammad], that they might reflect upon its verses and that those of understanding would be reminded} [Sad: 29]. Reflecting on its verses is nothing but following it with his knowledge, and Allah knows him. By Allah, it is not by preserving its letters and wasting its limits, such that one of them says: 'I have read the whole Quran and not dropped a letter from it,' while by Allah he has dropped all of it; the Quran does not appear in him in character or deed. Until one of them says: 'By Allah, I surely read the Surah.' By Allah, these are not the [true] reciters, nor the scholars, nor the wise, nor the pious. When did the reciters say such things? May Allah not increase the likes of these among people\" (3).\nThrough this, matters become clear to us that prevent the impact of the Quran on its owner. Here are some of them in the following requirements:",
    "foot_note": "1. Narrated by Al-Faryabi in Fada'il al-Quran (243) No. (173). \n2. Narrated by Al-Faryabi in Fada'il al-Quran (241) No. (169). \n3. Narrated by Al-Faryabi in Fada'il al-Quran (247) No. (177).",
    "book_id": "864",
    "new_page_number": 72
  },
  {
    "serial_number": "4929267",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Impact of the Heart's Action on Quran Recitation and Reflection",
    "edition": "None",
    "publisher": "None",
    "page_number": 70,
    "volume_number": 1,
    "text": "**Requirement 1: Defect in intention and purpose.**\nThis obstacle is one of the greatest obstacles to benefiting from the Quran and being affected by it. Therefore, it is imperative for whoever wants closeness to the Quran and benefit from it to be extremely keen on the soundness of his intention and purpose, and to strive against himself for that. He should always ask Allah to grant him sincerity and help him with it, and to protect him from seeking reputation, showing off, and vanity. He should constantly remind himself of the danger of defects in his intention and purpose in his dealing with the Book of Allah and hold it accountable for that. He should increase in seeking forgiveness and repentance always, and increase in the supplication mentioned in the text for removing the effect of these diseases on the heart.\nFrom Ma'qil bin Yasar who said: I set out with Abu Bakr Al-Siddiq, may Allah be pleased with him, to the Prophet, peace be upon him. He said: \"O Abu Bakr, Shirk (polytheism) among you is more hidden than the creeping of an ant.\" Abu Bakr said: \"Is Shirk anything other than making another god with Allah?!\" The Prophet, peace be upon him, said: \"By the One in Whose Hand is my soul, Shirk is more hidden than the creeping of an ant. Shall I not guide you to something which if you say it, its little and much will go away from you?\" He said: \"Say: O Allah, I seek refuge in You lest I associate anything with You while I know, and I seek Your forgiveness for what I do not know\" (1).\nDefect in intentions has a grave danger for its owner. Severe warning against this matter came in many evidences, some of which have been mentioned. Among them, Allah says: {Whoever desires the life of this world and its adornments - We fully repay them for their deeds therein, and they therein will not be deprived 15 Those are the ones for whom there is not in the Hereafter but the Fire. And lost is what they did therein, and worthless is what they used to do} [Hud: 15 - 16].\nAnd He says: {So whoever would hope for the meeting with his Lord - let him do righteous work and not associate...",
    "foot_note": "1. Narrated by Al-Bukhari in Al-Adab Al-Mufrad (377) No. (716). Al-Albani authenticated it in Sahih Al-Adab Al-Mufrad (265 - 266) No. (554), and also in Sahih Al-Jami' (1/ 694) No. (3731), and classified it as Hasan due to supporting evidence in Sahih Al-Targhib (1/ 121) No. (36). The scholar Ibn Baz, may Allah have mercy on him, said in the famous fatwa program (Nur 'Ala Al-Darb) about this hadith: \"I know no harm in it, its chain I know no defect in.\" See: Official website of Sheikh Imam Ibn Baz at the link: ttps:// binbaz.org.sa/ fatwas/ 11434/. Based on what these two scholars said regarding the ruling of the hadith, it is a Sahih hadith, and Allah knows best.",
    "book_id": "864",
    "new_page_number": 73
  },
  {
    "serial_number": "4929268",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Impact of the Heart's Action on Quran Recitation and Reflection",
    "edition": "None",
    "publisher": "None",
    "page_number": 71,
    "volume_number": 1,
    "text": "...in the worship of his Lord anyone} [Al-Kahf: 110].\nThe Prophet, peace be upon him, said: \"Whoever seeks to be heard, Allah will make him heard (expose him); and whoever shows off, Allah will show him off (expose him)\" (1).\nAl-Khattabi, may Allah have mercy on him, mentioned regarding the meaning of the hadith: That whoever does a deed without sincerity, wanting only that people see him and hear him, Allah rewards him for that by making him famous and exposing him, and revealing what he was concealing (2).\nIbn Hajar added to what Al-Khattabi mentioned, saying: \"It is said: Whoever intends by his deed status and rank among people, and does not desire the Face of Allah by it, Allah makes him a topic of conversation among the people with whom he sought rank, and he has no reward in the Hereafter. The meaning of 'shows him off': He informs them that he did that for them, not for His Face\" (3).\nFrom Mahmoud bin Labid, may Allah be pleased with him, who said: The Messenger of Allah, peace be upon him, said: \"Indeed, the most I fear for you is minor Shirk.\" They said: \"O Messenger of Allah, what is minor Shirk?\" He said: \"Riya (showing off); Indeed Allah says on the Day when servants are recompensed for their deeds: Go to those to whom you used to show off with your deeds in the world, and look, do you find any reward with them?!\" (4).\nFrom Abu Huraira who said: The Messenger of Allah, peace be upon him, said: \"Allah Blessed and Exalted said: I am the most self-sufficient of partners, needing no partnership. Whoever does a deed in which he associates another with Me, I abandon him and his Shirk\" (5).\nWe have already passed the hadith of those with whom the Fire will be first kindled, and among them was mentioned the Quran reciter who wants people's praise for him and performs this worship for the sake of people. We seek refuge in Allah from their state.",
    "foot_note": "1. Narrated by Al-Bukhari, wording from Jundub, may Allah be pleased with him (8/ 104) No. (6499), and Muslim from Ibn Abbas, may Allah be pleased with them both (4/ 2289) No. (2986). \n2. See: A'lam al-Hadith fi Sharh Sahih Al-Bukhari by Al-Khattabi (3/ 2257). \n3. Fath al-Bari (11/ 336). \n4. Narrated by Ahmad (39/ 43 - 44) No. (23636), Al-Mundhiri improved its chain in Al-Targhib (1/ 34) No. (50), Al-Haythami said in Majma' al-Zawa'id (1/ 102) No. (375): \"Narrated by Ahmad, and its men are men of the Sahih\", Al-Albani authenticated it in Sahih Al-Targhib (1/ 120) No. (32), and Shu'aib Al-Arna'ut said in his checking of Al-Musnad (39/ 44) No. (23636): \"Its chain is Hasan\". \n5. Narrated by Muslim (4/ 2289) No. (2985).",
    "book_id": "864",
    "new_page_number": 74
  },
  {
    "serial_number": "4929269",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Impact of the Heart's Action on Quran Recitation and Reflection",
    "edition": "None",
    "publisher": "None",
    "page_number": 72,
    "volume_number": 1,
    "text": "**Requirement 2: Defect in following the Prophetic guidance in reciting and reflecting upon the Quran.**\nReciting the Quran and reflecting upon it is a great worship that is not accepted except with sincerity to Allah Almighty and agreement with the Prophetic guidance. Sincerity has been discussed. Defect in following the guidance of the Prophet, peace be upon him, in this worship leads to lack of benefit from this Great Book and prevents its blessed impact on its owner. This defect has several manifestations, including:\n1. Completing it (Khatm) in less than three days. Prohibition of that has been reported and mentioned previously.\n2. Speed in reciting it, where the reciter's concern is the end of the Surah. This leads to lack of understanding and reflection, and violation of the rules of Tajweed. Ibn Mas'ud, may Allah be pleased with him, said: \"Recite the Quran and move the hearts with it, and let not the concern of one of you be the end of the Surah.\" This has been discussed previously.\n3. Reading it with the melodies of singers, with affectation and excessive stretching of letters beyond the limits of correct performance. This is accompanied by much clamor and raising of voices by the listeners, and voices are raised in a way unbecoming when hearing the Speech of Allah Almighty, like the 'clamor of markets' which is forbidden. The Messenger of Allah, peace be upon him, said: \"Let those of understanding and intellect be near me among you. Then those who follow them (three times), and beware of the clamor of markets\" (1). The meaning of \"clamor of markets\" includes raising voices, shouting, and noise (2).\n\n**Requirement 3: Lack of purity of the heart.**\nBenefiting from the Quran and being affected by it is closely linked to the purity and soundness of the heart. The aversion and distance from reflecting upon the Quran and benefiting from it is due to the lack of heart purity. It is a punishment resulting from a defect in compliance with Allah's command, and a trial caused by objecting to Allah's judgment and attempting to manipulate it, distorting religion seeking people's pleasure, and pretending religious matters while harboring hatred for the truth inwardly. This leads to corruption of the heart, lack of its purity, and consequently lack of benefit from Allah's speech and hardness of the heart. This is...",
    "foot_note": "1. Narrated by Muslim (1/ 323) No. (432). \n2. See: Sharh Al-Nawawi on Muslim (4/ 156), Tawfiq al-Rabb al-Mun'im bi Sharh Sahih Al-Imam Muslim (2/ 94).",
    "book_id": "864",
    "new_page_number": 75
  },
  {
    "serial_number": "4929270",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Impact of the Heart's Action on Quran Recitation and Reflection",
    "edition": "None",
    "publisher": "None",
    "page_number": 73,
    "volume_number": 1,
    "text": "...a punishment with which Allah strikes those hearts. Allah says about the state of those Jews and who resembles them: {O Messenger, let them not grieve you who hasten into disbelief of those who say, \"We believe\" with their mouths, but their hearts believe not, and from among the Jews. [They are] avid listeners to falsehood, listening to another people who have not come to you. They distort words beyond their [proper] usages, saying \"If you are given this, take it; but if you are not given it, then beware.\" But he for whom Allah intends fitnah - never will you possess [power to do] for him a thing against Allah. Those are the ones for whom Allah does not intend to purify their hearts. For them in this world is disgrace, and for them in the Hereafter is a great punishment} [Al-Ma'idah: 41].\n\n**Requirement 4: Not estimating the Speech of Allah with its true estimation.**\nThis obstacle results from the previous cause. When hearts became soiled and were not pure, the Speech of Allah had no esteem with them, so they did not benefit from it nor rise by it. Rather, they saw no status or esteem for it, so they abandoned it with all kinds of abandonment, and saw glory in other things like sciences of East and West. Therefore, they are deprived of the blessing of reflecting upon it and benefiting from it. Allah informed in His Book that the glory of the Muslim and the Ummah lies in connection with the Quran, holding fast to it, and turning to it. He says: {So adhere to that which has been revealed to you. Indeed, you are on a straight path 43 And indeed, it is a remembrance for you and your people, and you are going to be questioned} [Az-Zukhruf: 43 - 44].\nThe exegetes said regarding the meaning of His saying: {And indeed, it is a remembrance for you and your people and you are going to be questioned} [Az-Zukhruf: 44]. It is an honor for you and your people who followed you with this Quran, and it is a pride for you and a great virtue, and a blessing whose value is only estimated by one who knows its worth (1).\nAnd He says: {We have certainly sent down to you a Book in which is your mention. Then will you not reason?} [Al-Anbiya: 10]. It is an honor for whoever follows its guidance and acts upon what is in it (2).",
    "foot_note": "1. See: Tafsir Al-Tabari (20/ 603), Tafsir Al-Sa'di (766). \n2. See: Tafsir Al-Tabari (16/ 232).",
    "book_id": "864",
    "new_page_number": 76
  },
  {
    "serial_number": "4929271",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Impact of the Heart's Action on Quran Recitation and Reflection",
    "edition": "None",
    "publisher": "None",
    "page_number": 74,
    "volume_number": 1,
    "text": "Ibn Kathir, may Allah have mercy on him, says: \"Allah says alerting to the honor of the Quran, and inciting them to know its worth: {We have certainly sent down to you a Book in which is your mention}. Ibn Abbas said: Your honor\" (1).\nAl-Sa'di said in his interpretation of this verse: \"We have sent down to you - O those to whom the Messenger was sent, Muhammad bin Abdullah bin Abd al-Muttalib - a majestic Book and a clear Quran {in which is your mention} meaning: your honor, pride, and elevation. If you are reminded by it of the truthful news in it and believe them, comply with the commands in it, and avoid the prohibitions in it, your worth rises and your matter becomes great. {Then will you not reason?} what benefits you and what harms you? How do you not accept and work upon that in which is your mention and honor in this world and the Hereafter? If you had intellect, you would have followed this path. When you did not follow it, and followed other paths containing your lowliness and baseness in this world and the Hereafter and your misery in them, it became known that you have no sound intellect nor correct opinion. This verse, its confirmation is what happened. For the believers in the Messenger, who took heed by the Quran, from the Companions and those after them, obtained such elevation, dazzling height, great fame, and honor over kings, which is a matter known to everyone. Just as it is known what happened to those who did not raise a head to this Quran, and were not guided by it nor purified by it, of loathing, lowliness, burying (in obscurity), and misery. There is no way to happiness in this world and the Hereafter except by taking heed through this Book\" (2).\nThe Prophet, peace be upon him, said: \"Indeed, Allah raises nations by this Book and lowers others by it\" (3).\nBased on this, whoever does not estimate the Quran with its true estimation and act upon what is in it, Allah veils him from the blessing of the Quran, and humiliation, disgrace, and loss befall him in this world and the Hereafter.",
    "foot_note": "1. Tafsir Ibn Kathir (5/ 334). \n2. Tafsir Al-Sa'di (p. 519). \n3. Narrated by Muslim (1/ 79) No. (218).",
    "book_id": "864",
    "new_page_number": 77
  },
  {
    "serial_number": "4929272",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Impact of the Heart's Action on Quran Recitation and Reflection",
    "edition": "None",
    "publisher": "None",
    "page_number": 75,
    "volume_number": 1,
    "text": "**Requirement 5: Attachment of the heart to other than Allah.**\nThis Quran is great, a mighty Book. Allah says about it: {And indeed, it is a mighty Book 41 Falsehood cannot approach it from before it or from behind it; [it is] a revelation from a [Lord who is] Wise and Praiseworthy} [Fussilat: 41 - 42].\nIt is a Book preserved by Allah's preservation, protected by Allah's protection. Falsehood has no way to it because it is sent down from Allah, Lord of the Worlds. It has an impregnable status, gathering descriptions of perfection, immune from anyone wanting distortion or evil for it. {Falsehood cannot approach it from before it or from behind it; [it is] a revelation from a [Lord who is] Wise and Praiseworthy}. Devils and Jinn do not approach it with alteration or distortion by addition or decrease, nor by inserting into it what is not of it. It is preserved in its revelation, preserved in its words and meanings. Allah has guaranteed that, saying: {Indeed, it is We who sent down the Qur'an and indeed, We will be its guardian} [Al-Hijr: 9].\n{A revelation from a Wise} in His creation, command, and sayings; He places everything in its place and reveals it in its station. {Praiseworthy} for what He has of attributes of perfection and qualities of majesty, and for what He has of justice and benevolence. Therefore, His Book contains complete wisdom, achieving interests and benefits, and repelling evils and harms, for which He is praised, and whose consequences and ends are praiseworthy (1).\nThese are some attributes of this Book. If the heart attaches to other than Allah, Allah deprives him, by this blameworthy action of his - and your Lord does not wrong anyone - of the blessing of the Mighty Book, and he is prevented from its impact on him. Because his heart attached to other than its Great Revealer, and became soiled with love of other than Allah from forbidden desires and ambiguities. So the fitting recompense was that a barrier be placed between him and the blessing of reflecting upon the Quran.\n\n**Requirement 6: Heedlessness about meeting Allah in the Hereafter.**\nAmong the great causes that veil the heart from reflecting upon the Quran and benefiting from it is heedlessness about meeting Allah, which inevitably leads to heedlessness about the Hereafter. So a barrier is placed between him and the blessings of reflecting upon the Great Quran. Allah says about the heedless when Allah's verses are recited to them: {And when Our verses are recited to them as clear evidences, those who do not hope for the meeting with Us say, \"Bring us a Qur'an other than this or change it\"} [Yunus: 15]...",
    "foot_note": "1. See: Tafsir Ibn Kathir (7/ 183), Tafsir Al-Sa'di (749 - 750).",
    "book_id": "864",
    "new_page_number": 78
  },
  {
    "serial_number": "4929273",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Impact of the Heart's Action on Quran Recitation and Reflection",
    "edition": "None",
    "publisher": "None",
    "page_number": 76,
    "volume_number": 1,
    "text": "...the Verse. And He says: {[The time of] their account has approached for the people, while they are in heedlessness turning away 1 No mention comes to them from their Lord [that is] new except they listen to it while they are playing 2 With their hearts distracted} [Al-Anbiya: 1 - 3].\nAnd He says about the state of the heedless in this world and the Hereafter: {And whoever turns away from My remembrance - indeed, he will have a depressed life, and We will gather him on the Day of Resurrection blind 124 He will say, \"My Lord, why have you raised me blind while I was [once] seeing?\" 125 [Allah] will say, \"Thus did Our signs come to you, and you forgot them; and thus will you this Day be forgotten\"} [Ta-Ha: 124 - 126].\nAnd He says about the state of the heedless in the Hereafter, and what Allah reminds them of while they are in the Fire regarding the states of heedlessness they were in during the world, in a terrifying scene from which hearts almost tear out: {And those whose scales are light - those are the ones who have lost their souls, [being] in Hell, abiding eternally 103 The Fire will sear their faces, and they therein will have taut smiles 104 \"Were not My verses recited to you and you used to deny them?\" 105 They will say, \"Our Lord, our wretchedness overcame us, and we were a people astray 106 Our Lord, remove us from it, and if we return [to evil], we are indeed wrongdoers\" 107 He will say, \"Remain despised therein and do not speak to Me 108 Indeed, there was a party of My servants who said, 'Our Lord, we have believed, so forgive us and have mercy upon us, and You are the best of the merciful' 109 But you took them in mockery to the point that they made you forget My remembrance, and you used to laugh at them 110 Indeed, I have rewarded them this Day for their patient endurance - that they are the attainers [of success]\" 111 He will say, \"How long did you remain on earth in number of years?\" 112 They will say, \"We remained a day or part of a day; ask those who enumerate\" 113 He will say, \"You stayed not but a little - if only you had known 114 Then did you think that We created you uselessly and that to Us you would not be returned?\" 115 So exalted is Allah, the Sovereign, the Truth; there is no deity except Him, Lord of the Noble Throne} [Al-Mu'minun: 103 - 116].",
    "foot_note": "None",
    "book_id": "864",
    "new_page_number": 79
  },
  {
    "serial_number": "4929274",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Impact of the Heart's Action on Quran Recitation and Reflection",
    "edition": "None",
    "publisher": "None",
    "page_number": 77,
    "volume_number": 1,
    "text": "**Requirement 7: Shortcomings in performing obligatory duties, and consequently neglecting voluntary ones.**\nThe Great Quran has blessed effects on those whom Allah loves because of their maintaining obligatory duties and their frequent drawing near to Allah with voluntary deeds. So Allah opens their hearts to reflect upon His verses as He loves and is pleased with, and Allah teaches them and opens for them treasures of the Holy Quran, because He loves them. He, peace be upon him, said: \"Allah said: My servant does not draw near to Me with anything more beloved to Me than what I have obligated upon him. And My servant continues to draw near to Me with voluntary deeds until I love him. When I love him, I become his hearing with which he hears, his sight with which he sees, his hand with which he strikes, and his foot with which he walks. If he asks Me, I will surely give him, and if he seeks My refuge, I will surely grant him refuge...\" Hadith (1).\nIf the servant is negligent in obligatory duties and falls short in voluntary deeds, he is distanced from Allah, and Satan gains power over him, making him forget the remembrance of Allah, and at the head of Allah's remembrance is reciting the Quran and reflecting upon it. Allah says about the state of those whom devils have overpowered: {Satan has overcome them and made them forget the remembrance of Allah} [Al-Mujadilah: 19].\nIbn Kathir, may Allah have mercy on him, said: \"Meaning: Satan overpowered their hearts until he made them forget to remember Allah, Exalted and Majestic. This is what he does to whomever he overpowers. For this reason, Abu Dawood said... from Abu Darda: I heard the Messenger of Allah, peace be upon him, say: 'There are no three in a village or desert among whom prayer is not established but that Satan has overpowered them. So stick to the congregation, for the wolf only eats the stray sheep.' Zaida said: Al-Sa'ib said: Meaning prayer in congregation\" (2)\" (3).",
    "foot_note": "1. Narrated by Al-Bukhari (8/ 105) No. (6502). \n2. It is in Sunan Abu Dawood (1/ 150) No. (547). Al-Albani classified it as Hasan in Sahih Sunan Abu Dawood (3/ 58) No. (556), and the investigator of Al-Musnad classified its chain as Hasan (45/ 507) No. (27514). \n3. Tafsir Ibn Kathir (8/ 53).",
    "book_id": "864",
    "new_page_number": 80
  },
  {
    "serial_number": "4929275",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Impact of the Heart's Action on Quran Recitation and Reflection",
    "edition": "None",
    "publisher": "None",
    "page_number": 78,
    "volume_number": 1,
    "text": "**Requirement 8: Sitting with people of desires who strike parts of the Quran against others, follow its ambiguous parts, and leave its clear parts.**\nSitting with people of desires corrupts the heart and sickens it, so one finds no pleasure in reciting the Quran and reflecting upon it. The sweetness of worship goes away from him, and it makes him understand the Quran according to the methodology of the people of innovation with whom he sits. Therefore, caution against sitting with them is necessary for anyone who wants safety for his heart. The Prophet, peace be upon him, warned against these people. From Aisha, may Allah be pleased with her, she said: \"The Messenger of Allah, peace be upon him, recited this verse: {It is He who has sent down to you the Book; in it are verses [that are] precise - they are the foundation of the Book - and others unspecific. As for those in whose hearts is deviation [from truth], they follow that of it which is unspecific, seeking discord and seeking an interpretation [suitable to them]} until his saying: {men of understanding} [Al-Imran: 7]. She said: The Messenger of Allah, peace be upon him, said: If you see those who follow what is unspecific of it, then those are the ones whom Allah has named, so beware of them\" (1).\nFrom Umar bin al-Khattab, may Allah be pleased with him, that the Messenger of Allah, peace be upon him, said: \"Indeed, the most I fear for my Ummah is every hypocrite with a knowledgeable tongue\" (2).\nIt was the methodology of the Predecessors, may Allah have mercy on them, to beware of sitting with people of innovation and desires and to warn against that most severely; because hearts are weak, and doubts are snatching. Whoever exposes himself to them, they cling to his heart and corrupt it.\nBefore mentioning examples from the lives of the Predecessors showing their extreme caution against people of desires, I would like to present this important alert.\n**Important Alert:** This sitting in our time does not necessarily mean attending their gatherings or reading their books; because the concept of sitting has changed in our time due to what is called social media, following their intellectual output found on the internet, or following that takes place through satellite broadcasting.",
    "foot_note": "1. Narrated by Al-Bukhari, and the wording is his (6/ 34) No. (4547), and Muslim (4/ 2053) No. (2665). \n2. Narrated by Ahmad in Al-Musnad (1/ 289) No. (143), Ibn Hibban in his Sahih (1/ 281) No. (80). In Majma' al-Zawa'id (1/ 187) No. (886): \"Narrated by Al-Bazzar, Ahmad, and Abu Ya'la, and its men are trustworthy.\" Al-Albani authenticated it in Sahih Al-Jami' (1/ 107) No. (239), and the investigator of Musnad Ahmad (1/ 289) said: \"Its chain is strong\".",
    "book_id": "864",
    "new_page_number": 81
  },
  {
    "serial_number": "4929276",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Impact of the Heart's Action on Quran Recitation and Reflection",
    "edition": "None",
    "publisher": "None",
    "page_number": 79,
    "volume_number": 1,
    "text": "In this time, a person can sit with people of innovation and desires, see and hear their lessons, sermons, and lectures, and read their books while he is in his house, with vast distances between him and them. Add to this the weakness of religious knowledge and weak adherence to religion among the recipients, and the ability of the people of falsehood to argue and confuse truth with falsehood. Therefore, the danger is great and the matter is serious. Then we know why the Predecessors warned against sitting with people of desires and were keen not to hear their speech despite their scientific strength, the firmness of religion in their hearts, and their ability to argue and debate. Yet safety has no equal, hearts are weak, doubts are snatching, and devils are present supplying their companions with adorned speech, about which Allah said: {And thus We have made for every prophet an enemy - devils from mankind and jinn, inspiring to one another decorative speech in delusion. But if your Lord had willed, they would not have done it, so leave them and that which they invent} [Al-An'am: 112].\nIbrahim al-Nakha'i, may Allah have mercy on him, said: \"Do not sit with people of desires; for sitting with them removes the light of faith from hearts, takes away the beauty of faces, and inherits hatred in the hearts of believers\" (1).\nAl-Dhahabi, may Allah have mercy on him, mentioned: \"From Sufyan al-Thawri, may Allah have mercy on him: Whoever lends his ear to an innovator knowing it, leaves Allah's protection and is entrusted to himself. And from him: Whoever hears an innovation should not tell it to his sitters, lest he cast it into their hearts. I say (2): Most Imams of the Predecessors are upon this warning; they see that hearts are weak and doubts are snatching\" (3).\nThe meaning of Imam Al-Dhahabi's words, may Allah have mercy on him: The Predecessors warn against listening to the speech of innovators because hearts are weak and quickly affected by what they hear. Doubts snatch hearts and incline them away from the path of guidance, and Satan adorns them so the foot slips after its firmness.",
    "foot_note": "1. Al-Ibanah Al-Kubra (2/ 439). Al-Bighdah means: the hearts of believers do not love him. See: Al-Sihah (3/ 1066 - 1067) entry (Baghad). \n2. The speaker is Imam Al-Dhahabi, may Allah have mercy on him. \n3. Siyar A'lam al-Nubala (7/ 261).",
    "book_id": "864",
    "new_page_number": 82
  },
  {
    "serial_number": "4929277",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Impact of the Heart's Action on Quran Recitation and Reflection",
    "edition": "None",
    "publisher": "None",
    "page_number": 80,
    "volume_number": 1,
    "text": "Scholars, may Allah have mercy on them (1), mentioned narrations from the Predecessors warning against sitting with people of desires due to its danger to hearts. Among that: \"Abu Qilaba, may Allah have mercy on him, said: Do not sit with people of desires - or he said: people of disputes - for I do not feel safe that they might immerse you in their misguidance and confuse you about some of what you know. Two men from the people of desires entered upon Muhammad bin Sirin and said: O Abu Bakr, shall we narrate a hadith to you? He said: No. They said: Shall we read a verse to you? He said: No, either you leave me or I leave. So they left. Some people said: O Abu Bakr, what harm is there if a verse is read to you?! ... He said: I feared that they might read a verse and distort it, and that would settle in my heart. A man from the people of innovation said to Ayyub: O Abu Bakr, I ask you about a word? He turned away, signaling with his hand: No, not even half a word. Al-Hasan used to say: The worst disease that enters a heart - meaning: desires. Hudhayfah said: Fear Allah, and take the path of those who were before you. By Allah, if you remain steadfast, you have outstripped by a far distance. But if you leave it right and left, you have gone astray into a far error - or he said: clear -\" (2).\nA man said to Ibn Sirin: \"Indeed So-and-so wants to come to you and will not speak anything. He said: Tell So-and-so: No, let him not come to me. For the heart of the son of Adam is weak, and I fear to hear a word from him and my heart might not return to what it was\" (3).\nAl-Ajurri narrates with his chain from Mahdi bin Maymun who said: \"I heard Muhammad - meaning Ibn Sirin - and a man argued with him (4) about something. Muhammad said: I know what you want, and I am more knowledgeable about arguing than you, but I will not argue with you\" (5).\nLook at this great Imam, one of the seniors of Ahlus-Sunnah in knowledge and action. Despite this...",
    "foot_note": "1. See: Al-Shari'ah (1/ 435 - 440), Al-Ibanah Al-Kubra (5/ 2544 - 2546), Sharh Usul I'tiqad Ahl al-Sunnah (1/ 101, 150 - 151). \n2. All these narrations from the Salaf were mentioned by Al-Dhahabi in Siyar A'lam al-Nubala (11/ 285). \n3. Al-Ibanah Al-Kubra (2/ 446). \n4. i.e., debated him. \n5. Al-Shari'ah by Al-Ajurri (1/ 453).",
    "book_id": "864",
    "new_page_number": 83
  },
  {
    "serial_number": "4929278",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Impact of the Heart's Action on Quran Recitation and Reflection",
    "edition": "None",
    "publisher": "None",
    "page_number": 81,
    "volume_number": 1,
    "text": "...great knowledge and ability to debate, he feared for his heart that a doubt might penetrate it and it would not return to how it was, and its tenderness, humility, and pleasure in worship would go away due to hearing the speech of people of falsehood. It sickens hearts even if they were healthy, and corrupts them even if they were sound. So beware, beware. Hearing or seeing people of falsehood is considered a punishment for people of living hearts. The mother of Jurayj the monk prayed against her son - when he preferred voluntary prayer over answering her - that Allah punish him by seeing the faces of sinful women, meaning prostitutes. Allah punished him with that because seeing dark faces transmits its effect to the heart with some blurriness in seeing the truth. Whoever lets his gaze wander in those faces and listens to their speech, a darkness strikes his heart according to the proximity, the effect of which reflects in his aversion to the Quran and its people. It also affects the purity of the heart, so turbidity strikes it which weakens its understanding of the Quran, incapacitates reflection upon it, and the chest tightens at its recitation. He finds no pleasure in reflecting upon it and understanding it, nor benefits from its admonitions, deterrents, promises, and threats. His heart's condition might reach the point where he finds pleasure in forbidden desires like listening to musical instruments that he does not find when reciting or listening to the Quran. We ask Allah for well-being and safety.\n\n**Requirement 9: Sins committed in seclusion.**\nSins have a great effect on blinding the heart so it does not see the realities of the Quran nor perceives its light. Allah says: {For indeed, it is not eyes that are blinded, but blinded are the hearts which are within the breasts} [Al-Hajj: 46]. Due to sins, a covering comes over the heart called Al-Ran, which the verse mentioned, and as in the hadith of Abu Huraira, may Allah be pleased with him, from the Messenger of Allah, peace be upon him, who said: \"When a servant commits a sin, a black dot is marked in his heart. If he gives up, seeks forgiveness, and repents, his heart is polished. But if he returns, it is increased until it covers his heart. That is the Ran which Allah mentioned: {No! Rather, the stain has covered their hearts of that which they were earning} [Al-Mutaffifin: 14].\"\nAmong the most dangerous sins to the heart are sins of seclusion. They corrupt the heart and destroy righteous deeds on the Day of Resurrection, until their doer becomes one of the bankrupt. Here is this great hadith that clarifies the danger of sins in the state of seclusion with Allah and lack of shame. He, peace be upon him, said: \"I certainly know people of my Ummah who will come on the Day of Resurrection with good deeds like the mountains of Tihamah white (bright), and Allah Almighty will make them scattered dust.\" Thawban said: \"O Messenger of Allah, describe them to us, make them clear to us, so that we may not be...",
    "foot_note": "None",
    "book_id": "864",
    "new_page_number": 84
  },
  {
    "serial_number": "4929279",
    "category_id": "23",
    "category": "Spirituality, Manners and Supplications",
    "book_title": "The Impact of the Heart's Action on Quran Recitation and Reflection",
    "edition": "None",
    "publisher": "None",
    "page_number": 82,
    "volume_number": 1,
    "text": "...of them while we do not know.\" He said: \"They are your brothers and from your race, and they take from the night as you take, but they are a people who, when they are alone with the prohibitions of Allah, violate them\" (1).\nBased on this, hearts afflicted with such a disease do not benefit from the Quran and are far from being affected by it. A barrier has been placed between them and reflecting upon it and benefiting from it. They are hard hearts; heedlessness has struck their corners, and Satan has rallied against them with his cavalry and infantry. They violated prohibitions when alone and were heedless of Allah's knowledge of them, His hearing, and His seeing of them. So they unleashed themselves into forbidden desires. This is an example of that: when one of them is alone with the screen of his device, he looks when no human observer sees him; he looks at what Allah has forbidden of what his mobile device, computer, or satellite channel displays. He gives pleasure to his eyes and listens with his ears to the forbidden. If a human were watching him, he would not do that out of fear and shyness of them. We ask Allah for well-being and safety.\n\n**Requirement 10: Attachment to forbidden desires of the self, such as listening to forbidden things, looking at them, and consuming forbidden things.**\nSins have been discussed repeatedly, but here I intend a type of sin that has a great impact on its doer's aversion to the Quran, lack of benefit from it, and inability to reflect upon it as Allah loves and is pleased with. Among them:\n1. Listening to musical instruments.\n2. Looking with desire at what Allah has forbidden of women and beardless boys (2).\n3. Eating and drinking the forbidden.\n\nAnd peace and blessings be upon our Prophet, Imam, and Role Model, Muhammad, the Servant of Allah and His Messenger.",
    "foot_note": "1. Narrated by Ibn Majah (2/ 1418) No. (4245), Al-Mundhiri said in Al-Targhib wa Al-Tarhib (3/ 170) No. (3534): \"Narrated by Ibn Majah and its narrators are trustworthy.\" Al-Busiri said in Zawa'id Ibn Majah (4/ 246) No. (1525): \"This chain is authentic, its men are trustworthy.\" Al-Albani authenticated it in Sahih Al-Targhib wa Al-Tarhib (2/ 591) No. (2346), and Shu'aib Al-Arna'ut classified its chain as Hasan in his checking of Sunan Ibn Majah (5/ 317) No. (4245). \n2. Al-Murdan is the plural of Amrad, which is a young boy whose beard has not grown due to his young age. See: Maqayis al-Lugha (5/ 317) entry (Marad).",
    "book_id": "864",
    "new_page_number": 85
  }
]