[
  {
    "text": "Questions of Abu Bakr Ahmad bin Muhammad bin Hani al-Athram to Abu Abd Allah Ahmad bin Muhammad bin Hanbal\nAuthor: أبو عبد الله أحمد بن محمد بن حنبل بن هلال بن أسد الشيباني\nYear: 241",
    "foot_note": "",
    "page_number": 0,
    "volume_number": 0,
    "book_title": "Questions of Abu Bakr Ahmad bin Muhammad bin Hani al-Athram to Abu Abd Allah Ahmad bin Muhammad bin Hanbal",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "new_page_number": 1
  },
  {
    "text": "sn: 3313\nbook_title: من سؤالات أبي بكر أحمد بن محمد بن هانئ الأثرم أبا عبد الله أحمد بن محمد بن حنبل\nbook_link: https://shamela.ws/book/25873\nbook_id: 25873\nauthor_name: أبو عبد الله أحمد بن محمد بن حنبل بن هلال بن أسد الشيباني\nauthor_year: 241\nnickname: أبو عبد الله\nauthor_link: https://shamela.ws/author/220\nauthor_ID: 220\neditor: د. عامر حسن صبري\npublisher: دار البشائر الإسلامية - بيروت\nedition: الأولى، 1425هـ - 2004م.\npages: 53\nvolumes: Null\npagination: [ترقيم الكتاب موافق للمطبوع]\ncategory: العلل والسؤلات الحديثية\ncategory_id: 9",
    "foot_note": "",
    "page_number": 1,
    "volume_number": 0,
    "book_title": "Questions of Abu Bakr Ahmad bin Muhammad bin Hani al-Athram to Abu Abd Allah Ahmad bin Muhammad bin Hanbal",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "new_page_number": 2
  },
  {
    "serial_number": "3335996",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Questions of Abu Bakr Ahmad bin Muhammad bin Hani al-Athram to Abu Abd Allah Ahmad bin Muhammad bin Hanbal",
    "edition": "First, 1425 AH - 2004 AD.",
    "publisher": "Dar Al-Bashair Al-Islamiyah - Beirut",
    "page_number": 0,
    "volume_number": 1,
    "text": "Section: Hadith Defects and Questions\nBook: Questions of Abu Bakr Ahmad bin Muhammad bin Hani al-Athram to Abu Abd Allah Ahmad bin Muhammad bin Hanbal\nAuthor: Abu Abd Allah Ahmad bin Muhammad bin Hanbal bin Hilal bin Asad al-Shaybani (d. 241 AH)\nInvestigator: Dr. Amer Hasan Sabri\n\nBook: Questions of Abu Bakr Ahmad bin Muhammad bin Hani al-Athram to Abu Abd Allah Ahmad bin Muhammad bin Hanbal\nAuthor: Abu Abd Allah Ahmad bin Muhammad bin Hanbal bin Hilal bin Asad al-Shaybani (d. 241 AH)\nInvestigator: Dr. Amer Hasan Sabri\n\nAuthor: Abu Abd Allah Ahmad bin Muhammad bin Hanbal bin Hilal bin Asad al-Shaybani (d. 241 AH)\nInvestigator: Dr. Amer Hasan Sabri\n\nInvestigator: Dr. Amer Hasan Sabri\n\n\n\n\n[The book's pagination matches the printed version]",
    "foot_note": "None",
    "book_id": "25873",
    "new_page_number": 3
  },
  {
    "serial_number": "3335997",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Questions of Abu Bakr Ahmad bin Muhammad bin Hani al-Athram to Abu Abd Allah Ahmad bin Muhammad bin Hanbal",
    "edition": "First, 1425 AH - 2004 AD.",
    "publisher": "Dar Al-Bashair Al-Islamiyah - Beirut",
    "page_number": 25,
    "volume_number": 1,
    "text": "In the name of Allah, the Most Gracious, the Most Merciful.\nThe noble Sheikh Abu al-Qasim Abdullah bin al-Husayn bin Abdullah bin Rawahah al-Ansari informed us - by my reading to him in his home in Aleppo, on Tuesday the twentieth of Sha'ban in the year six hundred and thirty-eight - saying: The Hafiz Abu Tahir Ahmad bin Muhammad bin Ahmad bin Ahmad bin Muhammad bin Ibrahim al-Silafi al-Asbahani informed us - by reading to him while we were listening, in Jumada al-Ula of the year five hundred and seventy-three, in the outpost of Alexandria - Abu al-Qasim Mahmud bin Sa'adah bin Ahmad bin Yusuf bin Imran al-Hilali informed us - in the outpost of Salmas from the original record of his hearing, in the year five hundred and six - Abu Ya'la al-Khalil bin Abdullah al-Qazwini informed us - he came to us in the year four hundred and twenty-two - my father narrated to us, Ali bin Ahmad bin al-Sabah narrated to us, Abu Bakr Ahmad bin Muhammad bin Hani al-Athram narrated to us, saying:\n1- It was said to Abu Abd Allah Ahmad bin Muhammad bin Hanbal al-Shaybani: Who is Abu Najih who narrates from Abdullah bin Amr regarding the rent of the houses of...",
    "foot_note": "None",
    "book_id": "25873",
    "new_page_number": 4
  },
  {
    "serial_number": "3335998",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Questions of Abu Bakr Ahmad bin Muhammad bin Hani al-Athram to Abu Abd Allah Ahmad bin Muhammad bin Hanbal",
    "edition": "First, 1425 AH - 2004 AD.",
    "publisher": "Dar Al-Bashair Al-Islamiyah - Beirut",
    "page_number": 26,
    "volume_number": 1,
    "text": "Mecca? He said: He is Abu Abdullah bin Abi Najih.\n2- Abu Abd Allah said: Abd al-Razzaq's hearing from Sufyan in Mecca is disturbed (Mudtarib). As for his hearing in Yemen, I see that he dictated to them, so that is very authentic. The judge (Al-Qadi) used to write, and they used to correct.\n3- And I heard Abu Abd Allah say: Money we spent in the path of Allah going to Aden - meaning to Ibrahim bin al-Hakam.",
    "foot_note": "None",
    "book_id": "25873",
    "new_page_number": 5
  },
  {
    "serial_number": "3335999",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Questions of Abu Bakr Ahmad bin Muhammad bin Hani al-Athram to Abu Abd Allah Ahmad bin Muhammad bin Hanbal",
    "edition": "First, 1425 AH - 2004 AD.",
    "publisher": "Dar Al-Bashair Al-Islamiyah - Beirut",
    "page_number": 27,
    "volume_number": 1,
    "text": "4- It was said to Abu Abd Allah: Where does Abu Dawud stand compared to Abu Ubaidah? He said: Abu Dawud is more knowledgeable about Hadith and has a better memory; he [Abu Ubaidah] was not a man of memory, except that Abu Ubaidah's book was correct.\n5- I said to Abu Abd Allah: Ma'n bin Abd al-Rahman, whose son is he? He said: He is Ma'n bin Abd al-Rahman bin Abdullah bin Mas'ud. I said to him: He is the son of Abd al-Rahman bin Abdullah himself? He said: Yes. I said: Did Sufyan - meaning Al-Thawri - catch him [meet him]? He said: Yes, by my life, he narrated from him more than a little.\n6- I said to Abu Abd Allah: Ibn al-Mubarak narrated from Musa bin Uqbah from Nafi' from Ibn Umar: 'We used to only call Zaid bin Harithah...'? He said to me: From Nafi' is Munkar (objectionable); it is actually from Salim.",
    "foot_note": "None",
    "book_id": "25873",
    "new_page_number": 6
  },
  {
    "serial_number": "3336000",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Questions of Abu Bakr Ahmad bin Muhammad bin Hani al-Athram to Abu Abd Allah Ahmad bin Muhammad bin Hanbal",
    "edition": "First, 1425 AH - 2004 AD.",
    "publisher": "Dar Al-Bashair Al-Islamiyah - Beirut",
    "page_number": 28,
    "volume_number": 1,
    "text": "7- And I heard Abu Abd Allah being asked about the hadith of Ali regarding wiping (Al-Mash); is it authentic as Marfu' (attributed to the Prophet)? He said: Yes, it is Marfu'.\n8- It was said to Abu Abd Allah: Is the hadith of Shuraih bin Hani authentic? He said: Yes, he is very early; people narrated from him.\n9- It was said to Abu Abd Allah: Is Al-Miqdam bin Shuraih his son? He said: Yes. I said: Did Umarah also narrate from him? He said: Yes.\n10- It was said to Abu Abd Allah: Al-Qasim bin Mukhaymirah? He said: He is Kufan, he settled in Sham (Levant), and the Kufans narrated from him.\n11- It was said to Abu Abd Allah: Ghalib al-Qattan, whose son is he? He said:",
    "foot_note": "None",
    "book_id": "25873",
    "new_page_number": 7
  },
  {
    "serial_number": "3336001",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Questions of Abu Bakr Ahmad bin Muhammad bin Hani al-Athram to Abu Abd Allah Ahmad bin Muhammad bin Hanbal",
    "edition": "First, 1425 AH - 2004 AD.",
    "publisher": "Dar Al-Bashair Al-Islamiyah - Beirut",
    "page_number": 29,
    "volume_number": 1,
    "text": "Ibn Khattaf. He said it twice, with a Fatha on the Kha.\n12- And I heard Abu Abd Allah being asked about a man who is known by his nickname (Laqab)? He said: If he is not known except by it, like Al-A'mash, people only know him as such; so it is lenient in cases like this if he is famous by it.\n13- Abu Abd Allah dictated to us from his book: Al-Walid bin Muslim narrated to us, Al-Awza'i narrated to us, Abdah bin Abi Lubabah narrated to us, from Sa'id bin Abd al-Rahman bin Abza, from his father, that Abdullah bin Mas'ud: Performed Qunut in the Witr after the recitation and before the Ruku' (bowing).\n14- I said to Abu Abd Allah: Are Sa'id bin Abd al-Rahman bin Abza and Abdullah bin Abd al-Rahman bin Abza brothers? He said: Yes.",
    "foot_note": "None",
    "book_id": "25873",
    "new_page_number": 8
  },
  {
    "serial_number": "3336002",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Questions of Abu Bakr Ahmad bin Muhammad bin Hani al-Athram to Abu Abd Allah Ahmad bin Muhammad bin Hanbal",
    "edition": "First, 1425 AH - 2004 AD.",
    "publisher": "Dar Al-Bashair Al-Islamiyah - Beirut",
    "page_number": 30,
    "volume_number": 1,
    "text": "I said to him: Which of them is dearer to you? He said: Both of them are good in Hadith according to me.\n15- I said to Abu Abd Allah: Did Mu'alla write anything from him? He said: No, not even a letter.\n16- Abu Abd Allah narrated to us, Yahya bin Sa'id narrated to us, from Al-Awwam bin Hamzah, he said: I asked Abu Uthman about the Qunut? He said: After the Ruku'. I said: From whom? He said: From Abu Bakr, Umar, and Uthman, may Allah be pleased with them.\n17- Abu Abd Allah mentioned Atiyyah bin Bahram, and said: Atiyyah bin Bahram, this one is trustworthy (Thiqah).\n18- I said to Abu Abd Allah: Al-Muhallab bin Abi Habibah? He said: I see no harm in him. Then he said: Yahya narrated from him more than a little.",
    "foot_note": "None",
    "book_id": "25873",
    "new_page_number": 9
  },
  {
    "serial_number": "3336003",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Questions of Abu Bakr Ahmad bin Muhammad bin Hani al-Athram to Abu Abd Allah Ahmad bin Muhammad bin Hanbal",
    "edition": "First, 1425 AH - 2004 AD.",
    "publisher": "Dar Al-Bashair Al-Islamiyah - Beirut",
    "page_number": 31,
    "volume_number": 1,
    "text": "19- I said to Abu Abd Allah: Muhammad bin Amr Abu Sahl, how is he? He said: Abd al-Rahman used to narrate from him, but Yahya bin Sa'id did not find him agreeable, and I did not see Abu Abd Allah desiring him.\n20- Abu Abd Allah narrated to us, Yazid bin Harun narrated to us, Sufyan informed us, from Al-A'mash, from Ibrahim, from Al-Aswad, from Umar, that he used to perform Qunut in the Witr before the Ruku'.\n21- I said to Abu Abd Allah: Something narrated by Al-Walid bin Muslim, from Al-Awza'i, from Al-Zuhri, from Al-Qasim bin Muhammad, from Aisha, that the Prophet, may Allah bless him and grant him peace, was shrouded in a Hibara garment? He said: Yes, we have it.\n22- Say to Abu Abd Allah: The Hadith of Ibn Umar, is it from Julas bin Amr? He said: Yes, Julas. I said to him: A person said: 'Khulas'?! He laughed and said: It is only Julas.",
    "foot_note": "None",
    "book_id": "25873",
    "new_page_number": 10
  },
  {
    "serial_number": "3336004",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Questions of Abu Bakr Ahmad bin Muhammad bin Hani al-Athram to Abu Abd Allah Ahmad bin Muhammad bin Hanbal",
    "edition": "First, 1425 AH - 2004 AD.",
    "publisher": "Dar Al-Bashair Al-Islamiyah - Beirut",
    "page_number": 32,
    "volume_number": 1,
    "text": "Abu Abd Allah said: Waki' and Abu Mu'awiyah differed on it; one of them said: 'From his father.' It was said to him: Did anyone other than Abu Janab narrate it? He said: Not that I know. Then Abu Abd Allah said to me: The one who said 'Khulas', is he a man of Hadith?! And he smiled. I said: I think he meant Khulas bin Amr al-Hajari. He said: Where is this compared to that?\n23- I heard Abu Abd Allah being asked about the saying of the Prophet, may Allah bless him and grant him peace: 'I seek refuge in You from poverty.' How is this, when poverty has such virtue? He said: The Prophet, may Allah bless him and grant him peace, only sought refuge from poverty of the heart.",
    "foot_note": "None",
    "book_id": "25873",
    "new_page_number": 11
  },
  {
    "serial_number": "3336005",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Questions of Abu Bakr Ahmad bin Muhammad bin Hani al-Athram to Abu Abd Allah Ahmad bin Muhammad bin Hanbal",
    "edition": "First, 1425 AH - 2004 AD.",
    "publisher": "Dar Al-Bashair Al-Islamiyah - Beirut",
    "page_number": 33,
    "volume_number": 1,
    "text": "24- And Al-Awza'i was mentioned - meaning in the presence of Abu Abd Allah - so Al-Haitham bin Kharijah said: We heard our companions say: He is not from Al-Awza'; he is the son of the paternal uncle of Yahya bin Abi Amr al-Shaybani by lineage (lahan); he only settled in a village belonging to Al-Awza'. Al-Haitham said: A village in Damascus, when you exit from Bab al-Faradis. A man in the presence of Abu Abd Allah said: I heard Al-Walid say: Al-Awza'i was not from Al-Awza'.\n25- I heard Abu Abd Allah being asked about Abu Tumailah, Yahya bin Wadih, how is he? Is he trustworthy? He said: There is no harm in him. Then he said: I hope, if Allah wills, that there is no harm in him. Then he said: We wrote from him at the door of Hushaym, then he remained for a time after that, and he used to frequent [scholars] to write Hadith. It was said to him: Did he write from every type? He said: Yes, he used to write from all. It was said to him: Is he Khurasani? He said: Yes, from the people of Marw, our neighbor.",
    "foot_note": "None",
    "book_id": "25873",
    "new_page_number": 12
  },
  {
    "serial_number": "3336006",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Questions of Abu Bakr Ahmad bin Muhammad bin Hani al-Athram to Abu Abd Allah Ahmad bin Muhammad bin Hanbal",
    "edition": "First, 1425 AH - 2004 AD.",
    "publisher": "Dar Al-Bashair Al-Islamiyah - Beirut",
    "page_number": 34,
    "volume_number": 1,
    "text": "26- Abd al-Karim al-Kharraz was mentioned to Abu Abd Allah, and he criticized him and said: That one who narrates from Abu Ishaq?! And he smiled.\n27- Abu Abd Allah narrated to us, Rawh bin Ubadah narrated to us, Ash'ath narrated to us, from Al-Hasan, from Anas bin Malik, that the Messenger of Allah, may Allah bless him and grant him peace, and his companions arrived in Mecca, having recited Talbiyah for Hajj and Umrah... he mentioned the Hadith. Then he said: How strange is this?! He made it for Hajj and Umrah!\n28- Abu Abd Allah narrated to us, Bahz bin Asad Abu al-Aswad al-Ammi narrated to me - and he was reliable, trustworthy, a man of Hadith.\n29- Abu Abd Allah narrated to us, Hushaym narrated to us, Humaid al-Tawil informed us, Bakr bin Abdullah al-Muzani narrated to us, saying: I heard Anas bin Malik narrating, he said: I heard the Prophet, may Allah bless him and grant him peace, reciting Talbiyah for Hajj and Umrah together. I narrated that to Ibn Umar, and he said: He recited Talbiyah for Hajj alone. So I narrated that to Anas, and Anas said: 'They consider us nothing but children; I heard the Messenger of Allah, may Allah bless him and grant him peace, saying: Labbayk for Umrah and Hajj.'",
    "foot_note": "None",
    "book_id": "25873",
    "new_page_number": 13
  },
  {
    "serial_number": "3336007",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Questions of Abu Bakr Ahmad bin Muhammad bin Hani al-Athram to Abu Abd Allah Ahmad bin Muhammad bin Hanbal",
    "edition": "First, 1425 AH - 2004 AD.",
    "publisher": "Dar Al-Bashair Al-Islamiyah - Beirut",
    "page_number": 35,
    "volume_number": 1,
    "text": "Abu Abd Allah said: He did not mention exiting Ihram (Al-Ihlal) in it, while Ibn Abi Adi and Hammad bin Salamah mention exiting Ihram.\n30- I heard Abu Abd Allah say: Hisham - meaning Al-Dastawa'i - is more established in the Hadith of Yahya than Ma'mar.\n31- I said to Abu Abd Allah: Is Yazid, the freedman of Al-Munba'ith, known? He said: Yes.\n32- We came to Abu Abd Allah during the ten days of Adha. Abu Awanah said: We used to come to Al-Jurayri during the ten days, and he would say: These are days of work, and people have needs, and how prone the son of Adam is to boredom.",
    "foot_note": "None",
    "book_id": "25873",
    "new_page_number": 14
  },
  {
    "serial_number": "3336008",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Min Su'alat Abi Bakr Ahmad bin Muhammad bin Hani Al-Athram Aba Abdillah Ahmad bin Muhammad bin Hanbal",
    "edition": "First, 1425 AH - 2004 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyyah - Beirut",
    "page_number": 36,
    "volume_number": 1,
    "text": "33- I heard Abu Abdullah being asked: How many times did the Prophet, may Allah's peace and blessings be upon him, perform Hajj? He said: One, which is the apparent one; and it is said: Another Hajj before his migration. Abu Abdullah said: Mujahid and Abu Ishaq say: The Prophet, may Allah's peace and blessings be upon him, performed one Hajj before he migrated. 34- It was said to Abu Abdullah: And how many times did he perform Umrah? He said: Four Umrahs, and there are people who say three. 35- It was said to Abu Abdullah: Hudhayl bin Bilal, how is he? He said: I see no harm in him. 36- It was said to Abu Abdullah: Sudayr Al-Sayrafi, whose son is he? He said: I do not know what I heard [about that]. Then he said: Sudayr bin Hakim. I said to him: Who mentioned this? He said: Abu Al-Husayn Al-Ukkli, from Sharik, said: Sudayr bin Hakim.",
    "foot_note": "None",
    "book_id": "25873",
    "new_page_number": 15
  },
  {
    "serial_number": "3336009",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Min Su'alat Abi Bakr Ahmad bin Muhammad bin Hani Al-Athram Aba Abdillah Ahmad bin Muhammad bin Hanbal",
    "edition": "First, 1425 AH - 2004 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyyah - Beirut",
    "page_number": 37,
    "volume_number": 1,
    "text": "Abu Abdullah said: He narrated from Sharik. I said: And Hasan bin Salih? He said: Yes, and Al-Thawri. 37- I said to Abu Abdullah: Furat Al-Qazzaz, whose son is he? He said: I do not know. So I informed him about Ali, from Ziyad bin Hasan bin Furat, saying: He is the son of Abu Abdur-Rahman. So Abu Abdullah said: I saw a son of Hasan bin Furat sitting with Ibn Idris, but I did not take anything from him. 38- I said to Abu Abdullah: Simak Al-Hanafi, whose son is he? He said: I do not know. I said: The son of Al-Walid? He said: Some of them have attributed him [so]. I said to him: Abd Rabbih bin Bariq says Ibn Al-Walid? He said: Yes, Abd Rabbih bin Bariq. 39- Abu Abdullah said: Glory be to Allah! How knowledgeable Ibn Uyaynah was regarding Amr bin Dinar; the most knowledgeable of people regarding him was Ibn Uyaynah.",
    "foot_note": "None",
    "book_id": "25873",
    "new_page_number": 16
  },
  {
    "serial_number": "3336010",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Min Su'alat Abi Bakr Ahmad bin Muhammad bin Hani Al-Athram Aba Abdillah Ahmad bin Muhammad bin Hanbal",
    "edition": "First, 1425 AH - 2004 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyyah - Beirut",
    "page_number": 38,
    "volume_number": 1,
    "text": "And the knowledge of Shu'bah, Ayyub, and Ibn Jurayj was mentioned. I said to him: So which of the people is most knowledgeable about him? [He said]: I do not know anyone more knowledgeable about him than Ibn Uyaynah. It was said to him: Was Ibn Uyaynah young? He said: Even if he was young, a young person can be intelligent. 40- It was said to Abu Abdullah: Are Amr bin Dinar and Abdullah bin Dinar brothers? He said: No. Then he said: Abdullah bin Dinar is Madani, the client of Ibn Umar; and Amr bin Dinar is Makki, the client of Ibn Badhan. 41- Abu Abdullah said: Ata died in the year fourteen or fifteen [114 or 115 AH]. I said to him: Four or five? He said: They disagreed about it. 42- I heard Abu Abdullah say: Sufyan bin Uyaynah was born in the year one hundred and seven. 43- And Al-Zuhri came for Hajj in the year twenty-three, returned from Hajj, and died in the year four [124 AH]. 44- It was said to him: And Abu Ishaq? He said: Abu Ishaq died in the year twenty-nine [129 AH], meaning Al-Sabi'i.",
    "foot_note": "None",
    "book_id": "25873",
    "new_page_number": 17
  },
  {
    "serial_number": "3336011",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Min Su'alat Abi Bakr Ahmad bin Muhammad bin Hani Al-Athram Aba Abdillah Ahmad bin Muhammad bin Hanbal",
    "edition": "First, 1425 AH - 2004 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyyah - Beirut",
    "page_number": 39,
    "volume_number": 1,
    "text": "45- I heard Abu Abdullah being asked about Amr bin Shu'ayb. It was said to him: What do you say about him? He said: I write his Hadith; sometimes we argue using him as proof, and sometimes there is apprehension in the heart regarding him. Then he said: Malik narrates from a man from him. Abu Abdullah said: Amr bin Shu'ayb bin Muhammad bin Abdullah bin Amr bin Al-Aas. 46- It was said to Abu Abdullah: Where did Ikrimah die? He said: He died in Madinah; they claimed that his funeral and the funeral of Kuthayyir Azza were brought out on the same day. Then Al-Haytham bin Kharijah said on the authority of Abdul-Quddus: That Ikrimah died in Ifriqiyah (Africa), and no one was found to carry him until four Abyssinians were hired for him. Abu Abdullah rejected that.",
    "foot_note": "None",
    "book_id": "25873",
    "new_page_number": 18
  },
  {
    "serial_number": "3336012",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Min Su'alat Abi Bakr Ahmad bin Muhammad bin Hani Al-Athram Aba Abdillah Ahmad bin Muhammad bin Hanbal",
    "edition": "First, 1425 AH - 2004 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyyah - Beirut",
    "page_number": 40,
    "volume_number": 1,
    "text": "47- I heard Abu Abdullah mention the narration of Abu Asim from Abu Awanah, so he said: Affan said: 'I myself saw Abu Asim at Abu Awanah's, taking [Hadith] poorly.' 48- I heard Al-Haytham bin Kharijah say, while Abu Abdullah was listening: Ziyad bin Ilaqah Al-Taghlibi? Abu Abdullah said: O Abu Ahmad! He is Ziyad bin Ilaqah Al-Tha'labi. Al-Haytham said: Yes, Al-Tha'labi. 49- Abu Abdullah narrated to us a hadith in which he mentioned the Sufriyyah, so he said: The Sufriyyah are the Kharijites. 50- I heard Abu Abdullah mention the statement of Sufyan: 'Amr would not establish his age for us.' He said: He did not memorize how old he was. 51- I heard Abu Abdullah mention the name of Abu Muslim as Abdullah bin Thawb, then he smiled, then said: Ali said something else, and it is the correct one.",
    "foot_note": "None",
    "book_id": "25873",
    "new_page_number": 19
  },
  {
    "serial_number": "3336013",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Min Su'alat Abi Bakr Ahmad bin Muhammad bin Hani Al-Athram Aba Abdillah Ahmad bin Muhammad bin Hanbal",
    "edition": "First, 1425 AH - 2004 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyyah - Beirut",
    "page_number": 41,
    "volume_number": 1,
    "text": "52- I heard Abu Abdullah mention Zayd bin Murabba'. He said: The companion of the hadith of Amr bin Dinar. 53- Abu Abdullah mentioned the name of Abu Na'amah Al-Adawi. He said: This is Waki', if Allah wills, he named him Amr bin Isa. 54- I heard Abu Abdullah mention Abu Ayyub, the client of Uthman. He said: Abu Ya'qub Ishaq bin Uthman narrated hadiths from him. 55- I heard Abu Abdullah mention the saying of Shu'bah: 'I do not fear that anything will enter me into the Fire other than it' - meaning Hadith. He said: We know that he was pure in deeds, or something similar.",
    "foot_note": "None",
    "book_id": "25873",
    "new_page_number": 20
  },
  {
    "serial_number": "3336014",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Min Su'alat Abi Bakr Ahmad bin Muhammad bin Hani Al-Athram Aba Abdillah Ahmad bin Muhammad bin Hanbal",
    "edition": "First, 1425 AH - 2004 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyyah - Beirut",
    "page_number": 42,
    "volume_number": 1,
    "text": "56- Abu Abdullah mentioned Ibn Ayyash, so he said: He died long ago - meaning Isma'il. 57- Abu Abdullah mentioned Hafs bin Sulayman, so it was said to him: The Minqari? He said: Who else could Hafs bin Sulayman be but the Minqari?! 58- I heard Abu Abdullah mention the hadith of Musa bin Ali, from his father, from Maslamah bin Mukhallad. He mentioned it from Waki' and Abdur-Rahman, and they differed regarding it. One of them said: 'The Prophet, may Allah's peace and blessings be upon him, died when I was ten.' And the other said: 'When I was fourteen.' He said: 'Glory be to Allah!' marveling at that. 59- I heard Abu Abdullah mention that Mu'tamar was born in the year six [106 AH]. So I said to him: Is this old, O Abu Abdullah?! He said: Old?! He met Al-Rakin and so-and-so, and he was old.",
    "foot_note": "None",
    "book_id": "25873",
    "new_page_number": 21
  },
  {
    "serial_number": "3336015",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Min Su'alat Abi Bakr Ahmad bin Muhammad bin Hani Al-Athram Aba Abdillah Ahmad bin Muhammad bin Hanbal",
    "edition": "First, 1425 AH - 2004 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyyah - Beirut",
    "page_number": 43,
    "volume_number": 1,
    "text": "Then he said: He is older than Ibn Uyaynah; Ibn Uyaynah was [born in] seven, and he in six. 60- It was said to Abu Abdullah: Is it authentic to you that Abdullah accompanied the Prophet, may Allah's peace and blessings be upon him, on the Night of the Jinn? He said: I do not know?! 61- I heard Abu Abdullah mention Abu Al-Muhajir Al-Raqqi, so I said to him: Who is this? He said: He is well-known, Ali bin Thabit narrated from him. I said to him: Is there a name you know? He said: They have named him, but I do not remember it right now. Others besides Abu Abdullah named him Salim bin Abdullah. 62- Abu Abdullah mentioned, on the authority of Abu Abdur-Rahman Al-Muqri, the name of Abu Qabil, then said: How precise Abu Abdur-Rahman was regarding these people - meaning the people of Egypt.",
    "foot_note": "None",
    "book_id": "25873",
    "new_page_number": 22
  },
  {
    "serial_number": "3336016",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Min Su'alat Abi Bakr Ahmad bin Muhammad bin Hani Al-Athram Aba Abdillah Ahmad bin Muhammad bin Hanbal",
    "edition": "First, 1425 AH - 2004 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyyah - Beirut",
    "page_number": 44,
    "volume_number": 1,
    "text": "63- Abu Abdullah mentioned the lineage of Abdur-Rahman bin Humayd Al-Ru'asi, saying: Abdur-Rahman bin Humayd bin Abdur-Rahman bin Awf. So I said: The son of Abdur-Rahman bin Awf? He said: He is this Al-Ru'asi, but this lineage of his happens to match the lineage of the son of Abdur-Rahman bin Awf. 64- Abu Abdullah mentioned Abu Usamah, so he said: What strange narrations he had from Isma'il?! 65- Abu Abdullah mentioned Abu Amir Al-Hawzi Abdullah bin Luhay, so he said: Some of them said: Naji. I said to him: Yahya? He said: Luhay. He said: Yes, Yahya said: Luhay.",
    "foot_note": "None",
    "book_id": "25873",
    "new_page_number": 23
  },
  {
    "serial_number": "3336017",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Min Su'alat Abi Bakr Ahmad bin Muhammad bin Hani Al-Athram Aba Abdillah Ahmad bin Muhammad bin Hanbal",
    "edition": "First, 1425 AH - 2004 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyyah - Beirut",
    "page_number": 45,
    "volume_number": 1,
    "text": "66- I heard Abu Abdullah mention Ma'mar, so he said: Ma'mar was a man of knowledge and a man of travel. Then he mentioned those who narrated from him, so he mentioned Sa'id bin Abi Arubah, and I think he mentioned Ayyub, and said: Sa'id used to narrate from him saying: 'Ma'mar Al-Zuhri', attributing him to Al-Zuhri. 67- Abu Abdullah mentioned Rabah, the companion of Ma'mar, with something I have forgotten; that he was close to Ma'mar and he used to prefer him. 68- Abu Abdullah narrated to us, he said: Abdur-Rahman bin Mahdi narrated to us, he said: I asked Sufyan about a man from the People of the Covenant (Ahl al-Dhimmah) who bought land from the people of Ushr (tithe-land), is there Kharaj (land tax) on it? He said: No. 69- I heard Abu Abdullah say: Sa'id bin Abi Hilal, I do not know",
    "foot_note": "None",
    "book_id": "25873",
    "new_page_number": 24
  },
  {
    "serial_number": "3336018",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Min Su'alat Abi Bakr Ahmad bin Muhammad bin Hani Al-Athram Aba Abdillah Ahmad bin Muhammad bin Hanbal",
    "edition": "First, 1425 AH - 2004 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyyah - Beirut",
    "page_number": 46,
    "volume_number": 1,
    "text": "what his hadith is?! He mixes up hadiths. Then he said: He also narrates from Abu Al-Darda regarding prostration. I said: The hadith of Al-Najm? He said: Yes. 70- Abu Abdullah mentioned Abu Wahb Al-Jayshani Al-Daylam bin Al-Hawsha', so he said: I do not regard this one as anything [significant]. 71- I said to Abu Abdullah: Which is more authentic in hadith from Khalid bin Ma'dan: Thawr or Bahir bin Sa'd? So he prioritized Bahir over him.",
    "foot_note": "None",
    "book_id": "25873",
    "new_page_number": 25
  },
  {
    "serial_number": "3336019",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Min Su'alat Abi Bakr Ahmad bin Muhammad bin Hani Al-Athram Aba Abdillah Ahmad bin Muhammad bin Hanbal",
    "edition": "First, 1425 AH - 2004 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyyah - Beirut",
    "page_number": 47,
    "volume_number": 1,
    "text": "72- I heard Abu Abdullah, while Abu Bakr Al-Taliqani - the companion of Ibn Al-Mubarak - was with him, asking Abu Abdullah about the explanation of: 'Man ghassala wa-ightasala' (Whoever washes and bathes). He said: If it were 'Ghasala' (washed), it would be clearer. As for the one who said: 'Ghassala wa-ightasala', to me it resembles what Sufyan bin Uyaynah explained: 'Halla wa balla' (Permitted and lawful). He said: 'Halla muhallal' (Lawful, made lawful); it is like repetitive speech, similar to 'Wa bakkara wa-ibtakara' (went early and was early), repetitive speech. 73- Abu Abdullah mentioned that Ibn Uyaynah used to explain, and he explained well. I heard him explain his saying: 'Wa ana Aba Bakrin wa Umar minhum wa an'ama' (And I am [to] Abu Bakr and Umar among them and favored). He said: 'Among them and family' (ahlan). I saw that this pleased Abu Abdullah.",
    "foot_note": "None",
    "book_id": "25873",
    "new_page_number": 26
  },
  {
    "serial_number": "3336020",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Min Su'alat Abi Bakr Ahmad bin Muhammad bin Hani Al-Athram Aba Abdillah Ahmad bin Muhammad bin Hanbal",
    "edition": "First, 1425 AH - 2004 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyyah - Beirut",
    "page_number": 48,
    "volume_number": 1,
    "text": "He said: He narrated it from Malik bin Mighwal. 74- I heard Abu Abdullah mention Sufyan bin Uyaynah, so he said: We have not seen anyone like him. 75- Abu Bakr Al-Taliqani - the companion of Ibn Al-Mubarak - said to Abu Abdullah: Ibn Al-Mubarak has narrated from Umar bin Ali. He said: Like this? He said: Yes. He said: What did he narrate from him? He said: Umar bin Ali informed us, from Sufyan bin Husayn, from Iyas bin Mu'awiyah: 'Beware of the odd ones in knowledge.' Abu Abdullah said: How good his intellect was - meaning Umar bin Ali. 76- I heard Abu Abdullah mention Yahya bin Al-Durays, so he said: The judge of Rayy. 77- I heard Abu Abdullah being asked about Al-Zubayr bin Arabi, how is he? He said: I do not know him; I do not know anyone who narrated from him except Hammad bin Zayd. Then he said: I see no harm in him.",
    "foot_note": "None",
    "book_id": "25873",
    "new_page_number": 27
  },
  {
    "serial_number": "3336021",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Min Su'alat Abi Bakr Ahmad bin Muhammad bin Hani Al-Athram Aba Abdillah Ahmad bin Muhammad bin Hanbal",
    "edition": "First, 1425 AH - 2004 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyyah - Beirut",
    "page_number": 49,
    "volume_number": 1,
    "text": "78- I heard Abu Abdullah mention the death of Abu Awanah in the year seventy-six. 79- I heard Abu Abdullah mention Mu'awiyah bin Abdul-Karim, so he said: Mu'awiyah Al-Dall (The Lost One) is trustworthy; how established his hadith is! How authentic his hadith is! I said to Abu Abdullah: It is said that some of what he narrated from Ata, he did not hear. He denied that. And he said: He narrates some of them from Qays, and for some he says: 'I heard Ata'; meaning he does not practice Tadlis. It was said: Why was he named Al-Dall? He said: He got lost - they claimed - on the road to Mecca, so he was named Al-Dall. 80- I said to Abu Abdullah: Abu Qaza'ah, is his name Suwayd bin Hujayr? He said: Yes, Suwayd bin Hujayr.",
    "foot_note": "None",
    "book_id": "25873",
    "new_page_number": 28
  },
  {
    "serial_number": "3336022",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Min Su'alat Abi Bakr Ahmad bin Muhammad bin Hani Al-Athram Aba Abdillah Ahmad bin Muhammad bin Hanbal",
    "edition": "First, 1425 AH - 2004 AD",
    "publisher": "Dar Al-Bashair Al-Islamiyyah - Beirut",
    "page_number": 50,
    "volume_number": 1,
    "text": "It was said: Is he Abu Qaza'ah bin Suwayd? He said: Yes, he is his father. Shu'bah narrates hadiths from Abu Qaza'ah. As for Qaza'ah bin Suwayd, how few narrate from him; he is like the abandoned [in hadith]. 81- I heard Abu Abdullah mention the hadith 'Delay the loads/burdens', so he said: Sufyan - meaning Ibn Uyaynah - used to narrate it from Wa'il bin Dawud, from his son, from Al-Zuhri. 82- I said to Abu Abdullah: Uthman Al-Batti, whose son is he? He said: I do not know to inform you, except that Hushaym, when he narrated from him, would use his Kunya, and would not say 'Al-Batti' at all; he would say: Uthman Abu Amr. And someone other than Abu Abdullah said: He is Uthman bin Sulayman bin Jurmuz.",
    "foot_note": "None",
    "book_id": "25873",
    "new_page_number": 29
  },
  {
    "serial_number": "3336023",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Questions of Abu Bakr Ahmad bin Muhammad bin Hani al-Athram to Abu Abd Allah Ahmad bin Muhammad bin Hanbal",
    "edition": "First, 1425 AH - 2004 AD.",
    "publisher": "Dar Al-Bashair Al-Islamiyah - Beirut",
    "page_number": 51,
    "volume_number": 1,
    "text": "83- I heard Abu Abd Allah mention Ibrahim bin Shammas al-Samarqandi, and he praised him well. He said: 'Some of our companions wrote to me that he bequeathed one hundred thousand to buy captives from the Turks.' He said: 'So we bought two hundred souls or thereabouts.' Abu Abd Allah said: 'The Turks also killed him, so look at what his end was along with being killed?!' He mentioned him another time and said: 'A man of Sunnah, and he inflicted damage upon the Turks.'\n84- I heard Abu Abd Allah say: Hajjaj used to say in all of the hadith of Shu'bah the word: 'Shu'bah narrated to me'; he had asked him about it.\n85- Abu Abd Allah narrated to us the hadith of Zuhayr bin Muhammad, from Salih, from Kaysan, from Abdullah bin Abi Umamah, from his father, from the Prophet, may Allah bless him and grant him peace: 'Shabbiness (simplicity in dress) is part of faith.' He says: 'This is not Abu Umamah al-Bahili; this, they say, is Abu Umamah bin Tha'labah al-Ansari.'",
    "foot_note": "None",
    "book_id": "25873",
    "new_page_number": 30
  },
  {
    "serial_number": "3336024",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Questions of Abu Bakr Ahmad bin Muhammad bin Hani al-Athram to Abu Abd Allah Ahmad bin Muhammad bin Hanbal",
    "edition": "First, 1425 AH - 2004 AD.",
    "publisher": "Dar Al-Bashair Al-Islamiyah - Beirut",
    "page_number": 52,
    "volume_number": 1,
    "text": "And he said: Abbad narrated it to us from Muhammad bin Amr from Abdullah bin Abi Umamah al-Ansari; he did not say 'from his father'.\n86- Abu Abd Allah mentioned Abdullah bin al-Harith al-Makhzumi, and he said: Meccan, trustworthy (Thiqah).\n87- Abu Abd Allah said: Al-Dahhak bin Uthman, Medinan, trustworthy.\n88- Abu Abd Allah mentioned: Harish bin Sulaym, and he said: Kufan, trustworthy.\n89- And Abu Abd Allah mentioned: Qurrah bin Khalid, and he said: Trustworthy.\n90- And Abu Abd Allah mentioned: Al-Mukhtar bin Fulful, and he said: Kufan, trustworthy.\n91- And Abu Abd Allah mentioned: Mu'arrif bin Wasil, and he said: Kufan, trustworthy.",
    "foot_note": "None",
    "book_id": "25873",
    "new_page_number": 31
  },
  {
    "serial_number": "3336025",
    "category_id": "9",
    "category": "Hadith Defects and Questions",
    "book_title": "Questions of Abu Bakr Ahmad bin Muhammad bin Hani al-Athram to Abu Abd Allah Ahmad bin Muhammad bin Hanbal",
    "edition": "First, 1425 AH - 2004 AD.",
    "publisher": "Dar Al-Bashair Al-Islamiyah - Beirut",
    "page_number": 53,
    "volume_number": 1,
    "text": "92- And Abu Abd Allah mentioned: Abu Bakr al-Hanafi, and he said: Trustworthy, Basran.\nEnd of the Part.\nPraise be to Allah, Lord of the Worlds, and may Allah send blessings upon Muhammad, his family, and his companions.\nTranscribed by Ali bin Muhammad bin Ali al-Balisi, from the handwriting of Abu Tahir Isma'il bin Abdullah bin al-Anmati.",
    "foot_note": "None",
    "book_id": "25873",
    "new_page_number": 32
  }
]